   - [#  12] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   10:         self.value = value
   11:         self.left = None
   12:         self.right = None
   13:     
-  14:     def add(self, val):
-  15:         '''
-  16:         Add a new node to the tree with value. Respond based on Set semantics
-  17:         '''
-  18:         if val <= self.value:
-  19:             self.left = self.addToSubTree(self.left, val)
-  20:         elif val > self.value:
-  21:             self.right = self.addToSubTree(self.right, val)
-  22:     
+  14:     @classmethod
+  15:     def add(self, val):
+  16:         '''
+  17:         Add a new node to the tree with value. Respond based on Set semantics
+  18:         '''
+  19:         if val <= self.value:
+  20:             self.left = self.addToSubTree(self.left, val)
+  21:         elif val > self.value:
+  22:             self.right = self.addToSubTree(self.right, val)
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
   25:         if parent is None:
   26:             return BinaryNode(val)
--------------------------------------------------------------------------------
[0.09224 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree1.BinaryNode'>, val = True

>   ???
E   AttributeError: type object 'BinaryNode' has no attri

   - [#  13] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
-  23:     def addToSubTree(self, parent, val):
-  24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
-  25:         if parent is None:
-  26:             return BinaryNode(val)
-  27:         
-  28:         parent.add(val)
-  29:         return parent
-  30:     
+  23:     @classmethod
+  24:     def addToSubTree(self, parent, val):
+  25:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
+  26:         if parent is None:
+  27:             return BinaryNode(val)
+  28:         
+  29:         parent.add(val)
+  30:         return parent
   31:     def remove(self, val):
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
--------------------------------------------------------------------------------
[0.14379 s] survived

   - [#  14] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   27:         
   28:         parent.add(val)
   29:         return parent
   30:     
-  31:     def remove(self, val):
-  32:         '''
-  33:          Remove val of self from BinaryTree. 
-  34:         '''
-  35:         if val < self.value:
-  36:             self.left = self.removeFromParent(self.left, val)
-  37:         elif val > self.value:
-  38:             self.right = self.removeFromParent(self.right, val)
-  39:         else:
-  40:             if self.left is None:
-  41:                 return self.right
-  42:             
-  43:             child = self.left
-  44:             while child.right:
-  45:                 child = child.right
-  46:             
-  47:             childKey = child.value
-  48:             self.left = self.removeFromParent(self.left, childKey)
-  49:             self.value = childKey
-  50:         
-  51:         return self
-  52:     
+  31:     @classmethod
+  32:     def remove(self, val):
+  33:         '''
+  34:          Remove val of self from BinaryTree. 
+  35:         '''
+  36:         if val < self.value:
+  37:             self.left = self.removeFromParent(self.left, val)
+  38:         elif val > self.value:
+  39:             self.right = self.removeFromParent(self.right, val)
+  40:         else:
+  41:             if self.left is None:
+  42:                 return self.right
+  43:             
+  44:             child = self.left
+  45:             while child.right:
+  46:                 child = child.right
+  47:

   - [#  15] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   49:             self.value = childKey
   50:         
   51:         return self
   52:     
-  53:     def removeFromParent(self, parent, val):
-  54:         '''Helper method for remove. Ensures proper behavior when removing node that 
-  55:         has children.'''
-  56:         if parent:
-  57:             return parent.remove(val)
-  58:         return None
-  59:     
+  53:     @classmethod
+  54:     def removeFromParent(self, parent, val):
+  55:         '''Helper method for remove. Ensures proper behavior when removing node that 
+  56:         has children.'''
+  57:         if parent:
+  58:             return parent.remove(val)
+  59:         return None
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
   63:         rightS = ''
--------------------------------------------------------------------------------
[0.12446 s] survived

   - [#  16] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   56:         if parent:
   57:             return parent.remove(val)
   58:         return None
   59:     
-  60:     def __repr__(self):
-  61:         '''Useful debugging function to produce linear tree representation.'''
-  62:         leftS = ''
-  63:         rightS = ''
-  64:         if self.left:
-  65:             leftS = str(self.left)
-  66:         if self.right:
-  67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
-  69:     
+  60:     @classmethod
+  61:     def __repr__(self):
+  62:         '''Useful debugging function to produce linear tree representation.'''
+  63:         leftS = ''
+  64:         rightS = ''
+  65:         if self.left:
+  66:             leftS = str(self.left)
+  67:         if self.right:
+  68:             rightS = str(self.right)
+  69:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
   73:             for v in self.left.inorder():
--------------------------------------------------------------------------------
[0.09109 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qua

   - [#  17] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   66:         if self.right:
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
-  70:     def inorder(self):
-  71:         '''In order traversal generator of tree rooted at given node.'''
-  72:         if self.left:
-  73:             for v in self.left.inorder():
-  74:                 yield v
-  75:         
-  76:         yield self.value
-  77:         
-  78:         if self.right:
-  79:             for v in self.right.inorder():
-  80:                 yield v
-  81: 
+  70:     @classmethod
+  71:     def inorder(self):
+  72:         '''In order traversal generator of tree rooted at given node.'''
+  73:         if self.left:
+  74:             for v in self.left.inorder():
+  75:                 yield v
+  76:         
+  77:         yield self.value
+  78:         
+  79:         if self.right:
+  80:             for v in self.right.inorder():
+  81:                 yield v
   82: class BinaryTree:
   83:     
   84:     def __init__(self):
   85:         '''Create empty binary tree.'''
--------------------------------------------------------------------------------
[0.10984 s] survived

   - [#  18] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   80:                 yield v
   81: 
   82: class BinaryTree:
   83:     
-  84:     def __init__(self):
-  85:         '''Create empty binary tree.'''
-  86:         self.root = None
-  87:     
+  84:     @classmethod
+  85:     def __init__(self):
+  86:         '''Create empty binary tree.'''
+  87:         self.root = None
   88:     def add(self, value):
   89:         '''Insert value into proper location in Binary Tree.'''
   90:         if self.root is None:
   91:             self.root = BinaryNode(value)
--------------------------------------------------------------------------------
[0.11001 s] survived

   - [#  19] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   84:     def __init__(self):
   85:         '''Create empty binary tree.'''
   86:         self.root = None
   87:     
-  88:     def add(self, value):
-  89:         '''Insert value into proper location in Binary Tree.'''
-  90:         if self.root is None:
-  91:             self.root = BinaryNode(value)
-  92:         else:
-  93:             self.root.add(value)
-  94:     
+  88:     @classmethod
+  89:     def add(self, value):
+  90:         '''Insert value into proper location in Binary Tree.'''
+  91:         if self.root is None:
+  92:             self.root = BinaryNode(value)
+  93:         else:
+  94:             self.root.add(value)
   95:     def remove(self, val):
   96:         '''Remove value from tree.'''
   97:         if self.root:
   98:             self.root = self.root.remove(val)
--------------------------------------------------------------------------------
[0.11639 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_10

def test_case_10():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.add(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:110: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree1.BinaryTree'>, value = binary:()

>   ???
E   AttributeError: type object 'BinaryTree' has no attribute 'root'

binarySearchTree1:91: AttributeError

   - [#  20] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   91:             self.root = BinaryNode(value)
   92:         else:
   93:             self.root.add(value)
   94:     
-  95:     def remove(self, val):
-  96:         '''Remove value from tree.'''
-  97:         if self.root:
-  98:             self.root = self.root.remove(val)
-  99:     
+  95:     @classmethod
+  96:     def remove(self, val):
+  97:         '''Remove value from tree.'''
+  98:         if self.root:
+  99:             self.root = self.root.remove(val)
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
  103:             raise ValueError('Binary Tree is empty')
--------------------------------------------------------------------------------
[0.12842 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_14

def test_case_14():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.remove(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:130: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree1.BinaryTree'>, val = binary:()

>   ???
E   AttributeError: type object 'BinaryTree' has no attribute 'root'

binarySearchTree1:98: AttributeError

   - [#  21] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
   96:         '''Remove value from tree.'''
   97:         if self.root:
   98:             self.root = self.root.remove(val)
   99:     
- 100:     def getMin(self):
- 101:         '''Returns minimum value.'''
- 102:         if self.root is None:
- 103:             raise ValueError('Binary Tree is empty')
- 104:         n = self.root
- 105:         while n.left != None:
- 106:             n = n.left
- 107:         return n.value
- 108:     
+ 100:     @classmethod
+ 101:     def getMin(self):
+ 102:         '''Returns minimum value.'''
+ 103:         if self.root is None:
+ 104:             raise ValueError('Binary Tree is empty')
+ 105:         n = self.root
+ 106:         while n.left != None:
+ 107:             n = n.left
+ 108:         return n.value
  109:     def getMax(self):
  110:         '''Returns maximum value.'''
  111:         if self.root is None:
  112:             raise ValueError('Binary Tree is empty')
--------------------------------------------------------------------------------
[0.09568 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
        assert var_0 == 'binary:()'
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_2 = binary_tree_0.add(var_0)
        var_3 = binary_tree_0.__iter__()
        var_4 = var_3.__repr__()
>       var_5 = binary_tree_0.getMin()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:14

   - [#  22] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
  105:         while n.left != None:
  106:             n = n.left
  107:         return n.value
  108:     
- 109:     def getMax(self):
- 110:         '''Returns maximum value.'''
- 111:         if self.root is None:
- 112:             raise ValueError('Binary Tree is empty')
- 113:         n = self.root
- 114:         while n.right != None:
- 115:             n = n.right
- 116:         return n.value
- 117:     
+ 109:     @classmethod
+ 110:     def getMax(self):
+ 111:         '''Returns maximum value.'''
+ 112:         if self.root is None:
+ 113:             raise ValueError('Binary Tree is empty')
+ 114:         n = self.root
+ 115:         while n.right != None:
+ 116:             n = n.right
+ 117:         return n.value
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
  120:         node = self.root
  121:         while node:
--------------------------------------------------------------------------------
[0.09930 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_18

def test_case_18():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.getMax()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree1.BinaryTree'>

>   ???
E   AttributeError: type object 'BinaryTree' has no attribute 'root'

   - [#  23] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
  114:         while n.right != None:
  115:             n = n.right
  116:         return n.value
  117:     
- 118:     def __contains__(self, target):
- 119:         '''Check whether BST contains target value.'''
- 120:         node = self.root
- 121:         while node:
- 122:             if target < node.value:
- 123:                 node = node.left
- 124:             elif target > node.value:
- 125:                 node = node.right
- 126:             else:
- 127:                 return True
- 128:         
- 129:         return False
- 130:     
+ 118:     @classmethod
+ 119:     def __contains__(self, target):
+ 120:         '''Check whether BST contains target value.'''
+ 121:         node = self.root
+ 122:         while node:
+ 123:             if target < node.value:
+ 124:                 node = node.left
+ 125:             elif target > node.value:
+ 126:                 node = node.right
+ 127:             else:
+ 128:                 return True
+ 129:         
+ 130:         return False
  131:     def closest(self, target):
  132:         '''
  133:         Return value closest to target. If there are several, then
  134:         return one of them.
--------------------------------------------------------------------------------
[0.09987 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_20

def test_case_20():
        binary_tree_0 = module_0.BinaryTree()
        set_0 = {binary_tree_0}
        var_0 = binary_tree_0.add(set_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.__contains__(set_0)

   - [#  24] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
  127:                 return True
  128:         
  129:         return False
  130:     
- 131:     def closest(self, target):
- 132:         '''
- 133:         Return value closest to target. If there are several, then
- 134:         return one of them.
- 135:         '''
- 136:         if self.root is None:
- 137:             return None
- 138:         
- 139:         best = node = self.root
- 140:         distance = abs(self.root.value - target)
- 141:         while node:
- 142:             if abs(node.value - target) < distance:
- 143:                 distance = abs(node.value - target)
- 144:                 best = node
- 145:             if target < node.value:
- 146:                 node = node.left
- 147:             elif target > node.value:
- 148:                 node = node.right
- 149:             else:
- 150:                 return target
- 151:         
- 152:         return best.value
- 153:     
+ 131:     @classmethod
+ 132:     def closest(self, target):
+ 133:         '''
+ 134:         Return value closest to target. If there are several, then
+ 135:         return one of them.
+ 136:         '''
+ 137:         if self.root is None:
+ 138:             return None
+ 139:         
+ 140:         best = node = self.root
+ 141:         distance = abs(self.root.value - target)
+ 142:         while node:
+ 143:             if abs(node.value - target) < distance:
+ 144:                 distance = abs(node.value - target)
+ 145:                 best = node
+ 146:             if target < node.value:

   - [#  25] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
  150:                 return target
  151:         
  152:         return best.value
  153:     
- 154:     def __iter__(self):
- 155:         '''In order traversal of elements in the tree.'''
- 156:         if self.root:
- 157:             for e in self.root.inorder():
- 158:                 yield e
- 159:     
+ 154:     @classmethod
+ 155:     def __iter__(self):
+ 156:         '''In order traversal of elements in the tree.'''
+ 157:         if self.root:
+ 158:             for e in self.root.inorder():
+ 159:                 yield e
  160:     def __repr__(self):
  161:         if self.root is None:
  162:             return 'binary:()'
  163:         return 'binary:' + str(self.root)
--------------------------------------------------------------------------------
[0.10794 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_26

def test_case_26():
        binary_tree_0 = module_0.BinaryTree()
>       object_0 = module_1.object(*binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:208: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree1.BinaryTree'>

>   ???
E   AttributeError: type object 'BinaryTree' has no attribute 'root'

binarySearchTree1:157: AttributeError

   - [#  26] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
  156:         if self.root:
  157:             for e in self.root.inorder():
  158:                 yield e
  159:     
- 160:     def __repr__(self):
- 161:         if self.root is None:
- 162:             return 'binary:()'
- 163:         return 'binary:' + str(self.root)
- 164: 
+ 160:     @classmethod
+ 161:     def __repr__(self):
+ 162:         if self.root is None:
+ 163:             return 'binary:()'
+ 164:         return 'binary:' + str(self.root)
  165: '''
  166: Change Log:
  167: -----------
  168: 
--------------------------------------------------------------------------------
[0.12563 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
>       var_0 = binary_tree_0.__repr__()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:135: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree1.BinaryTree'>

>   ???
E   AttributeError: type object 'BinaryTree' has no attribute 'root'

binarySearchTree1:162: AttributeError

   - [#  27] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   14:     def add(self, val):
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
-  18:         if val <= self.value:
+  18:         if not (val <= self.value):
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
--------------------------------------------------------------------------------
[0.10984 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
        var_0 = binary_node_0.add(bool_0)
>       assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:11: AssertionError

   - [#  28] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
   18:         if val <= self.value:
   19:             self.left = self.addToSubTree(self.left, val)
-  20:         elif val > self.value:
+  20:         elif not (val > self.value):
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
--------------------------------------------------------------------------------
[0.09649 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
        var_0 = binary_node_0.add(bool_0)
>       assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:11: AssertionError

   - [#  29] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
-  25:         if parent is None:
+  25:         if not (parent is None):
   26:             return BinaryNode(val)
   27:         
   28:         parent.add(val)
   29:         return parent
--------------------------------------------------------------------------------
[0.08782 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:21: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), parent = None, val = True

>   ???
E   AttributeError: 'NoneType' object has no attribute 'add'

binarySearchTree1:28: AttributeError

   - [#  30] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   31:     def remove(self, val):
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
-  35:         if val < self.value:
+  35:         if not (val < self.value):
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
--------------------------------------------------------------------------------
[0.09228 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = var_0.removeFromParent(binary_node_0, bool_0)
>       assert binary_node_0.left is None
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:42: AssertionError

   - [#  31] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   33:          Remove val of self from BinaryTree. 
   34:         '''
   35:         if val < self.value:
   36:             self.left = self.removeFromParent(self.left, val)
-  37:         elif val > self.value:
+  37:         elif not (val > self.value):
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
   41:                 return self.right
--------------------------------------------------------------------------------
[0.09183 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_2

def test_case_2():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
        var_0 = binary_node_0.remove(bool_0)
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:25: AssertionError

   - [#  32] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
-  40:             if self.left is None:
+  40:             if not (self.left is None):
   41:                 return self.right
   42:             
   43:             child = self.left
   44:             while child.right:
--------------------------------------------------------------------------------
[0.11686 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_3

def test_case_3():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
>       var_0 = binary_node_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:33: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = False

>   ???
E   AttributeError: 'NoneType' object has no attribute 'right'

binarySearchTree1:44: AttributeError
