   - [#  33] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   40:             if self.left is None:
   41:                 return self.right
   42:             
   43:             child = self.left
-  44:             while child.right:
+  44:             while not (child.right):
   45:                 child = child.right
   46:             
   47:             childKey = child.value
   48:             self.left = self.removeFromParent(self.left, childKey)
--------------------------------------------------------------------------------
[0.10900 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = var_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L:(L: True R:) True R:), val = True

>   ???
E   AttributeError: 'NoneType' object has no attribute 'right'

binarySearchTree1:44: AttributeError

   - [#  34] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   52:     
   53:     def removeFromParent(self, parent, val):
   54:         '''Helper method for remove. Ensures proper behavior when removing node that 
   55:         has children.'''
-  56:         if parent:
+  56:         if not parent:
   57:             return parent.remove(val)
   58:         return None
   59:     
   60:     def __repr__(self):
--------------------------------------------------------------------------------
[0.08573 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_2

def test_case_2():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.remove(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:38: in remove
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), parent = None, val = True

>   ???
E   AttributeError: 'NoneType' object has no attribute 'remove'

binarySearchTree1:57: AttributeError

   - [#  35] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
   63:         rightS = ''
-  64:         if self.left:
+  64:         if not (self.left):
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
--------------------------------------------------------------------------------
[0.09531 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_

   - [#  36] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   62:         leftS = ''
   63:         rightS = ''
   64:         if self.left:
   65:             leftS = str(self.left)
-  66:         if self.right:
+  66:         if not (self.right):
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
--------------------------------------------------------------------------------
[0.09559 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f

   - [#  37] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
-  72:         if self.left:
+  72:         if not (self.left):
   73:             for v in self.left.inorder():
   74:                 yield v
   75:         
   76:         yield self.value
--------------------------------------------------------------------------------
[0.12164 s] survived

   - [#  38] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   74:                 yield v
   75:         
   76:         yield self.value
   77:         
-  78:         if self.right:
+  78:         if not (self.right):
   79:             for v in self.right.inorder():
   80:                 yield v
   81: 
   82: class BinaryTree:
--------------------------------------------------------------------------------
[0.12116 s] survived

   - [#  39] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   86:         self.root = None
   87:     
   88:     def add(self, value):
   89:         '''Insert value into proper location in Binary Tree.'''
-  90:         if self.root is None:
+  90:         if not (self.root is None):
   91:             self.root = BinaryNode(value)
   92:         else:
   93:             self.root.add(value)
   94:     
--------------------------------------------------------------------------------
[0.14749 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_10

def test_case_10():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.add(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:110: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(), value = binary:()

>   ???
E   AttributeError: 'NoneType' object has no attribute 'add'

binarySearchTree1:93: AttributeError

   - [#  40] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   93:             self.root.add(value)
   94:     
   95:     def remove(self, val):
   96:         '''Remove value from tree.'''
-  97:         if self.root:
+  97:         if not (self.root):
   98:             self.root = self.root.remove(val)
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
--------------------------------------------------------------------------------
[0.09897 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_14

def test_case_14():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.remove(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:130: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(), val = binary:()

>   ???
E   AttributeError: 'NoneType' object has no attribute 'remove'

binarySearchTree1:98: AttributeError

   - [#  41] COI binarySearchTree1: 
--------------------------------------------------------------------------------
   98:             self.root = self.root.remove(val)
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
- 102:         if self.root is None:
+ 102:         if not (self.root is None):
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
  105:         while n.left != None:
  106:             n = n.left
--------------------------------------------------------------------------------
[0.09922 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
        assert var_0 == 'binary:()'
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_2 = binary_tree_0.add(var_0)
        var_3 = binary_tree_0.__iter__()
        var_4 = var_3.__repr__()
>       var_5 = binary_tree_0.getMin()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:142: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L:(L: binary:() R:) binary:() R:)

>   ???
E   ValueError: Binary Tree is empty

binarySearchTree1:103: ValueError

   - [#  42] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
- 105:         while n.left != None:
+ 105:         while not (n.left != None):
  106:             n = n.left
  107:         return n.value
  108:     
  109:     def getMax(self):
--------------------------------------------------------------------------------
[0.10024 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_16

def test_case_16():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.getMin()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:149: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while getting the str of an object') raised in repr()] BinaryTree object at 0x7fa525560a60>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'left'

binarySearchTree1:105: AttributeError

   - [#  43] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  107:         return n.value
  108:     
  109:     def getMax(self):
  110:         '''Returns maximum value.'''
- 111:         if self.root is None:
+ 111:         if not (self.root is None):
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
  114:         while n.right != None:
  115:             n = n.right
--------------------------------------------------------------------------------
[0.09919 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_18

def test_case_18():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.getMax()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while getting the str of an object') raised in repr()] BinaryTree object at 0x7fa525201b70>

>   ???
E   ValueError: Binary Tree is empty

binarySearchTree1:112: ValueError

   - [#  44] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  110:         '''Returns maximum value.'''
  111:         if self.root is None:
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
- 114:         while n.right != None:
+ 114:         while not (n.right != None):
  115:             n = n.right
  116:         return n.value
  117:     
  118:     def __contains__(self, target):
--------------------------------------------------------------------------------
[0.09783 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_18

def test_case_18():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.getMax()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while getting the str of an object') raised in repr()] BinaryTree object at 0x7fa524e8a4a0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'right'

binarySearchTree1:114: AttributeError

   - [#  46] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
  120:         node = self.root
  121:         while node:
- 122:             if target < node.value:
+ 122:             if not (target < node.value):
  123:                 node = node.left
  124:             elif target > node.value:
  125:                 node = node.right
  126:             else:
--------------------------------------------------------------------------------
[0.10435 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_20

def test_case_20():
        binary_tree_0 = module_0.BinaryTree()
        set_0 = {binary_tree_0}
        var_0 = binary_tree_0.add(set_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_tree_0.__contains__(set_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:177: AssertionError

   - [#  47] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  120:         node = self.root
  121:         while node:
  122:             if target < node.value:
  123:                 node = node.left
- 124:             elif target > node.value:
+ 124:             elif not (target > node.value):
  125:                 node = node.right
  126:             else:
  127:                 return True
  128:         
--------------------------------------------------------------------------------
[0.10397 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_20

def test_case_20():
        binary_tree_0 = module_0.BinaryTree()
        set_0 = {binary_tree_0}
        var_0 = binary_tree_0.add(set_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_tree_0.__contains__(set_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:177: AssertionError

   - [#  48] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  132:         '''
  133:         Return value closest to target. If there are several, then
  134:         return one of them.
  135:         '''
- 136:         if self.root is None:
+ 136:         if not (self.root is None):
  137:             return None
  138:         
  139:         best = node = self.root
  140:         distance = abs(self.root.value - target)
--------------------------------------------------------------------------------
[0.10565 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_23

def test_case_23():
        bool_0 = True
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_tree_0.closest(bool_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:195: AssertionError

   - [#  50] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  138:         
  139:         best = node = self.root
  140:         distance = abs(self.root.value - target)
  141:         while node:
- 142:             if abs(node.value - target) < distance:
+ 142:             if not (abs(node.value - target) < distance):
  143:                 distance = abs(node.value - target)
  144:                 best = node
  145:             if target < node.value:
  146:                 node = node.left
--------------------------------------------------------------------------------
[0.10707 s] survived

   - [#  51] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  141:         while node:
  142:             if abs(node.value - target) < distance:
  143:                 distance = abs(node.value - target)
  144:                 best = node
- 145:             if target < node.value:
+ 145:             if not (target < node.value):
  146:                 node = node.left
  147:             elif target > node.value:
  148:                 node = node.right
  149:             else:
--------------------------------------------------------------------------------
[0.14226 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_WHOLE_SUITE.py::test_case_13

def test_case_13():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        none_type_0 = None
        bool_1 = False
        var_1 = binary_tree_0.__contains__(bool_1)
        assert var_1 is False
        bool_2 = False
        set_0 = {bool_2}
        var_2 = binary_tree_0.getMax()
        assert var_2 is True
        var_3 = binary_tree_0.closest(bool_2)
>       assert var_3 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_WHOLE_SUITE.py:139: AssertionError

   - [#  53] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  152:         return best.value
  153:     
  154:     def __iter__(self):
  155:         '''In order traversal of elements in the tree.'''
- 156:         if self.root:
+ 156:         if not (self.root):
  157:             for e in self.root.inorder():
  158:                 yield e
  159:     
  160:     def __repr__(self):
--------------------------------------------------------------------------------
[0.10915 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_26

def test_case_26():
        binary_tree_0 = module_0.BinaryTree()
>       object_0 = module_1.object(*binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:208: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:()

>   ???
E   AttributeError: 'NoneType' object has no attribute 'inorder'

binarySearchTree1:157: AttributeError

   - [#  54] COI binarySearchTree1: 
--------------------------------------------------------------------------------
  157:             for e in self.root.inorder():
  158:                 yield e
  159:     
  160:     def __repr__(self):
- 161:         if self.root is None:
+ 161:         if not (self.root is None):
  162:             return 'binary:()'
  163:         return 'binary:' + str(self.root)
  164: 
  165: '''
--------------------------------------------------------------------------------
[0.09771 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
>       assert var_0 == 'binary:()'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:136: AssertionError

   - [#  55] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   58:         return None
   59:     
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
-  62:         leftS = ''
+  62:         leftS = 'mutpy'
   63:         rightS = ''
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
--------------------------------------------------------------------------------
[0.09345 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_1.right).__module

   - [#  56] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   59:     
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
-  63:         rightS = ''
+  63:         rightS = 'mutpy'
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
--------------------------------------------------------------------------------
[0.09618 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var

   - [#  57] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('mutpy' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.11381 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'

   - [#  58] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.09537 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type
