   - [#  59] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('(L:' + leftS) + 'mutpy') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.09181 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert

   - [#  60] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('(L:' + leftS) + '') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.09574 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{ty

   - [#  61] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + 'mutpy') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.13673 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'

   - [#  62] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + '') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.12423 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type

   - [#  63] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + 'mutpy'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.09715 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert

   - [#  64] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ''
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.09422 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{ty

   - [#  65] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
- 103:             raise ValueError('Binary Tree is empty')
+ 103:             raise ValueError('mutpy')
  104:         n = self.root
  105:         while n.left != None:
  106:             n = n.left
  107:         return n.value
--------------------------------------------------------------------------------
[0.15565 s] survived

   - [#  66] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
- 103:             raise ValueError('Binary Tree is empty')
+ 103:             raise ValueError('')
  104:         n = self.root
  105:         while n.left != None:
  106:             n = n.left
  107:         return n.value
--------------------------------------------------------------------------------
[0.11550 s] survived

   - [#  69] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
  158:                 yield e
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
- 162:             return 'binary:()'
+ 162:             return 'mutpy'
  163:         return 'binary:' + str(self.root)
  164: 
  165: '''
  166: Change Log:
--------------------------------------------------------------------------------
[0.10106 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
>       assert var_0 == 'binary:()'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:136: AssertionError

   - [#  70] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
  158:                 yield e
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
- 162:             return 'binary:()'
+ 162:             return ''
  163:         return 'binary:' + str(self.root)
  164: 
  165: '''
  166: Change Log:
--------------------------------------------------------------------------------
[0.14132 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
>       assert var_0 == 'binary:()'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:136: AssertionError

   - [#  71] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
  162:             return 'binary:()'
- 163:         return 'binary:' + str(self.root)
+ 163:         return 'mutpy' + str(self.root)
  164: 
  165: '''
  166: Change Log:
  167: -----------
--------------------------------------------------------------------------------
[0.12981 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_9

def test_case_9():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.remove(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__repr__()
>       assert var_4 == 'binary:(L:(L: False R:) False R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:77: AssertionError

   - [#  72] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
  162:             return 'binary:()'
- 163:         return 'binary:' + str(self.root)
+ 163:         return '' + str(self.root)
  164: 
  165: '''
  166: Change Log:
  167: -----------
--------------------------------------------------------------------------------
[0.16255 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_9

def test_case_9():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.remove(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__repr__()
>       assert var_4 == 'binary:(L:(L: False R:) False R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:77: AssertionError

   - [#  73] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
  161:         if self.root is None:
  162:             return 'binary:()'
  163:         return 'binary:' + str(self.root)
  164: 
- 165: '''
- 166: Change Log:
- 167: -----------
- 168: 
- 169: '''
+ 165: '''mutpy'''
--------------------------------------------------------------------------------
[0.12376 s] survived

   - [#  74] CRP binarySearchTree1: 
--------------------------------------------------------------------------------
  161:         if self.root is None:
  162:             return 'binary:()'
  163:         return 'binary:' + str(self.root)
  164: 
- 165: '''
- 166: Change Log:
- 167: -----------
- 168: 
- 169: '''
+ 165: ''''''
--------------------------------------------------------------------------------
[0.11374 s] survived

   - [#  75] OIL binarySearchTree1: 
--------------------------------------------------------------------------------
   42:             
   43:             child = self.left
   44:             while child.right:
   45:                 child = child.right
-  46:             
+  46:                 break
   47:             childKey = child.value
   48:             self.left = self.removeFromParent(self.left, childKey)
   49:             self.value = childKey
   50:         
--------------------------------------------------------------------------------
[0.13363 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_28

def test_case_28():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        int_0 = 3380
        var_2 = binary_tree_0.add(int_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__contains__(var_1)
        assert var_4 is True
        var_5 = binary_tree_0.add(var_4)
        var_6 = binary_tree_0.getMax()
        assert var_6 == 3380
        var_7 = binary_tree_0.closest(var_6)
        var_8 = var_3.__repr__()
        var_9 = binary_tree_0.add(var_7)
        var_10 = binary_tree_0.remove(var_7)
        var_11 = binary_tree_0.__repr__()
>       assert var_11 == 'binary:(L:(L: False R:(L: True R:)) 3380 R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:357: AssertionError

   - [#  76] OIL binarySearchTree1: 
--------------------------------------------------------------------------------
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
   73:             for v in self.left.inorder():
   74:                 yield v
-  75:         
+  75:                 break
   76:         yield self.value
   77:         
   78:         if self.right:
   79:             for v in self.right.inorder():
--------------------------------------------------------------------------------
[0.10711 s] survived

   - [#  78] OIL binarySearchTree1: 
--------------------------------------------------------------------------------
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
  105:         while n.left != None:
  106:             n = n.left
- 107:         return n.value
- 108:     
+ 107:             break
+ 108:         return n.value
  109:     def getMax(self):
  110:         '''Returns maximum value.'''
  111:         if self.root is None:
  112:             raise ValueError('Binary Tree is empty')
--------------------------------------------------------------------------------
[0.10986 s] survived

   - [#  79] OIL binarySearchTree1: 
--------------------------------------------------------------------------------
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
  114:         while n.right != None:
  115:             n = n.right
- 116:         return n.value
- 117:     
+ 116:             break
+ 117:         return n.value
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
  120:         node = self.root
  121:         while node:
--------------------------------------------------------------------------------
[0.13438 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_30

def test_case_30():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        int_0 = -4493
        var_2 = binary_tree_0.add(int_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__contains__(var_1)
        assert var_4 is True
        var_5 = binary_tree_0.add(var_4)
        var_6 = binary_tree_0.getMax()
>       assert var_6 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:390: AssertionError

   - [#  80] OIL binarySearchTree1: 
--------------------------------------------------------------------------------
  123:                 node = node.left
  124:             elif target > node.value:
  125:                 node = node.right
  126:             else:
- 127:                 return True
+ 127:                 return Truebreak
  128:         
  129:         return False
  130:     
  131:     def closest(self, target):
--------------------------------------------------------------------------------
[0.18376 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_27

def test_case_27():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.__contains__(var_1)
        assert var_3 is True
        var_4 = binary_tree_0.add(var_3)
        var_5 = binary_tree_0.getMax()
        assert var_5 is True
        var_6 = var_5.__repr__()
        assert var_6 == 'True'
        var_7 = binary_tree_0.__contains__(var_3)
>       assert var_7 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:336: AssertionError

   - [#  81] OIL binarySearchTree1: 
--------------------------------------------------------------------------------
  146:                 node = node.left
  147:             elif target > node.value:
  148:                 node = node.right
  149:             else:
- 150:                 return target
+ 150:                 return targetbreak
  151:         
  152:         return best.value
  153:     
  154:     def __iter__(self):
--------------------------------------------------------------------------------
[0.14624 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_22

def test_case_22():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.__contains__(var_1)
        assert var_3 is True
        var_4 = binary_tree_0.add(var_3)
        var_5 = binary_tree_0.getMax()
        assert var_5 is True
        var_6 = binary_tree_0.closest(var_5)
>       assert var_6 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:251: AssertionError

   - [#  82] OIL binarySearchTree1: 
--------------------------------------------------------------------------------
  155:         '''In order traversal of elements in the tree.'''
  156:         if self.root:
  157:             for e in self.root.inorder():
  158:                 yield e
- 159:     
+ 159:                 break
  160:     def __repr__(self):
  161:         if self.root is None:
  162:             return 'binary:()'
  163:         return 'binary:' + str(self.root)
--------------------------------------------------------------------------------
[0.10850 s] survived

   - [#  83] RIL binarySearchTree1: 
--------------------------------------------------------------------------------
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
-  73:             for v in self.left.inorder():
+  73:             for v in reversed(self.left.inorder()):
   74:                 yield v
   75:         
   76:         yield self.value
   77:         
--------------------------------------------------------------------------------
[0.12271 s] survived

   - [#  84] RIL binarySearchTree1: 
--------------------------------------------------------------------------------
   75:         
   76:         yield self.value
   77:         
   78:         if self.right:
-  79:             for v in self.right.inorder():
+  79:             for v in reversed(self.right.inorder()):
   80:                 yield v
   81: 
   82: class BinaryTree:
   83:     
--------------------------------------------------------------------------------
[0.11520 s] survived

   - [#  85] RIL binarySearchTree1: 
--------------------------------------------------------------------------------
  153:     
  154:     def __iter__(self):
  155:         '''In order traversal of elements in the tree.'''
  156:         if self.root:
- 157:             for e in self.root.inorder():
+ 157:             for e in reversed(self.root.inorder()):
  158:                 yield e
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
--------------------------------------------------------------------------------
[0.13334 s] survived

   - [#  86] ROR binarySearchTree1: 
--------------------------------------------------------------------------------
   14:     def add(self, val):
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
-  18:         if val <= self.value:
+  18:         if val >= self.value:
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
--------------------------------------------------------------------------------
[0.13888 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
        var_0 = binary_node_0.add(bool_0)
>       assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:11: AssertionError

   - [#  87] ROR binarySearchTree1: 
--------------------------------------------------------------------------------
   14:     def add(self, val):
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
-  18:         if val <= self.value:
+  18:         if val < self.value:
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
--------------------------------------------------------------------------------
[0.10591 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_1

def test_case_1():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
>       assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:17: AssertionError

   - [#  90] ROR binarySearchTree1: 
--------------------------------------------------------------------------------
   31:     def remove(self, val):
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
-  35:         if val < self.value:
+  35:         if val > self.value:
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
--------------------------------------------------------------------------------
[0.10583 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_5

def test_case_5():
        str_0 = 'X>'
        str_1 = 'qkr(Szzyf\t'
        binary_node_0 = module_0.BinaryNode(str_1)
        var_0 = binary_node_0.remove(str_0)
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:54: AssertionError
