   - [#  91] ROR binarySearchTree1: 
--------------------------------------------------------------------------------
   31:     def remove(self, val):
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
-  35:         if val < self.value:
+  35:         if val <= self.value:
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
--------------------------------------------------------------------------------
[0.15800 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = var_0.removeFromParent(binary_node_0, bool_0)
>       assert binary_node_0.left is None
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:42: AssertionError

   - [#  94] ROR binarySearchTree1: 
--------------------------------------------------------------------------------
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
- 105:         while n.left != None:
+ 105:         while n.left == None:
  106:             n = n.left
  107:         return n.value
  108:     
  109:     def getMax(self):
--------------------------------------------------------------------------------
[0.11558 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_16

def test_case_16():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.getMin()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:149: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while getting the str of an object') raised in repr()] BinaryTree object at 0x7fa5253665f0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'left'

binarySearchTree1:105: AttributeError

   - [#  95] ROR binarySearchTree1: 
--------------------------------------------------------------------------------
  110:         '''Returns maximum value.'''
  111:         if self.root is None:
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
- 114:         while n.right != None:
+ 114:         while n.right == None:
  115:             n = n.right
  116:         return n.value
  117:     
  118:     def __contains__(self, target):
--------------------------------------------------------------------------------
[0.10053 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_18

def test_case_18():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.getMax()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while getting the str of an object') raised in repr()] BinaryTree object at 0x7fa525158760>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'right'

binarySearchTree1:114: AttributeError

   - [# 122] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
    6: class BinaryNode:
    7:     
    8:     def __init__(self, value):
    9:         '''Create binary node.'''
-  10:         self.value = value
+  10:         pass
   11:         self.left = None
   12:         self.right = None
   13:     
   14:     def add(self, val):
--------------------------------------------------------------------------------
[0.10319 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'BinaryNode' object has no attribute 'value'") raised in repr()] BinaryNode object at 0x7fa525349780>
val = True

>   ???
E   AttributeError: 'BinaryNode' object has no attribute 'value'

binarySearchTree1:18: AttributeError

   - [# 123] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
    7:     
    8:     def __init__(self, value):
    9:         '''Create binary node.'''
   10:         self.value = value
-  11:         self.left = None
+  11:         pass
   12:         self.right = None
   13:     
   14:     def add(self, val):
   15:         '''
--------------------------------------------------------------------------------
[0.09596 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_1

def test_case_1():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
>       var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:28: in addToSubTree
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'BinaryNode' object has no attribute 'left'") raised in repr()] BinaryNode object at 0x7fa524ff8730>
val = False

>   ???
E   AttributeError: 'BinaryNode' object has no attribute 'left'

binarySearchTree1:19: AttributeError

   - [# 124] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
    8:     def __init__(self, value):
    9:         '''Create binary node.'''
   10:         self.value = value
   11:         self.left = None
-  12:         self.right = None
+  12:         pass
   13:     
   14:     def add(self, val):
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
--------------------------------------------------------------------------------
[0.11930 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'BinaryNode' object has no attribute 'right'") raised in repr()] BinaryNode object at 0x7fa5252f3070>
val = True

>   ???
E   AttributeError: 'BinaryNode' object has no attribute 'right'

binarySearchTree1:21: AttributeError

   - [# 125] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
   18:         if val <= self.value:
-  19:             self.left = self.addToSubTree(self.left, val)
+  19:             pass
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
--------------------------------------------------------------------------------
[0.09705 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_1

def test_case_1():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
>       assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:17: AssertionError

   - [# 126] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   17:         '''
   18:         if val <= self.value:
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
-  21:             self.right = self.addToSubTree(self.right, val)
+  21:             pass
   22:     
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
   25:         if parent is None:
--------------------------------------------------------------------------------
[0.08988 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
        var_0 = binary_node_0.add(bool_0)
>       assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:11: AssertionError

   - [# 127] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   22:     
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
   25:         if parent is None:
-  26:             return BinaryNode(val)
+  26:             pass
   27:         
   28:         parent.add(val)
   29:         return parent
   30:     
--------------------------------------------------------------------------------
[0.12285 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:21: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), parent = None, val = True

>   ???
E   AttributeError: 'NoneType' object has no attribute 'add'

binarySearchTree1:28: AttributeError

   - [# 128] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
   25:         if parent is None:
   26:             return BinaryNode(val)
   27:         
-  28:         parent.add(val)
+  28:         pass
   29:         return parent
   30:     
   31:     def remove(self, val):
   32:         '''
--------------------------------------------------------------------------------
[0.09777 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_1

def test_case_1():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
>       assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:17: AssertionError

   - [# 129] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   25:         if parent is None:
   26:             return BinaryNode(val)
   27:         
   28:         parent.add(val)
-  29:         return parent
+  29:         pass
   30:     
   31:     def remove(self, val):
   32:         '''
   33:          Remove val of self from BinaryTree. 
--------------------------------------------------------------------------------
[0.11448 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_1

def test_case_1():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AttributeError: 'NoneType' object has no attribute 'left'

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:18: AttributeError

   - [# 130] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
   35:         if val < self.value:
-  36:             self.left = self.removeFromParent(self.left, val)
+  36:             pass
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
--------------------------------------------------------------------------------
[0.11540 s] survived

   - [# 131] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   34:         '''
   35:         if val < self.value:
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
-  38:             self.right = self.removeFromParent(self.right, val)
+  38:             pass
   39:         else:
   40:             if self.left is None:
   41:                 return self.right
   42:             
--------------------------------------------------------------------------------
[0.15504 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_28

def test_case_28():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        int_0 = 3380
        var_2 = binary_tree_0.add(int_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__contains__(var_1)
        assert var_4 is True
        var_5 = binary_tree_0.add(var_4)
        var_6 = binary_tree_0.getMax()
        assert var_6 == 3380
        var_7 = binary_tree_0.closest(var_6)
        var_8 = var_3.__repr__()
        var_9 = binary_tree_0.add(var_7)
        var_10 = binary_tree_0.remove(var_7)
        var_11 = binary_tree_0.__repr__()
>       assert var_11 == 'binary:(L:(L: False R:(L: True R:)) 3380 R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:357: AssertionError

   - [# 132] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
-  41:                 return self.right
+  41:                 pass
   42:             
   43:             child = self.left
   44:             while child.right:
   45:                 child = child.right
--------------------------------------------------------------------------------
[0.10686 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_3

def test_case_3():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
>       var_0 = binary_node_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:33: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = False

>   ???
E   AttributeError: 'NoneType' object has no attribute 'right'

binarySearchTree1:44: AttributeError

   - [# 133] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   39:         else:
   40:             if self.left is None:
   41:                 return self.right
   42:             
-  43:             child = self.left
+  43:             pass
   44:             while child.right:
   45:                 child = child.right
   46:             
   47:             childKey = child.value
--------------------------------------------------------------------------------
[0.11128 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = var_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L:(L: True R:) True R:), val = True

>   ???
E   UnboundLocalError: local variable 'child' referenced before assignment

binarySearchTree1:44: UnboundLocalError

   - [# 134] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   41:                 return self.right
   42:             
   43:             child = self.left
   44:             while child.right:
-  45:                 child = child.right
+  45:                 pass
   46:             
   47:             childKey = child.value
   48:             self.left = self.removeFromParent(self.left, childKey)
   49:             self.value = childKey
--------------------------------------------------------------------------------
[5.00651 s] timeout

   - [# 135] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   43:             child = self.left
   44:             while child.right:
   45:                 child = child.right
   46:             
-  47:             childKey = child.value
+  47:             pass
   48:             self.left = self.removeFromParent(self.left, childKey)
   49:             self.value = childKey
   50:         
   51:         return self
--------------------------------------------------------------------------------
[0.08983 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = var_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L:(L: True R:) True R:), val = True

>   ???
E   NameError: name 'childKey' is not defined

binarySearchTree1:48: NameError

   - [# 136] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   44:             while child.right:
   45:                 child = child.right
   46:             
   47:             childKey = child.value
-  48:             self.left = self.removeFromParent(self.left, childKey)
+  48:             pass
   49:             self.value = childKey
   50:         
   51:         return self
   52:     
--------------------------------------------------------------------------------
[0.09264 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = var_0.removeFromParent(binary_node_0, bool_0)
>       assert binary_node_0.left is None
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:42: AssertionError

   - [# 137] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   45:                 child = child.right
   46:             
   47:             childKey = child.value
   48:             self.left = self.removeFromParent(self.left, childKey)
-  49:             self.value = childKey
+  49:             pass
   50:         
   51:         return self
   52:     
   53:     def removeFromParent(self, parent, val):
--------------------------------------------------------------------------------
[0.13233 s] survived

   - [# 138] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   47:             childKey = child.value
   48:             self.left = self.removeFromParent(self.left, childKey)
   49:             self.value = childKey
   50:         
-  51:         return self
+  51:         pass
   52:     
   53:     def removeFromParent(self, parent, val):
   54:         '''Helper method for remove. Ensures proper behavior when removing node that 
   55:         has children.'''
--------------------------------------------------------------------------------
[0.09934 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_2

def test_case_2():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
        var_0 = binary_node_0.remove(bool_0)
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:25: AssertionError

   - [# 139] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   53:     def removeFromParent(self, parent, val):
   54:         '''Helper method for remove. Ensures proper behavior when removing node that 
   55:         has children.'''
   56:         if parent:
-  57:             return parent.remove(val)
+  57:             pass
   58:         return None
   59:     
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
--------------------------------------------------------------------------------
[0.08811 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = var_0.removeFromParent(binary_node_0, bool_0)
>       assert binary_node_0.left is None
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:42: AssertionError

   - [# 140] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   54:         '''Helper method for remove. Ensures proper behavior when removing node that 
   55:         has children.'''
   56:         if parent:
   57:             return parent.remove(val)
-  58:         return None
+  58:         pass
   59:     
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
--------------------------------------------------------------------------------
[0.10733 s] survived

   - [# 141] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   58:         return None
   59:     
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
-  62:         leftS = ''
+  62:         pass
   63:         rightS = ''
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
--------------------------------------------------------------------------------
[0.08924 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_1.right).__module__}.{type(v

   - [# 142] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   59:     
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
-  63:         rightS = ''
+  63:         pass
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
--------------------------------------------------------------------------------
[0.09370 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_1.right).__

   - [# 143] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
   63:         rightS = ''
   64:         if self.left:
-  65:             leftS = str(self.left)
+  65:             pass
   66:         if self.right:
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
--------------------------------------------------------------------------------
[0.09474 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_9

def test_case_9():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = var_0.__repr__()
>       assert var_1 == '(L:(L: True R:) True R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:106: AssertionError
