   - [# 144] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   63:         rightS = ''
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
-  67:             rightS = str(self.right)
+  67:             pass
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
--------------------------------------------------------------------------------
[0.10064 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualname__}' == 'bina

   - [# 146] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
   73:             for v in self.left.inorder():
-  74:                 yield v
+  74:                 pass
   75:         
   76:         yield self.value
   77:         
   78:         if self.right:
--------------------------------------------------------------------------------
[0.14868 s] survived

   - [# 147] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   72:         if self.left:
   73:             for v in self.left.inorder():
   74:                 yield v
   75:         
-  76:         yield self.value
+  76:         pass
   77:         
   78:         if self.right:
   79:             for v in self.right.inorder():
   80:                 yield v
--------------------------------------------------------------------------------
[0.11146 s] survived

   - [# 148] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   76:         yield self.value
   77:         
   78:         if self.right:
   79:             for v in self.right.inorder():
-  80:                 yield v
+  80:                 pass
   81: 
   82: class BinaryTree:
   83:     
   84:     def __init__(self):
--------------------------------------------------------------------------------
[0.11449 s] survived

   - [# 149] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   82: class BinaryTree:
   83:     
   84:     def __init__(self):
   85:         '''Create empty binary tree.'''
-  86:         self.root = None
+  86:         pass
   87:     
   88:     def add(self, value):
   89:         '''Insert value into proper location in Binary Tree.'''
   90:         if self.root is None:
--------------------------------------------------------------------------------
[0.09623 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_10

def test_case_10():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.add(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:110: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'BinaryTree' object has no attribute 'root'") raised in repr()] BinaryTree object at 0x7fa524f97f10>
value = <[AttributeError("'BinaryTree' object has no attribute 'root'") raised in repr()] BinaryTree object at 0x7fa524f97f10>

>   ???
E   AttributeError: 'BinaryTree' object has no attribute 'root'

binarySearchTree1:90: AttributeError

   - [# 150] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   87:     
   88:     def add(self, value):
   89:         '''Insert value into proper location in Binary Tree.'''
   90:         if self.root is None:
-  91:             self.root = BinaryNode(value)
+  91:             pass
   92:         else:
   93:             self.root.add(value)
   94:     
   95:     def remove(self, val):
--------------------------------------------------------------------------------
[0.12459 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_10

def test_case_10():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
>       assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:111: AssertionError

   - [# 151] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   89:         '''Insert value into proper location in Binary Tree.'''
   90:         if self.root is None:
   91:             self.root = BinaryNode(value)
   92:         else:
-  93:             self.root.add(value)
+  93:             pass
   94:     
   95:     def remove(self, val):
   96:         '''Remove value from tree.'''
   97:         if self.root:
--------------------------------------------------------------------------------
[0.13247 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_9

def test_case_9():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.remove(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__repr__()
>       assert var_4 == 'binary:(L:(L: False R:) False R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:77: AssertionError

   - [# 152] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   94:     
   95:     def remove(self, val):
   96:         '''Remove value from tree.'''
   97:         if self.root:
-  98:             self.root = self.root.remove(val)
+  98:             pass
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
--------------------------------------------------------------------------------
[0.16652 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_17

def test_case_17():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.__contains__(binary_tree_0)
        assert var_0 is False
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_2 = binary_tree_0.__contains__(var_0)
        assert var_2 is True
        var_3 = binary_tree_0.getMax()
        assert var_3 is False
        var_4 = var_1.__repr__()
        var_5 = binary_tree_0.__contains__(var_2)
        assert var_5 is False
        var_6 = binary_tree_0.add(var_5)
        var_7 = binary_tree_0.remove(var_3)
        var_8 = binary_tree_0.__repr__()
>       assert var_8 == 'binary:(L: False R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:174: AssertionError

   - [# 153] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
  103:             raise ValueError('Binary Tree is empty')
- 104:         n = self.root
+ 104:         pass
  105:         while n.left != None:
  106:             n = n.left
  107:         return n.value
  108:     
--------------------------------------------------------------------------------
[0.10103 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
        assert var_0 == 'binary:()'
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_2 = binary_tree_0.add(var_0)
        var_3 = binary_tree_0.__iter__()
        var_4 = var_3.__repr__()
>       var_5 = binary_tree_0.getMin()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:142: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L:(L: binary:() R:) binary:() R:)

>   ???
E   UnboundLocalError: local variable 'n' referenced before assignment

binarySearchTree1:105: UnboundLocalError

   - [# 154] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  102:         if self.root is None:
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
  105:         while n.left != None:
- 106:             n = n.left
+ 106:             pass
  107:         return n.value
  108:     
  109:     def getMax(self):
  110:         '''Returns maximum value.'''
--------------------------------------------------------------------------------
[5.00643 s] timeout

   - [# 155] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
  105:         while n.left != None:
  106:             n = n.left
- 107:         return n.value
+ 107:         pass
  108:     
  109:     def getMax(self):
  110:         '''Returns maximum value.'''
  111:         if self.root is None:
--------------------------------------------------------------------------------
[0.09655 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
        assert var_0 == 'binary:()'
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_2 = binary_tree_0.add(var_0)
        var_3 = binary_tree_0.__iter__()
        var_4 = var_3.__repr__()
        var_5 = binary_tree_0.getMin()
>       assert var_5 == 'binary:()'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:143: AssertionError

   - [# 157] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  111:         if self.root is None:
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
  114:         while n.right != None:
- 115:             n = n.right
+ 115:             pass
  116:         return n.value
  117:     
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
--------------------------------------------------------------------------------
[5.00562 s] timeout

   - [# 158] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
  114:         while n.right != None:
  115:             n = n.right
- 116:         return n.value
+ 116:         pass
  117:     
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
  120:         node = self.root
--------------------------------------------------------------------------------
[0.13242 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_18

def test_case_18():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_tree_0.getMax()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryTree'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:163: AssertionError

   - [# 159] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  116:         return n.value
  117:     
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
- 120:         node = self.root
+ 120:         pass
  121:         while node:
  122:             if target < node.value:
  123:                 node = node.left
  124:             elif target > node.value:
--------------------------------------------------------------------------------
[0.10718 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_20

def test_case_20():
        binary_tree_0 = module_0.BinaryTree()
        set_0 = {binary_tree_0}
        var_0 = binary_tree_0.add(set_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.__contains__(set_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: {binary:(L: set(...) R:)} R:)
target = {binary:(L: {binary:(L: set(...) R:)} R:)}

>   ???
E   UnboundLocalError: local variable 'node' referenced before assignment

binarySearchTree1:121: UnboundLocalError

   - [# 160] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  119:         '''Check whether BST contains target value.'''
  120:         node = self.root
  121:         while node:
  122:             if target < node.value:
- 123:                 node = node.left
+ 123:                 pass
  124:             elif target > node.value:
  125:                 node = node.right
  126:             else:
  127:                 return True
--------------------------------------------------------------------------------
[5.00648 s] timeout

   - [# 161] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  121:         while node:
  122:             if target < node.value:
  123:                 node = node.left
  124:             elif target > node.value:
- 125:                 node = node.right
+ 125:                 pass
  126:             else:
  127:                 return True
  128:         
  129:         return False
--------------------------------------------------------------------------------
[5.00344 s] timeout

   - [# 162] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  123:                 node = node.left
  124:             elif target > node.value:
  125:                 node = node.right
  126:             else:
- 127:                 return True
+ 127:                 pass
  128:         
  129:         return False
  130:     
  131:     def closest(self, target):
--------------------------------------------------------------------------------
[5.00379 s] timeout

   - [# 163] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  125:                 node = node.right
  126:             else:
  127:                 return True
  128:         
- 129:         return False
+ 129:         pass
  130:     
  131:     def closest(self, target):
  132:         '''
  133:         Return value closest to target. If there are several, then
--------------------------------------------------------------------------------
[0.11286 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_22

def test_case_22():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.__contains__(binary_tree_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:187: AssertionError

   - [# 164] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  133:         Return value closest to target. If there are several, then
  134:         return one of them.
  135:         '''
  136:         if self.root is None:
- 137:             return None
+ 137:             pass
  138:         
  139:         best = node = self.root
  140:         distance = abs(self.root.value - target)
  141:         while node:
--------------------------------------------------------------------------------
[0.10938 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_24

def test_case_24():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.closest(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:199: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(), target = binary:()

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree1:140: AttributeError

   - [# 165] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  135:         '''
  136:         if self.root is None:
  137:             return None
  138:         
- 139:         best = node = self.root
+ 139:         pass
  140:         distance = abs(self.root.value - target)
  141:         while node:
  142:             if abs(node.value - target) < distance:
  143:                 distance = abs(node.value - target)
--------------------------------------------------------------------------------
[0.13045 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_23

def test_case_23():
        bool_0 = True
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.closest(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: True R:), target = True

>   ???
E   UnboundLocalError: local variable 'node' referenced before assignment

binarySearchTree1:141: UnboundLocalError

   - [# 166] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  136:         if self.root is None:
  137:             return None
  138:         
  139:         best = node = self.root
- 140:         distance = abs(self.root.value - target)
+ 140:         pass
  141:         while node:
  142:             if abs(node.value - target) < distance:
  143:                 distance = abs(node.value - target)
  144:                 best = node
--------------------------------------------------------------------------------
[0.12830 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_23

def test_case_23():
        bool_0 = True
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.closest(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: True R:), target = True

>   ???
E   UnboundLocalError: local variable 'distance' referenced before assignment

binarySearchTree1:142: UnboundLocalError

   - [# 167] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  139:         best = node = self.root
  140:         distance = abs(self.root.value - target)
  141:         while node:
  142:             if abs(node.value - target) < distance:
- 143:                 distance = abs(node.value - target)
+ 143:                 pass
  144:                 best = node
  145:             if target < node.value:
  146:                 node = node.left
  147:             elif target > node.value:
--------------------------------------------------------------------------------
[0.11323 s] survived

   - [# 168] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  140:         distance = abs(self.root.value - target)
  141:         while node:
  142:             if abs(node.value - target) < distance:
  143:                 distance = abs(node.value - target)
- 144:                 best = node
+ 144:                 pass
  145:             if target < node.value:
  146:                 node = node.left
  147:             elif target > node.value:
  148:                 node = node.right
--------------------------------------------------------------------------------
[0.11243 s] survived

   - [# 171] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  146:                 node = node.left
  147:             elif target > node.value:
  148:                 node = node.right
  149:             else:
- 150:                 return target
+ 150:                 pass
  151:         
  152:         return best.value
  153:     
  154:     def __iter__(self):
--------------------------------------------------------------------------------
[5.00644 s] timeout

   - [# 172] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  148:                 node = node.right
  149:             else:
  150:                 return target
  151:         
- 152:         return best.value
+ 152:         pass
  153:     
  154:     def __iter__(self):
  155:         '''In order traversal of elements in the tree.'''
  156:         if self.root:
--------------------------------------------------------------------------------
[0.11602 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_WHOLE_SUITE.py::test_case_13

def test_case_13():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        none_type_0 = None
        bool_1 = False
        var_1 = binary_tree_0.__contains__(bool_1)
        assert var_1 is False
        bool_2 = False
        set_0 = {bool_2}
        var_2 = binary_tree_0.getMax()
        assert var_2 is True
        var_3 = binary_tree_0.closest(bool_2)
>       assert var_3 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_WHOLE_SUITE.py:139: AssertionError

   - [# 174] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  158:                 yield e
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
- 162:             return 'binary:()'
+ 162:             pass
  163:         return 'binary:' + str(self.root)
  164: 
  165: '''
  166: Change Log:
--------------------------------------------------------------------------------
[0.09152 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
>       assert var_0 == 'binary:()'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:136: AssertionError

   - [# 175] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
  162:             return 'binary:()'
- 163:         return 'binary:' + str(self.root)
+ 163:         pass
  164: 
  165: '''
  166: Change Log:
  167: -----------
--------------------------------------------------------------------------------
[0.12673 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_9

def test_case_9():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.remove(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__repr__()
>       assert var_4 == 'binary:(L:(L: False R:) False R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:77: AssertionError

   - [# 176] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
  161:         if self.root is None:
  162:             return 'binary:()'
  163:         return 'binary:' + str(self.root)
  164: 
- 165: '''
- 166: Change Log:
- 167: -----------
- 168: 
- 169: '''
+ 165: pass
--------------------------------------------------------------------------------
[0.11756 s] survived

   - [# 180] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   14:     def add(self, val):
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
-  18:         if val <= self.value:
+  18:         if val <= value:
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
--------------------------------------------------------------------------------
[0.08722 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'value' is not defined

binarySearchTree1:18: NameError

   - [# 182] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
   18:         if val <= self.value:
-  19:             self.left = self.addToSubTree(self.left, val)
+  19:             self.left = addToSubTree(self.left, val)
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
--------------------------------------------------------------------------------
[0.08783 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_1

def test_case_1():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
>       var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:28: in addToSubTree
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = False

>   ???
E   NameError: name 'addToSubTree' is not defined

binarySearchTree1:19: NameError
