   - [# 183] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
   18:         if val <= self.value:
-  19:             self.left = self.addToSubTree(self.left, val)
+  19:             self.left = self.addToSubTree(left, val)
   20:         elif val > self.value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
--------------------------------------------------------------------------------
[0.08556 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_1

def test_case_1():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
>       var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:28: in addToSubTree
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = False

>   ???
E   NameError: name 'left' is not defined

binarySearchTree1:19: NameError

   - [# 184] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
   18:         if val <= self.value:
   19:             self.left = self.addToSubTree(self.left, val)
-  20:         elif val > self.value:
+  20:         elif val > value:
   21:             self.right = self.addToSubTree(self.right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
--------------------------------------------------------------------------------
[0.08648 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'value' is not defined

binarySearchTree1:20: NameError

   - [# 186] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   17:         '''
   18:         if val <= self.value:
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
-  21:             self.right = self.addToSubTree(self.right, val)
+  21:             self.right = addToSubTree(self.right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
   25:         if parent is None:
--------------------------------------------------------------------------------
[0.08700 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'addToSubTree' is not defined

binarySearchTree1:21: NameError

   - [# 187] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   17:         '''
   18:         if val <= self.value:
   19:             self.left = self.addToSubTree(self.left, val)
   20:         elif val > self.value:
-  21:             self.right = self.addToSubTree(self.right, val)
+  21:             self.right = self.addToSubTree(right, val)
   22:     
   23:     def addToSubTree(self, parent, val):
   24:         '''Add val to parent subtree (if exists) and return root of that subtree.'''
   25:         if parent is None:
--------------------------------------------------------------------------------
[0.08525 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_0

def test_case_0():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.add(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'right' is not defined

binarySearchTree1:21: NameError

   - [# 188] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   31:     def remove(self, val):
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
-  35:         if val < self.value:
+  35:         if val < value:
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
--------------------------------------------------------------------------------
[0.09051 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_2

def test_case_2():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.remove(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'value' is not defined

binarySearchTree1:35: NameError

   - [# 190] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
   35:         if val < self.value:
-  36:             self.left = self.removeFromParent(self.left, val)
+  36:             self.left = removeFromParent(self.left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
--------------------------------------------------------------------------------
[0.11144 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_5

def test_case_5():
        str_0 = 'X>'
        str_1 = 'qkr(Szzyf\t'
        binary_node_0 = module_0.BinaryNode(str_1)
>       var_0 = binary_node_0.remove(str_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:53: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: qkr(Szzyf	 R:), val = 'X>'

>   ???
E   NameError: name 'removeFromParent' is not defined

binarySearchTree1:36: NameError

   - [# 191] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   32:         '''
   33:          Remove val of self from BinaryTree. 
   34:         '''
   35:         if val < self.value:
-  36:             self.left = self.removeFromParent(self.left, val)
+  36:             self.left = self.removeFromParent(left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
--------------------------------------------------------------------------------
[0.08749 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_5

def test_case_5():
        str_0 = 'X>'
        str_1 = 'qkr(Szzyf\t'
        binary_node_0 = module_0.BinaryNode(str_1)
>       var_0 = binary_node_0.remove(str_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:53: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: qkr(Szzyf	 R:), val = 'X>'

>   ???
E   NameError: name 'left' is not defined

binarySearchTree1:36: NameError

   - [# 192] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   33:          Remove val of self from BinaryTree. 
   34:         '''
   35:         if val < self.value:
   36:             self.left = self.removeFromParent(self.left, val)
-  37:         elif val > self.value:
+  37:         elif val > value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
   41:                 return self.right
--------------------------------------------------------------------------------
[0.08914 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_2

def test_case_2():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.remove(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'value' is not defined

binarySearchTree1:37: NameError

   - [# 194] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   34:         '''
   35:         if val < self.value:
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
-  38:             self.right = self.removeFromParent(self.right, val)
+  38:             self.right = removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
   41:                 return self.right
   42:             
--------------------------------------------------------------------------------
[0.08668 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_2

def test_case_2():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.remove(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'removeFromParent' is not defined

binarySearchTree1:38: NameError

   - [# 195] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   34:         '''
   35:         if val < self.value:
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
-  38:             self.right = self.removeFromParent(self.right, val)
+  38:             self.right = self.removeFromParent(right, val)
   39:         else:
   40:             if self.left is None:
   41:                 return self.right
   42:             
--------------------------------------------------------------------------------
[0.08710 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_2

def test_case_2():
        bool_0 = True
        bool_1 = False
        binary_node_0 = module_0.BinaryNode(bool_1)
>       var_0 = binary_node_0.remove(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = True

>   ???
E   NameError: name 'right' is not defined

binarySearchTree1:38: NameError

   - [# 196] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   36:             self.left = self.removeFromParent(self.left, val)
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
-  40:             if self.left is None:
+  40:             if left is None:
   41:                 return self.right
   42:             
   43:             child = self.left
   44:             while child.right:
--------------------------------------------------------------------------------
[0.09332 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_3

def test_case_3():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
>       var_0 = binary_node_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:33: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = False

>   ???
E   NameError: name 'left' is not defined

binarySearchTree1:40: NameError

   - [# 197] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   37:         elif val > self.value:
   38:             self.right = self.removeFromParent(self.right, val)
   39:         else:
   40:             if self.left is None:
-  41:                 return self.right
+  41:                 return right
   42:             
   43:             child = self.left
   44:             while child.right:
   45:                 child = child.right
--------------------------------------------------------------------------------
[0.11506 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_3

def test_case_3():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
>       var_0 = binary_node_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:33: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L: False R:), val = False

>   ???
E   NameError: name 'right' is not defined

binarySearchTree1:41: NameError

   - [# 198] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   39:         else:
   40:             if self.left is None:
   41:                 return self.right
   42:             
-  43:             child = self.left
+  43:             child = left
   44:             while child.right:
   45:                 child = child.right
   46:             
   47:             childKey = child.value
--------------------------------------------------------------------------------
[0.08819 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = var_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L:(L: True R:) True R:), val = True

>   ???
E   NameError: name 'left' is not defined

binarySearchTree1:43: NameError

   - [# 200] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   44:             while child.right:
   45:                 child = child.right
   46:             
   47:             childKey = child.value
-  48:             self.left = self.removeFromParent(self.left, childKey)
+  48:             self.left = removeFromParent(self.left, childKey)
   49:             self.value = childKey
   50:         
   51:         return self
   52:     
--------------------------------------------------------------------------------
[0.09979 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = var_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L:(L: True R:) True R:), val = True

>   ???
E   NameError: name 'removeFromParent' is not defined

binarySearchTree1:48: NameError

   - [# 201] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   44:             while child.right:
   45:                 child = child.right
   46:             
   47:             childKey = child.value
-  48:             self.left = self.removeFromParent(self.left, childKey)
+  48:             self.left = self.removeFromParent(left, childKey)
   49:             self.value = childKey
   50:         
   51:         return self
   52:     
--------------------------------------------------------------------------------
[0.09200 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_4

def test_case_4():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = var_0.removeFromParent(binary_node_0, bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree1:57: in removeFromParent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (L:(L: True R:) True R:), val = True

>   ???
E   NameError: name 'left' is not defined

binarySearchTree1:48: NameError

   - [# 203] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   60:     def __repr__(self):
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
   63:         rightS = ''
-  64:         if self.left:
+  64:         if left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
--------------------------------------------------------------------------------
[0.09433 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__

   - [# 204] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   61:         '''Useful debugging function to produce linear tree representation.'''
   62:         leftS = ''
   63:         rightS = ''
   64:         if self.left:
-  65:             leftS = str(self.left)
+  65:             leftS = str(left)
   66:         if self.right:
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
--------------------------------------------------------------------------------
[0.10092 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_9

def test_case_9():
        bool_0 = True
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = var_0.__repr__()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:105: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'left' is not defined") raised in repr()] BinaryNode object at 0x7fa525055030>

>   ???
E   NameError: name 'left' is not defined

binarySearchTree1:65: NameError

   - [# 205] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   62:         leftS = ''
   63:         rightS = ''
   64:         if self.left:
   65:             leftS = str(self.left)
-  66:         if self.right:
+  66:         if right:
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
--------------------------------------------------------------------------------
[0.10154 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_

   - [# 206] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   63:         rightS = ''
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
-  67:             rightS = str(self.right)
+  67:             rightS = str(right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
--------------------------------------------------------------------------------
[0.08891 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.right).__module__}.{type(var_0.right).__qualna

   - [# 207] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         return ((((('(L:' + leftS) + ' ') + str(value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.09600 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_7

def test_case_7():
        bool_0 = False
        binary_node_0 = module_0.BinaryNode(bool_0)
        var_0 = binary_node_0.addToSubTree(binary_node_0, bool_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_node_0.removeFromParent(binary_node_0, bool_0)
        assert binary_node_0.left is None
        assert var_0.left is None
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert var_1.value is False
        assert var_1.left is None
        assert var_1.right is None
        bool_1 = True
        binary_tree_0 = module_0.BinaryTree()
        var_2 = var_0.addToSubTree(var_0, bool_1)
        assert f'{type(binary_node_0.right).__module__}.{type(binary_node_0.right).__qualname__}' == 'binarySearchTree1.BinaryNode'
        assert f'{type(v

   - [# 208] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
-  72:         if self.left:
+  72:         if left:
   73:             for v in self.left.inorder():
   74:                 yield v
   75:         
   76:         yield self.value
--------------------------------------------------------------------------------
[0.10881 s] survived

   - [# 209] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
-  73:             for v in self.left.inorder():
+  73:             for v in left.inorder():
   74:                 yield v
   75:         
   76:         yield self.value
   77:         
--------------------------------------------------------------------------------
[0.13078 s] survived

   - [# 210] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   72:         if self.left:
   73:             for v in self.left.inorder():
   74:                 yield v
   75:         
-  76:         yield self.value
+  76:         yield value
   77:         
   78:         if self.right:
   79:             for v in self.right.inorder():
   80:                 yield v
--------------------------------------------------------------------------------
[0.12559 s] survived

   - [# 211] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   74:                 yield v
   75:         
   76:         yield self.value
   77:         
-  78:         if self.right:
+  78:         if right:
   79:             for v in self.right.inorder():
   80:                 yield v
   81: 
   82: class BinaryTree:
--------------------------------------------------------------------------------
[0.11383 s] survived
