   - [# 212] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   75:         
   76:         yield self.value
   77:         
   78:         if self.right:
-  79:             for v in self.right.inorder():
+  79:             for v in right.inorder():
   80:                 yield v
   81: 
   82: class BinaryTree:
   83:     
--------------------------------------------------------------------------------
[0.10695 s] survived

   - [# 214] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   86:         self.root = None
   87:     
   88:     def add(self, value):
   89:         '''Insert value into proper location in Binary Tree.'''
-  90:         if self.root is None:
+  90:         if root is None:
   91:             self.root = BinaryNode(value)
   92:         else:
   93:             self.root.add(value)
   94:     
--------------------------------------------------------------------------------
[0.09545 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_10

def test_case_10():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.add(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:110: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(), value = binary:()

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:90: NameError

   - [# 216] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   89:         '''Insert value into proper location in Binary Tree.'''
   90:         if self.root is None:
   91:             self.root = BinaryNode(value)
   92:         else:
-  93:             self.root.add(value)
+  93:             root.add(value)
   94:     
   95:     def remove(self, val):
   96:         '''Remove value from tree.'''
   97:         if self.root:
--------------------------------------------------------------------------------
[0.10056 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
        assert var_0 == 'binary:()'
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_2 = binary_tree_0.add(var_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:139: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: binary:() R:), value = 'binary:()'

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:93: NameError

   - [# 217] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   93:             self.root.add(value)
   94:     
   95:     def remove(self, val):
   96:         '''Remove value from tree.'''
-  97:         if self.root:
+  97:         if root:
   98:             self.root = self.root.remove(val)
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
--------------------------------------------------------------------------------
[0.17346 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_14

def test_case_14():
        binary_tree_0 = module_0.BinaryTree()
>       var_0 = binary_tree_0.remove(binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:130: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(), val = binary:()

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:97: NameError

   - [# 219] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   94:     
   95:     def remove(self, val):
   96:         '''Remove value from tree.'''
   97:         if self.root:
-  98:             self.root = self.root.remove(val)
+  98:             self.root = root.remove(val)
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
--------------------------------------------------------------------------------
[0.12885 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_2

def test_case_2():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.remove(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
>       var_4 = binary_tree_0.remove(var_1)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L:(L: False R:) False R:), val = False

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:98: NameError

   - [# 220] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
   98:             self.root = self.root.remove(val)
   99:     
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
- 102:         if self.root is None:
+ 102:         if root is None:
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
  105:         while n.left != None:
  106:             n = n.left
--------------------------------------------------------------------------------
[0.09596 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
        assert var_0 == 'binary:()'
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_2 = binary_tree_0.add(var_0)
        var_3 = binary_tree_0.__iter__()
        var_4 = var_3.__repr__()
>       var_5 = binary_tree_0.getMin()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:142: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L:(L: binary:() R:) binary:() R:)

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:102: NameError

   - [# 221] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  100:     def getMin(self):
  101:         '''Returns minimum value.'''
  102:         if self.root is None:
  103:             raise ValueError('Binary Tree is empty')
- 104:         n = self.root
+ 104:         n = root
  105:         while n.left != None:
  106:             n = n.left
  107:         return n.value
  108:     
--------------------------------------------------------------------------------
[0.09354 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
        var_0 = binary_tree_0.__repr__()
        assert var_0 == 'binary:()'
        var_1 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_2 = binary_tree_0.add(var_0)
        var_3 = binary_tree_0.__iter__()
        var_4 = var_3.__repr__()
>       var_5 = binary_tree_0.getMin()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:142: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L:(L: binary:() R:) binary:() R:)

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:104: NameError

   - [# 222] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  107:         return n.value
  108:     
  109:     def getMax(self):
  110:         '''Returns maximum value.'''
- 111:         if self.root is None:
+ 111:         if root is None:
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
  114:         while n.right != None:
  115:             n = n.right
--------------------------------------------------------------------------------
[0.09718 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_18

def test_case_18():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(binary_tree_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.getMax()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while getting the str of an object') raised in repr()] BinaryTree object at 0x7fa524e613c0>

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:111: NameError

   - [# 224] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  116:         return n.value
  117:     
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
- 120:         node = self.root
+ 120:         node = root
  121:         while node:
  122:             if target < node.value:
  123:                 node = node.left
  124:             elif target > node.value:
--------------------------------------------------------------------------------
[0.13200 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_20

def test_case_20():
        binary_tree_0 = module_0.BinaryTree()
        set_0 = {binary_tree_0}
        var_0 = binary_tree_0.add(set_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.__contains__(set_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: {binary:(L: set(...) R:)} R:)
target = {binary:(L: {binary:(L: set(...) R:)} R:)}

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:120: NameError

   - [# 225] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  132:         '''
  133:         Return value closest to target. If there are several, then
  134:         return one of them.
  135:         '''
- 136:         if self.root is None:
+ 136:         if root is None:
  137:             return None
  138:         
  139:         best = node = self.root
  140:         distance = abs(self.root.value - target)
--------------------------------------------------------------------------------
[0.10144 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_23

def test_case_23():
        bool_0 = True
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.closest(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: True R:), target = True

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:136: NameError

   - [# 226] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  135:         '''
  136:         if self.root is None:
  137:             return None
  138:         
- 139:         best = node = self.root
+ 139:         best = node = root
  140:         distance = abs(self.root.value - target)
  141:         while node:
  142:             if abs(node.value - target) < distance:
  143:                 distance = abs(node.value - target)
--------------------------------------------------------------------------------
[0.09707 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_23

def test_case_23():
        bool_0 = True
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.closest(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: True R:), target = True

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:139: NameError

   - [# 227] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  136:         if self.root is None:
  137:             return None
  138:         
  139:         best = node = self.root
- 140:         distance = abs(self.root.value - target)
+ 140:         distance = abs(root.value - target)
  141:         while node:
  142:             if abs(node.value - target) < distance:
  143:                 distance = abs(node.value - target)
  144:                 best = node
--------------------------------------------------------------------------------
[0.10357 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_23

def test_case_23():
        bool_0 = True
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.add(bool_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
>       var_1 = binary_tree_0.closest(bool_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:(L: True R:), target = True

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:140: NameError

   - [# 228] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  152:         return best.value
  153:     
  154:     def __iter__(self):
  155:         '''In order traversal of elements in the tree.'''
- 156:         if self.root:
+ 156:         if root:
  157:             for e in self.root.inorder():
  158:                 yield e
  159:     
  160:     def __repr__(self):
--------------------------------------------------------------------------------
[0.10454 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_26

def test_case_26():
        binary_tree_0 = module_0.BinaryTree()
>       object_0 = module_1.object(*binary_tree_0)

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:208: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = binary:()

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:156: NameError

   - [# 229] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  153:     
  154:     def __iter__(self):
  155:         '''In order traversal of elements in the tree.'''
  156:         if self.root:
- 157:             for e in self.root.inorder():
+ 157:             for e in root.inorder():
  158:                 yield e
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
--------------------------------------------------------------------------------
[0.11182 s] survived

   - [# 230] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  157:             for e in self.root.inorder():
  158:                 yield e
  159:     
  160:     def __repr__(self):
- 161:         if self.root is None:
+ 161:         if root is None:
  162:             return 'binary:()'
  163:         return 'binary:' + str(self.root)
  164: 
  165: '''
--------------------------------------------------------------------------------
[0.11828 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_15

def test_case_15():
        binary_tree_0 = module_0.BinaryTree()
        binary_tree_1 = module_0.BinaryTree()
>       var_0 = binary_tree_0.__repr__()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:135: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'root' is not defined") raised in repr()] BinaryTree object at 0x7fa524f01390>

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:161: NameError

   - [# 231] SVD binarySearchTree1: 
--------------------------------------------------------------------------------
  159:     
  160:     def __repr__(self):
  161:         if self.root is None:
  162:             return 'binary:()'
- 163:         return 'binary:' + str(self.root)
+ 163:         return 'binary:' + str(root)
  164: 
  165: '''
  166: Change Log:
  167: -----------
--------------------------------------------------------------------------------
[0.18333 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_9

def test_case_9():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.remove(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
>       var_4 = binary_tree_0.__repr__()

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:76: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'root' is not defined") raised in repr()] BinaryTree object at 0x7fa5255a5720>

>   ???
E   NameError: name 'root' is not defined

binarySearchTree1:163: NameError

   - [# 232] ZIL binarySearchTree1: 
--------------------------------------------------------------------------------
   41:                 return self.right
   42:             
   43:             child = self.left
   44:             while child.right:
-  45:                 child = child.right
+  45:                 break
   46:             
   47:             childKey = child.value
   48:             self.left = self.removeFromParent(self.left, childKey)
   49:             self.value = childKey
--------------------------------------------------------------------------------
[0.15754 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_28

def test_case_28():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        int_0 = 3380
        var_2 = binary_tree_0.add(int_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(var_1)
        var_4 = binary_tree_0.__contains__(var_1)
        assert var_4 is True
        var_5 = binary_tree_0.add(var_4)
        var_6 = binary_tree_0.getMax()
        assert var_6 == 3380
        var_7 = binary_tree_0.closest(var_6)
        var_8 = var_3.__repr__()
        var_9 = binary_tree_0.add(var_7)
        var_10 = binary_tree_0.remove(var_7)
        var_11 = binary_tree_0.__repr__()
>       assert var_11 == 'binary:(L:(L: False R:(L: True R:)) 3380 R:)'
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:357: AssertionError

   - [# 233] ZIL binarySearchTree1: 
--------------------------------------------------------------------------------
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
   73:             for v in self.left.inorder():
-  74:                 yield v
+  74:                 break
   75:         
   76:         yield self.value
   77:         
   78:         if self.right:
--------------------------------------------------------------------------------
[0.10559 s] survived

   - [# 234] ZIL binarySearchTree1: 
--------------------------------------------------------------------------------
   76:         yield self.value
   77:         
   78:         if self.right:
   79:             for v in self.right.inorder():
-  80:                 yield v
+  80:                 break
   81: 
   82: class BinaryTree:
   83:     
   84:     def __init__(self):
--------------------------------------------------------------------------------
[0.11090 s] survived

   - [# 235] ZIL binarySearchTree1: 
--------------------------------------------------------------------------------
  102:         if self.root is None:
  103:             raise ValueError('Binary Tree is empty')
  104:         n = self.root
  105:         while n.left != None:
- 106:             n = n.left
+ 106:             break
  107:         return n.value
  108:     
  109:     def getMax(self):
  110:         '''Returns maximum value.'''
--------------------------------------------------------------------------------
[0.10736 s] survived

   - [# 236] ZIL binarySearchTree1: 
--------------------------------------------------------------------------------
  111:         if self.root is None:
  112:             raise ValueError('Binary Tree is empty')
  113:         n = self.root
  114:         while n.right != None:
- 115:             n = n.right
+ 115:             break
  116:         return n.value
  117:     
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
--------------------------------------------------------------------------------
[0.15958 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_19

def test_case_19():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.__contains__(var_1)
        assert var_3 is True
        var_4 = binary_tree_0.add(var_3)
        var_5 = binary_tree_0.getMax()
>       assert var_5 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py:196: AssertionError

   - [# 237] ZIL binarySearchTree1: 
--------------------------------------------------------------------------------
  118:     def __contains__(self, target):
  119:         '''Check whether BST contains target value.'''
  120:         node = self.root
  121:         while node:
- 122:             if target < node.value:
- 123:                 node = node.left
- 124:             elif target > node.value:
- 125:                 node = node.right
- 126:             else:
- 127:                 return True
+ 122:             break
+ 123:         
+ 124:         
+ 125:         
+ 126:         
+ 127:         
  128:         
  129:         return False
  130:     
  131:     def closest(self, target):
--------------------------------------------------------------------------------
[0.12446 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py::test_case_20

def test_case_20():
        binary_tree_0 = module_0.BinaryTree()
        set_0 = {binary_tree_0}
        var_0 = binary_tree_0.add(set_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_1 = binary_tree_0.__contains__(set_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_MIO.py:177: AssertionError

   - [# 238] ZIL binarySearchTree1: 
--------------------------------------------------------------------------------
  138:         
  139:         best = node = self.root
  140:         distance = abs(self.root.value - target)
  141:         while node:
- 142:             if abs(node.value - target) < distance:
- 143:                 distance = abs(node.value - target)
- 144:                 best = node
- 145:             if target < node.value:
- 146:                 node = node.left
- 147:             elif target > node.value:
- 148:                 node = node.right
- 149:             else:
- 150:                 return target
+ 142:             break
+ 143:         
+ 144:         
+ 145:         
+ 146:         
+ 147:         
+ 148:         
+ 149:         
+ 150:         
  151:         
  152:         return best.value
  153:     
  154:     def __iter__(self):
--------------------------------------------------------------------------------
[0.13495 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree1_DYNAMOSA.py::test_case_22

def test_case_22():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.closest(binary_tree_0)
        var_1 = binary_tree_0.__contains__(var_0)
        assert var_1 is False
        var_2 = binary_tree_0.add(var_1)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.__contains__(var_1)
        assert var_3 is True
        var_4 = binary_tree_0.add(var_3)
        var_5 = binary_tree_0.getMax()
        assert var_5 is True
        var_6 = binary_tree_0.closest(var_5)
>       assert var_6 is True
