1 : Job ID d198537dceac4864ac5e8b62d6c5a31f
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" - leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

2 : Job ID f7f751b44aeb48a890875a6f06c4b2bc
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS - " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

3 : Job ID 959c1a7f9c7042eea28c938f11b44508
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " - str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

4 : Job ID 1ba517d621a74252b021a3d570e381cd
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) - " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

5 : Job ID ae250c5607f846f7a8b537b0017221e5
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" - rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

6 : Job ID c6e7d458af4a411495a04c2681492b11
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS - ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

7 : Job ID 3b49f48500e64b76bbaaa746cf59751f
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" - str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.11s ===

8 : Job ID 8458f86f7dba45779f169e9b58e2f255
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" * leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

9 : Job ID af4f79eef09d461d9cf7073ead25f483
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS * " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_

10 : Job ID 553b28644b8c487f907a682906676d68
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " * str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

11 : Job ID 2214ebb6524e43198724c52776a13a40
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) * " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

12 : Job ID 471a787e131b440abfb867d464005b33
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" * rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

13 : Job ID a6fce079d7f44c68a42870ee0ff6e9f8
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS * ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

14 : Job ID a3956381fbf94399b6216ca0caddc7c0
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" * str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.10s ==

15 : Job ID 3dff52bba3da45149d2085c5b75c1f61
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" / leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

16 : Job ID b0d7a81a56b5448bb49a30530f9db00f
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS / " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

17 : Job ID 2ada6579e1e846b1be23c7b2c2b18921
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " / str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

18 : Job ID a4bdb891b443415ba160871ea3618653
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) / " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

19 : Job ID 59898ee9eb5a4e83984701df3c97374b
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" / rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case
