20 : Job ID 31385141737e4fdca0f4596890c7ac66
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS / ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

21 : Job ID da26dd2cb49147389d760d8c568000fd
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" / str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.10s ==

22 : Job ID c365018ecec34716a086e520c208129b
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" // leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::tes

23 : Job ID 24bd5330f4ed436abbebe7ef54c6c2db
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS // " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::tes

24 : Job ID 916f4f7699834e2b955116042a52049a
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " // str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::tes

25 : Job ID f85efaf9faf94a7784d6ae7b47b62bb1
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) // " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::tes

26 : Job ID 57b4607c7e834421b19fec601cec0231
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" // rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::tes

27 : Job ID 93bb589656174ea089e016d0c51d051a
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS // ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::tes

28 : Job ID 49b8d8fb3ab54e9a8a430be0c176c97c
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" // str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.

29 : Job ID 20d33ba30951459c98af3bbc11cb92cd
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" % leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

30 : Job ID 4538ce620b2a44db9024f01b708d0365
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS % " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

31 : Job ID c1b934e151fa4a9492b68f1464cab567
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " % str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

32 : Job ID df054131583d44bea20ec401d879f3ad
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) % " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

33 : Job ID a5883e1ac32548a889dc092b4a678359
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" % rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

34 : Job ID 8a7a5716d4be427b9a1c9813acd86622
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS % ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case

35 : Job ID e4ef286151264773879a8ae6b4b97c9b
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" % str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.10s ==

36 : Job ID c86b5170d71942d4b822e684a84969e1
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" ** leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_cas

37 : Job ID e9f14f01a3b849cbb66ee7de08f0fe49
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS ** " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_cas

38 : Job ID ed2b39817e2246f49ac88aca1dbfc5de
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " ** str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_cas
