39 : Job ID 2eb97b95eb2042679b4e8a62292f6801
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) ** " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_cas

40 : Job ID 76e4cbf5ff5d4591ba1c40ffa983e2d1
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" ** rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_cas

41 : Job ID fd7127c9f98d4764baf7ba3a440b00f1
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS ** ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_cas

42 : Job ID 9cf1f00932114854a76a62bd2b45f309
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" ** str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.09s =

43 : Job ID f1535348859b4a4a87cde1a34b181f64
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" >> leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

44 : Job ID 0ab35b924838499a90b6cc42529c7dcd
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS >> " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

45 : Job ID 837c4657d5c94ab7bac681d83619d2a7
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " >> str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

46 : Job ID 684a89627bd744d49e7f81535a563740
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) >> " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

47 : Job ID 818a3e80b9294deda3290fab2659c146
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" >> rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

48 : Job ID 3fab6b503ff74bb78801f0b575391f9c
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS >> ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

49 : Job ID 0b918c3bc97a4f20a9164fd20001f385
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" >> str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.10

50 : Job ID 88cef62180f84d35ac85551c057ab2ff
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" << leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

51 : Job ID 370a71bc9b0b40aeb52d91f673c6cda3
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS << " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

52 : Job ID 49e8748b264944b993a956ca69268da0
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " << str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

53 : Job ID 1855ee82ee3f43ba9450b9cc7d0ab053
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) << " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

54 : Job ID e6ea71e72f954084a36051c4c1540903
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" << rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

55 : Job ID 35ef7ecd221e44fda2db65a67c2c8c7e
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS << ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

56 : Job ID d7a00adbbb3b4f75a1bf6b4aa56dd21a
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" << str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.11

57 : Job ID e4c44b9b3f09496788d2401fcf77faff
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" | leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_ca
