58 : Job ID 9d23f8d6f3084a7ca481a9ca4bb93a6f
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS | " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_ca

59 : Job ID 6d01347278904849a4e4c3a1d2ab601d
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " | str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_ca

60 : Job ID d7500f3e4b14488497670b697cbfdd27
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) | " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_ca

61 : Job ID e1cf13f3e1ea4dd9a81b063b0fce415e
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" | rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_ca

62 : Job ID e3705f8fc96247198d412c0040ec4b9e
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS | ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_ca

63 : Job ID 155ca208059b4455925c9f5b13bed313
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" | str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.12s

64 : Job ID 3b6e8d54a9c4463cbec1934b078ec3a2
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" & leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

65 : Job ID 80ebabb4ed734cc5aa5e5cd8f34c2a67
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS & " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

66 : Job ID 651b65164498409ca61d6d318200a702
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " & str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

67 : Job ID 5db53d218b2f44a6b0d3bf03132e277d
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) & " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

68 : Job ID 51ffc4c3daec4e25a55620e593c900c2
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" & rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

69 : Job ID 08a54d36f75e4e54bf992dfa73018f18
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS & ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

70 : Job ID 31fcb557c32f4326b7b6086a8b83cda1
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" & str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.10s

71 : Job ID 120a647667b74a5abd1e7e56a56002fd
test outcome: killed
binarySearchTree1.py, start pos: (68, 21), end pos: (68, 22)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" ^ leftS + " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

72 : Job ID d9e4e19665b64806a5f6c058d11259cb
test outcome: killed
binarySearchTree1.py, start pos: (68, 29), end pos: (68, 30)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS ^ " " + str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

73 : Job ID 2fc15047a69b4eb79494452de4a25d37
test outcome: killed
binarySearchTree1.py, start pos: (68, 35), end pos: (68, 36)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " ^ str(self.value) + " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

74 : Job ID b51f48fb495b4d73bce78ecdec457060
test outcome: killed
binarySearchTree1.py, start pos: (68, 53), end pos: (68, 54)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) ^ " R:" + rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

75 : Job ID 9cf650f003b44a9ca181f26325dce921
test outcome: killed
binarySearchTree1.py, start pos: (68, 61), end pos: (68, 62)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" ^ rightS + ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c

76 : Job ID 4a0b053fe0ae4b139f3364323e114dbc
test outcome: killed
binarySearchTree1.py, start pos: (68, 70), end pos: (68, 71)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -65,7 +65,7 @@
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
-        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
+        return "(L:" + leftS + " " + str(self.value) + " R:" + rightS ^ ")"
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_c
