77 : Job ID a37f0305166948d0bb45cbcc7f7ca5ef
test outcome: killed
binarySearchTree1.py, start pos: (163, 25), end pos: (163, 26)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -160,7 +160,7 @@
     def __repr__(self):
         if self.root is None:
             return "binary:()"
-        return "binary:" + str(self.root)
+        return "binary:" ^ str(self.root)
 """
 Change Log:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .........F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - TypeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - TypeEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - TypeEr...
========================= 7 failed, 55 passed in 0.10s

78 : Job ID c75f219c565d4534b43e062357d683cf
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value + target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

79 : Job ID 19aa1da369dc4c8da1505df0bf79e060
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value + target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

80 : Job ID 412ea291769046d6bde107caa53ab6fb
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value + target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

81 : Job ID 2e78a3e350694f47a4d611d33693e304
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value * target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

82 : Job ID 670ed2380a414780b9d34857268c148e
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value * target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

83 : Job ID 25756889ef0f49a7820c34a137d91598
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value * target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

84 : Job ID 38e6d635a4274be9aa1cef5fb6802e3c
test outcome: killed
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value / target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FF.......... [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ZeroDi...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ZeroDi...
========================= 2 failed, 60 passed in 0.10s =========================

85 : Job ID 229d17afef16427391ff2587207a378b
test outcome: killed
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value / target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FF.......... [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ZeroDi...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ZeroDi...
========================= 2 failed, 60 passed in 0.10s =========================

86 : Job ID 5036d9e696bc4862880eccf608dbded9
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value / target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

87 : Job ID a6b5abf80f4244b787dbbec1cb1917af
test outcome: killed
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value // target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FF.......... [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ZeroDi...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ZeroDi...
========================= 2 failed, 60 passed in 0.10s =========================

88 : Job ID c5455e9efa9f4da3858ec27128d59042
test outcome: killed
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value // target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FF.......... [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ZeroDi...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ZeroDi...
========================= 2 failed, 60 passed in 0.09s =========================

89 : Job ID d10f67c5e9fd4a719e1c6de61a8ed33f
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value // target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

90 : Job ID c2b95dbe48b74742b0e206aa2e716ae7
test outcome: killed
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value % target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FF.......... [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ZeroDi...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ZeroDi...
========================= 2 failed, 60 passed in 0.09s =========================

91 : Job ID ae10a49bee6547b8bc0bd4b426a34ab2
test outcome: killed
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value % target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FF.......... [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ZeroDi...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ZeroDi...
========================= 2 failed, 60 passed in 0.09s =========================

92 : Job ID e5bebe8357d44c54b4e289661a502160
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value % target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

93 : Job ID 528cb66f280a47358929564679308760
test outcome: killed
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value ** target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ZeroDi...
========================= 1 failed, 61 passed in 0.10s =========================

94 : Job ID fb0388bb182a4bcc962894e69ce85bfb
test outcome: killed
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value ** target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ZeroDi...
========================= 1 failed, 61 passed in 0.09s =========================

95 : Job ID 57bf8f357dc243abb4200e2f6210266f
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value ** target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

96 : Job ID c66be62e1ebb4f5bb261b4d5d7005253
test outcome: killed
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value >> target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ValueE...
========================= 1 failed, 61 passed in 0.09s =========================

97 : Job ID 0e5caf7a6c7b4220ad95c68814794501
test outcome: killed
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value >> target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ValueE...
========================= 1 failed, 61 passed in 0.10s =========================

98 : Job ID 85c7b7de83e54387a5e9c5c337790496
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value >> target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

99 : Job ID 0136bf81e81841fa87612e1b42be9c67
test outcome: killed
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value << target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ValueE...
========================= 1 failed, 61 passed in 0.10s =========================

100 : Job ID 981a8ea379e04e58989a4fb3101e0037
test outcome: killed
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value << target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ValueE...
========================= 1 failed, 61 passed in 0.09s =========================

101 : Job ID acfebeb7056d49469524b1b38d62f2fc
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value << target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

102 : Job ID e299468faf894391bca02ba6ce291d7e
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value | target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================
