103 : Job ID 15c1edab20134148b5cac2196454a331
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value | target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

104 : Job ID 4e3baaf8a4284f1799fa5e5d4cfbaf93
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value | target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

105 : Job ID 81e1e2ac009942abb5d5d1dffb394e40
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value & target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

106 : Job ID 2dc6077a29524ed8bd975557b5b9c315
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value & target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

107 : Job ID c9e9a9d372f7450da221d340fdc8295e
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value & target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

108 : Job ID 8feb9f23df374c618eafeb01acb43f98
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (140, 39), end pos: (140, 40)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -137,7 +137,7 @@
             return None
         best = node = self.root
-        distance = abs(self.root.value - target)
+        distance = abs(self.root.value ^ target)
         while node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

109 : Job ID 330dbda0c2c64c9294b2e28ed8beccb8
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 30), end pos: (142, 31)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value ^ target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

110 : Job ID ac89fe61449f410d927357d00fcc140f
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (143, 42), end pos: (143, 43)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -140,7 +140,7 @@
         distance = abs(self.root.value - target)
         while node:
             if abs(node.value - target) < distance:
-                distance = abs(node.value - target)
+                distance = abs(node.value ^ target)
                 best = node
             if target < node.value:
                 node = node.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

111 : Job ID 236096ebc21e4acf8ff5fbbc560f2894
test outcome: killed
binarySearchTree1.py, start pos: (105, 21), end pos: (105, 23)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -102,7 +102,7 @@
         if self.root is None:
             raise ValueError("Binary Tree is empty")
         n = self.root
-        while n.left != None:
+        while n.left is None:
             n = n.left
         return n.value
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ....F...........F....F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ................F............ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_4 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_16 - AttributeEr...
========================= 4 failed, 58 passed in 0.10s =========================

112 : Job ID 1808cc52904b40d0850b12f2ab5cc603
test outcome: killed
binarySearchTree1.py, start pos: (114, 22), end pos: (114, 24)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -111,7 +111,7 @@
         if self.root is None:
             raise ValueError("Binary Tree is empty")
         n = self.root
-        while n.right != None:
+        while n.right is None:
             n = n.right
         return n.value
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FFF.FF.FFFFF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..................F.......... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/te

113 : Job ID 1af41b4bbf5245ba832a423b9c1435ed
test outcome: killed
binarySearchTree1.py, start pos: (35, 15), end pos: (35, 16)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if val == self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....FF.F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_5 - AssertionErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 5 failed, 57 passed in 0.10s =========================

114 : Job ID 882ad18fe4f44d8f8f03740d5ecf60dc
test outcome: killed
binarySearchTree1.py, start pos: (122, 22), end pos: (122, 23)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if target == node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...F.FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTr

115 : Job ID 91f21fdc61ef44a68ec8fab104818343
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 40), end pos: (142, 41)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value - target) == distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

116 : Job ID 09b661c4420f4dd4b157d05e6b83cc15
test outcome: killed
binarySearchTree1.py, start pos: (145, 22), end pos: (145, 23)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if target == node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
========================= 1 failed, 61 passed in 0.10s =========================

117 : Job ID 1dc3ad9f55f440bd809505c9fc13c1ca
test outcome: killed
binarySearchTree1.py, start pos: (35, 15), end pos: (35, 16)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if val != self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
========================= 1 failed, 61 passed in 0.09s =========================

118 : Job ID 67adeb99ad064dc5bba2b6087ec303f6
test outcome: killed
binarySearchTree1.py, start pos: (122, 22), end pos: (122, 23)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if target != node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
...F..F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 2 failed, 60 passed in 0.09s =========================

119 : Job ID 9ff9e563533045ceb56212f91c3aafb6
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 40), end pos: (142, 41)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value - target) != distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

120 : Job ID 69618c0738d04fd38d44dff00ac1ae58
test outcome: killed
binarySearchTree1.py, start pos: (145, 22), end pos: (145, 23)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if target != node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ......................FF [ 38%]
.....FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_29 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 4 failed, 58 passed in 0.09s =========================

121 : Job ID 329174ac8abd496b9d225c7b25a4f395
test outcome: killed
binarySearchTree1.py, start pos: (35, 15), end pos: (35, 16)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if val <= self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....F..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 4 failed, 58 passed in 0.10s =========================

122 : Job ID 53f54a9b8b7845b4965da45819be0213
test outcome: killed
binarySearchTree1.py, start pos: (122, 22), end pos: (122, 23)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if target <= node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchT

123 : Job ID 7fe3218312b14cd09805cd0e9d5a292b
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 40), end pos: (142, 41)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value - target) <= distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

124 : Job ID 2a8a81f3f85546f3b7e2720cc6a778e3
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (145, 22), end pos: (145, 23)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if target <= node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

125 : Job ID d14d01a0cfc34e73817f1099a774ccee
test outcome: killed
binarySearchTree1.py, start pos: (35, 15), end pos: (35, 16)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if val > self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .....F....................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_5 - AssertionErr...
========================= 2 failed, 60 passed in 0.10s =========================

126 : Job ID 474ad1ffe7874666b57d5b57c4a66363
test outcome: killed
binarySearchTree1.py, start pos: (122, 22), end pos: (122, 23)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if target > node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
...F..F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 2 failed, 60 passed in 0.09s =========================

127 : Job ID 98da88d69a0849d3bd0b4284fd1c9bfe
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 40), end pos: (142, 41)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value - target) > distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================
