128 : Job ID 2f643738c2f0439392d600bb07cac240
test outcome: killed
binarySearchTree1.py, start pos: (145, 22), end pos: (145, 23)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if target > node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................FFF [ 38%]
.....FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_29 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 5 failed, 57 passed in 0.09s =========================

129 : Job ID 6534cb73b2254000ae8621d617975308
test outcome: killed
binarySearchTree1.py, start pos: (35, 15), end pos: (35, 16)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if val >= self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....FF.F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_5 - AssertionErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 5 failed, 57 passed in 0.10s =========================

130 : Job ID 46e107efedfa4e31a5659e13f4b8970d
test outcome: killed
binarySearchTree1.py, start pos: (122, 22), end pos: (122, 23)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if target >= node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...F.FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchT

131 : Job ID 47cd04be0eb44420b9f416a7fb24794f
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 40), end pos: (142, 41)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value - target) >= distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.11s ==============================

132 : Job ID 6920c8d6e9aa4c56982152fe37d6e097
test outcome: killed
binarySearchTree1.py, start pos: (145, 22), end pos: (145, 23)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if target >= node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................FFF [ 38%]
.....FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_29 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 5 failed, 57 passed in 0.11s =========================

133 : Job ID b56fa42021a541088bf2a4582d5a29fd
test outcome: killed
binarySearchTree1.py, start pos: (35, 15), end pos: (35, 16)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if val is self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....FF.F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_5 - AssertionErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 5 failed, 57 passed in 0.10s =========================

134 : Job ID 12103468e4ac410eb2560b0862ff00e6
test outcome: killed
binarySearchTree1.py, start pos: (122, 22), end pos: (122, 23)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if target is node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...F.FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTr

135 : Job ID ac62a552cb714c428bb4f3bce03c715f
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 40), end pos: (142, 41)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value - target) is distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

136 : Job ID 21253cad96684e3a80438c907db2e206
test outcome: killed
binarySearchTree1.py, start pos: (145, 22), end pos: (145, 23)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if target is node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
========================= 1 failed, 61 passed in 0.09s =========================

137 : Job ID f70bc43e04ad4fc4801b7e39c8583c74
test outcome: killed
binarySearchTree1.py, start pos: (35, 15), end pos: (35, 16)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if val is not self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
========================= 1 failed, 61 passed in 0.10s =========================

138 : Job ID 95a88e58a40c445a9767e1084a4d7194
test outcome: killed
binarySearchTree1.py, start pos: (122, 22), end pos: (122, 23)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if target is not node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
...F..F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 2 failed, 60 passed in 0.11s =========================

139 : Job ID a32bddb7df8f43bca5e01792e42f5027
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 40), end pos: (142, 41)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if abs(node.value - target) is not distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

140 : Job ID a8355f01befd4402a6115849f229bf04
test outcome: killed
binarySearchTree1.py, start pos: (145, 22), end pos: (145, 23)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if target is not node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ......................FF [ 38%]
.....FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_29 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 4 failed, 58 passed in 0.11s =========================

141 : Job ID 12624fc5edee4351b8c32badc2bf5f2a
test outcome: killed
binarySearchTree1.py, start pos: (18, 15), end pos: (18, 17)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if val == self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - assert...
========================= 1 failed, 61 passed in 0.09s =========================

142 : Job ID 59779289a37448518ef57ee332077985
test outcome: killed
binarySearchTree1.py, start pos: (18, 15), end pos: (18, 17)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if val != self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py F........F.......FFFF.FF [ 38%]
F..FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py FF..F..F.F................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_0 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED D

143 : Job ID f7b5f688202c46f2b47ed8d0cec37912
test outcome: killed
binarySearchTree1.py, start pos: (18, 15), end pos: (18, 17)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if val < self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py F........F.......F....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .F..F..F.F................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_0 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAM

144 : Job ID a7c33b1f5b8848d68096f787060cc604
test outcome: killed
binarySearchTree1.py, start pos: (18, 15), end pos: (18, 17)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if val > self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py F........F.......FFFF.FF [ 38%]
F..FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py FF..F..F.F................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_0 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAM

145 : Job ID eead2edf9b4b4004b9393a02a450c1fe
test outcome: killed
binarySearchTree1.py, start pos: (18, 15), end pos: (18, 17)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if val >= self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..................FFF.FF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py F......F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYN

146 : Job ID aeab03121a4f45d0bb5387559e7e64f6
test outcome: killed
binarySearchTree1.py, start pos: (18, 15), end pos: (18, 17)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if val is self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - assert...
========================= 1 failed, 61 passed in 0.09s =========================

147 : Job ID 43785295a84c462ca62053636b69b657
test outcome: killed
binarySearchTree1.py, start pos: (18, 15), end pos: (18, 17)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if val is not self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py F........F.......FFFF.FF [ 38%]
F..FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py FF..F..F.F................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_0 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAIL

148 : Job ID 526b1eb70e114e789147d1e4299b1421
test outcome: killed
binarySearchTree1.py, start pos: (20, 17), end pos: (20, 18)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -17,7 +17,7 @@
         """
         if val <= self.value:
             self.left = self.addToSubTree(self.left, val)
-        elif val > self.value:
+        elif val == self.value:
             self.right = self.addToSubTree(self.right, val)
     def addToSubTree(self, parent, val):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..................FFF.FF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py F......F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test

149 : Job ID 3a6e034658914d63951458ac4c85d7c6
test outcome: killed
binarySearchTree1.py, start pos: (37, 17), end pos: (37, 18)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -34,7 +34,7 @@
         """
         if val < self.value:
             self.left = self.removeFromParent(self.left, val)
-        elif val > self.value:
+        elif val == self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
             if self.left is None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..F.F..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_2 - AssertionErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 5 failed, 57 passed in 0.10s =========================
