150 : Job ID a7c756b6eb17427aab2fcb47bd298681
test outcome: killed
binarySearchTree1.py, start pos: (124, 24), end pos: (124, 25)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -121,7 +121,7 @@
         while node:
             if target < node.value :
                 node = node.left
-            elif target > node.value:
+            elif target == node.value:
                 node = node.right
             else:
                 return True
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...FFF.                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - a

152 : Job ID 2919a583525f48c2a0898ee4810dd2c1
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (20, 17), end pos: (20, 18)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -17,7 +17,7 @@
         """
         if val <= self.value:
             self.left = self.addToSubTree(self.left, val)
-        elif val > self.value:
+        elif val != self.value:
             self.right = self.addToSubTree(self.right, val)
     def addToSubTree(self, parent, val):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

153 : Job ID e5a6f17ee24748e389d880f9e91114c2
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (37, 17), end pos: (37, 18)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -34,7 +34,7 @@
         """
         if val < self.value:
             self.left = self.removeFromParent(self.left, val)
-        elif val > self.value:
+        elif val != self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
             if self.left is None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

154 : Job ID fbcc56ec78904756973187831ec0aff1
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (124, 24), end pos: (124, 25)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -121,7 +121,7 @@
         while node:
             if target < node.value :
                 node = node.left
-            elif target > node.value:
+            elif target != node.value:
                 node = node.right
             else:
                 return True
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

156 : Job ID 8019f33661b7491ab90214bfa15c7a49
test outcome: killed
binarySearchTree1.py, start pos: (20, 17), end pos: (20, 18)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -17,7 +17,7 @@
         """
         if val <= self.value:
             self.left = self.addToSubTree(self.left, val)
-        elif val > self.value:
+        elif val < self.value:
             self.right = self.addToSubTree(self.right, val)
     def addToSubTree(self, parent, val):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..................FFF.FF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py F......F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_

157 : Job ID 5a729c74bd98492fa74d629c2aac2030
test outcome: killed
binarySearchTree1.py, start pos: (37, 17), end pos: (37, 18)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -34,7 +34,7 @@
         """
         if val < self.value:
             self.left = self.removeFromParent(self.left, val)
-        elif val > self.value:
+        elif val < self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
             if self.left is None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..F.......................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_2 - AssertionErr...
========================= 2 failed, 60 passed in 0.10s =========================

158 : Job ID 999a0beb1ffb4289ac2bc4e18d5073c2
test outcome: killed
binarySearchTree1.py, start pos: (124, 24), end pos: (124, 25)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -121,7 +121,7 @@
         while node:
             if target < node.value :
                 node = node.left
-            elif target > node.value:
+            elif target < node.value:
                 node = node.right
             else:
                 return True
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
========================= 1 failed, 61 passed in 0.09s =========================

160 : Job ID d158532c316e41308d10acc714a211db
test outcome: killed
binarySearchTree1.py, start pos: (20, 17), end pos: (20, 18)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -17,7 +17,7 @@
         """
         if val <= self.value:
             self.left = self.addToSubTree(self.left, val)
-        elif val > self.value:
+        elif val <= self.value:
             self.right = self.addToSubTree(self.right, val)
     def addToSubTree(self, parent, val):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..................FFF.FF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py F......F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::tes

161 : Job ID b1ed8dfeaaf04930ac17761db2d1a6ff
test outcome: killed
binarySearchTree1.py, start pos: (37, 17), end pos: (37, 18)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -34,7 +34,7 @@
         """
         if val < self.value:
             self.left = self.removeFromParent(self.left, val)
-        elif val > self.value:
+        elif val <= self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
             if self.left is None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..F.F..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_2 - AssertionErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 5 failed, 57 passed in 0.10s =========================

162 : Job ID 130e2daffce34b6fb1bbd43ae20d8024
test outcome: killed
binarySearchTree1.py, start pos: (124, 24), end pos: (124, 25)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -121,7 +121,7 @@
         while node:
             if target < node.value :
                 node = node.left
-            elif target > node.value:
+            elif target <= node.value:
                 node = node.right
             else:
                 return True
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...FFF.                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 -

164 : Job ID 8f6071dbea9f4bcba0d2e94459542c64
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (20, 17), end pos: (20, 18)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -17,7 +17,7 @@
         """
         if val <= self.value:
             self.left = self.addToSubTree(self.left, val)
-        elif val > self.value:
+        elif val >= self.value:
             self.right = self.addToSubTree(self.right, val)
     def addToSubTree(self, parent, val):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

165 : Job ID b043b38b7bdc440699e0dac49fbd3930
test outcome: killed
binarySearchTree1.py, start pos: (37, 17), end pos: (37, 18)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -34,7 +34,7 @@
         """
         if val < self.value:
             self.left = self.removeFromParent(self.left, val)
-        elif val > self.value:
+        elif val >= self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
             if self.left is None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....F..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 4 failed, 58 passed in 0.10s =========================

166 : Job ID 75ef248223964599a9644365d2166aec
test outcome: killed
binarySearchTree1.py, start pos: (124, 24), end pos: (124, 25)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -121,7 +121,7 @@
         while node:
             if target < node.value :
                 node = node.left
-            elif target > node.value:
+            elif target >= node.value:
                 node = node.right
             else:
                 return True
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 -

168 : Job ID 8cce96c6a14b411ba1789cd2ca85b0c2
test outcome: killed
binarySearchTree1.py, start pos: (20, 17), end pos: (20, 18)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -17,7 +17,7 @@
         """
         if val <= self.value:
             self.left = self.addToSubTree(self.left, val)
-        elif val > self.value:
+        elif val is self.value:
             self.right = self.addToSubTree(self.right, val)
     def addToSubTree(self, parent, val):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..................FFF.FF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py F......F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_27 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test

169 : Job ID 130fb4a27b584c8b8b7504304bb86eb3
test outcome: killed
binarySearchTree1.py, start pos: (37, 17), end pos: (37, 18)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -34,7 +34,7 @@
         """
         if val < self.value:
             self.left = self.removeFromParent(self.left, val)
-        elif val > self.value:
+        elif val is self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
             if self.left is None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..F.F..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_2 - AssertionErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 5 failed, 57 passed in 0.11s =========================

170 : Job ID f673447ccded47c98bd6cb9ecb497136
test outcome: killed
binarySearchTree1.py, start pos: (124, 24), end pos: (124, 25)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -121,7 +121,7 @@
         while node:
             if target < node.value :
                 node = node.left
-            elif target > node.value:
+            elif target is node.value:
                 node = node.right
             else:
                 return True
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...FFF.                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - a

172 : Job ID 6bac771907bd48a18f0060f50651b0b9
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (20, 17), end pos: (20, 18)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -17,7 +17,7 @@
         """
         if val <= self.value:
             self.left = self.addToSubTree(self.left, val)
-        elif val > self.value:
+        elif val is not self.value:
             self.right = self.addToSubTree(self.right, val)
     def addToSubTree(self, parent, val):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

173 : Job ID 1d27b0c4e24a438ca34f619fc784c39e
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (37, 17), end pos: (37, 18)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -34,7 +34,7 @@
         """
         if val < self.value:
             self.left = self.removeFromParent(self.left, val)
-        elif val > self.value:
+        elif val is not self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
             if self.left is None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

174 : Job ID a1afe379c5654e9a9a751c6bd061793a
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (124, 24), end pos: (124, 25)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -121,7 +121,7 @@
         while node:
             if target < node.value :
                 node = node.left
-            elif target > node.value:
+            elif target is not node.value:
                 node = node.right
             else:
                 return True
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

176 : Job ID 46862ace41f145aba080973c66a92581
test outcome: killed
binarySearchTree1.py, start pos: (25, 18), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -22,7 +22,7 @@
     def addToSubTree(self, parent, val):
         """Add val to parent subtree (if exists) and return root of that subtree."""
-        if parent is None:
+        if parent is not None:
             return BinaryNode(val)
         parent.add(val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py F.F......F......FFFFF.FF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py FF..F..F.F.....F............. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_0 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - Attrib..

177 : Job ID 52c6467c652240cfad5a2f52a26a69af
test outcome: killed
binarySearchTree1.py, start pos: (40, 25), end pos: (40, 27)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -37,7 +37,7 @@
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
-            if self.left is None:
+            if self.left is not None:
                 return self.right
             child = self.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ...........F.....F.F.... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ...FF..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_11 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_3 - AttributeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L:

178 : Job ID 20cb04e97fb74f569a524d0821b0496f
test outcome: killed
binarySearchTree1.py, start pos: (90, 21), end pos: (90, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -87,7 +87,7 @@
     def add(self, value):
         """Insert value into proper location in Binary Tree."""
-        if self.root is None:
+        if self.root is not None:
             self.root = BinaryNode(value)
         else:
             self.root.add(value)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..F.F...FF..FFF.FF.FFFFF [ 38%]
FFFFFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..........FFFF.FF.F.FF.F.F..F [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_4 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_8 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - Attrib.

179 : Job ID 0b0d7d303a2a428aa44ea151814dc503
test outcome: killed
binarySearchTree1.py, start pos: (102, 21), end pos: (102, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -99,7 +99,7 @@
     def getMin(self):
         """Returns minimum value."""
-        if self.root is None:
+        if self.root is not None:
             raise ValueError("Binary Tree is empty")
         n = self.root
         while n.left != None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ....FF..........F....F.. [ 38%]
FF.....                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ...............FFF........... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_4 - ValueEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_5 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_25 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_15 - ValueError:...
FAILED DYN
