180 : Job ID fddf7423b7f945b19827b982a115a49f
test outcome: killed
binarySearchTree1.py, start pos: (111, 21), end pos: (111, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -108,7 +108,7 @@
     def getMax(self):
         """Returns maximum value."""
-        if self.root is None:
+        if self.root is not None:
             raise ValueError("Binary Tree is empty")
         n = self.root
         while n.right != None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ......F.....FFF.FF.FFFFF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..................FF......... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_6 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - ValueE...
FAILED

181 : Job ID adc14776e4b044248c623a0641dda3ac
test outcome: killed
binarySearchTree1.py, start pos: (136, 21), end pos: (136, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -133,7 +133,7 @@
         Return value closest to target. If there are several, then
         return one of them.
         """
-        if self.root is None:
+        if self.root is not None:
             return None
         best = node = self.root
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .......F....FF..F..FFFFF [ 38%]
..FFFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......................FF.... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_7 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
FAILED DY

182 : Job ID 9521ee76650545cdbb768232d4e61bdc
test outcome: killed
binarySearchTree1.py, start pos: (161, 21), end pos: (161, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -158,7 +158,7 @@
                 yield e
     def __repr__(self):
-        if self.root is None:
+        if self.root is not None:
             return "binary:()"
         return "binary:" + str(self.root)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........FF......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ...............F...........F. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_8 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.

183 : Job ID f0961deb55eb48a8ad1782e7f51ae9c3
test outcome: killed
binarySearchTree1.py, start pos: (18, 11), end pos: (18, 28)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -15,7 +15,7 @@
         """
         Add a new node to the tree with value. Respond based on Set semantics
         """
-        if val <= self.value:
+        if not val <= self.value:
             self.left = self.addToSubTree(self.left, val)
         elif val > self.value:
             self.right = self.addToSubTree(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py F........F.......FFFF.FF [ 38%]
F..FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py FF..F..F.F................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_0 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySe

184 : Job ID 210a154c3acd4d9fbaf0dc8043a0036d
test outcome: killed
binarySearchTree1.py, start pos: (25, 11), end pos: (25, 25)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -22,7 +22,7 @@
     def addToSubTree(self, parent, val):
         """Add val to parent subtree (if exists) and return root of that subtree."""
-        if parent is None:
+        if not parent is None:
             return BinaryNode(val)
         parent.add(val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py F.F......F......FFFFF.FF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py FF..F..F.F.....F............. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_0 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_18 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - Attrib...
FAILED DYNAMOSA-MIO/test_b

185 : Job ID 3e92ca3cd1624948ab13475e46e8ae4f
test outcome: killed
binarySearchTree1.py, start pos: (35, 11), end pos: (35, 27)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -32,7 +32,7 @@
         """
          Remove val of self from BinaryTree. 
         """
-        if val < self.value:
+        if not val < self.value:
             self.left = self.removeFromParent(self.left, val)
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .................F...... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....FF.F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_5 - AssertionErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
========================= 5 failed, 57 passed in 0.10s =========================

186 : Job ID 5ef61eeb6f874bc786dc5b265366d1ea
test outcome: killed
binarySearchTree1.py, start pos: (40, 15), end pos: (40, 32)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -37,7 +37,7 @@
         elif val > self.value:
             self.right = self.removeFromParent(self.right, val)
         else:
-            if self.left is None:
+            if not self.left is None:
                 return self.right
             child = self.left
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ...........F.....F.F.... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ...FF..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_11 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_3 - AttributeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
=======================

187 : Job ID 09b424315e6a48f89fcad7ccdd26bc64
test outcome: killed
binarySearchTree1.py, start pos: (44, 18), end pos: (44, 29)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -41,7 +41,7 @@
                 return self.right
             child = self.left
-            while child.right:
+            while not child.right:
                 child = child.right
             childKey = child.value;
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..F......F.......F.....F [ 38%]
FF..F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....F..F..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_25 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - At

188 : Job ID 3829cf4bc5ad43a39c42d9f4fac189e2
test outcome: killed
binarySearchTree1.py, start pos: (56, 11), end pos: (56, 17)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -53,7 +53,7 @@
     def removeFromParent(self, parent, val):
         """Helper method for remove. Ensures proper behavior when removing node that 
         has children."""
-        if parent:
+        if not parent:
             return parent.remove(val)
         return None
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............F.......... [ 38%]
....F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..F.FFFF..................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_2 - AttributeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_4 - assert (L: T...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_5 - AttributeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_6 - AttributeErr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_7 - assert (L: F...
============

189 : Job ID 113898e64f8a4cb092b1fdb6b70f3a69
test outcome: killed
binarySearchTree1.py, start pos: (64, 11), end pos: (64, 20)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -61,7 +61,7 @@
         """Useful debugging function to produce linear tree representation."""
         leftS = ''
         rightS = ''
-        if self.left:
+        if not self.left:
             leftS = str(self.left)
         if self.right:
             rightS = str(self.right)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - Assert...
FAILED

190 : Job ID f212ddf6359b4d1fa271f34cf3835215
test outcome: killed
binarySearchTree1.py, start pos: (66, 11), end pos: (66, 21)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -63,7 +63,7 @@
         rightS = ''
         if self.left:
             leftS = str(self.left)
-        if self.right:
+        if not self.right:
             rightS = str(self.right)
         return "(L:" + leftS + " " + str(self.value) + " R:" + rightS + ")"
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .F.F.....F......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......FFF................... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_3 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - Assert...
FAILED DYNAMOSA-MIO/test_bin

191 : Job ID 97ff813393ca495b9451d0ec3d3c3d34
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (72, 11), end pos: (72, 20)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -69,7 +69,7 @@
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
-        if self.left:
+        if not self.left:
             for v in self.left.inorder():
                 yield v
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.11s ==============================

192 : Job ID 49ba7cca95e84a78b746a8d84b2fe30f
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (78, 11), end pos: (78, 21)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -75,7 +75,7 @@
         yield self.value
-        if self.right:
+        if not self.right:
             for v in self.right.inorder():
                 yield v
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

193 : Job ID 597c81f1393643bdba1f97a8e2d7e450
test outcome: killed
binarySearchTree1.py, start pos: (90, 11), end pos: (90, 28)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -87,7 +87,7 @@
     def add(self, value):
         """Insert value into proper location in Binary Tree."""
-        if self.root is None:
+        if not self.root is None:
             self.root = BinaryNode(value)
         else:
             self.root.add(value)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..F.F...FF..FFF.FF.FFFFF [ 38%]
FFFFFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..........FFFF.FF.F.FF.F.F..F [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_4 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_8 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - Attrib...
FAILED DYNAMOSA-MIO/test

194 : Job ID 45b929944f904ba4b6e093b880aac8e4
test outcome: killed
binarySearchTree1.py, start pos: (97, 11), end pos: (97, 20)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -94,7 +94,7 @@
     def remove(self, val):
         """Remove value from tree."""
-        if self.root:
+        if not self.root:
             self.root = self.root.remove(val)
     def getMin(self):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..F..F...F......FF...F.. [ 38%]
F...F..                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..............F.............. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_5 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED

195 : Job ID 17c9ca9d07a54d62b6397d45c29b0357
test outcome: killed
binarySearchTree1.py, start pos: (102, 11), end pos: (102, 28)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -99,7 +99,7 @@
     def getMin(self):
         """Returns minimum value."""
-        if self.root is None:
+        if not self.root is None:
             raise ValueError("Binary Tree is empty")
         n = self.root
         while n.left != None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ....FF..........F....F.. [ 38%]
FF.....                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ...............FFF........... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_4 - ValueEr...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_5 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_25 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_15 - ValueError:...
FAILED DYNAMOSA-MIO/test_binarySearch

196 : Job ID c09332c437d0424ca550abecdab957b1
test outcome: killed
binarySearchTree1.py, start pos: (105, 14), end pos: (105, 28)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -102,7 +102,7 @@
         if self.root is None:
             raise ValueError("Binary Tree is empty")
         n = self.root
-        while n.left != None:
+        while not n.left != None:
             n = n.left
         return n.value
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ....F...........F....F.. [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ................F............ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_4 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_16 - AttributeEr...
========================= 4 failed, 58 passed in 0.10s =========================

197 : Job ID a159177971ae4dd39d35efbc1a3b5535
test outcome: killed
binarySearchTree1.py, start pos: (111, 11), end pos: (111, 28)
operator: core/AddNot, occurrence: 14
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -108,7 +108,7 @@
     def getMax(self):
         """Returns maximum value."""
-        if self.root is None:
+        if not self.root is None:
             raise ValueError("Binary Tree is empty")
         n = self.root
         while n.right != None:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ......F.....FFF.FF.FFFFF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..................FF......... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_6 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - ValueE...
FAILED DYNAMOSA-MIO/test_binarySea

198 : Job ID 1a40356c1aa2488486a13fb44b3fd50c
test outcome: killed
binarySearchTree1.py, start pos: (114, 14), end pos: (114, 29)
operator: core/AddNot, occurrence: 15
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -111,7 +111,7 @@
         if self.root is None:
             raise ValueError("Binary Tree is empty")
         n = self.root
-        while n.right != None:
+        while not n.right != None:
             n = n.right
         return n.value
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ............FFF.FF.FFFFF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..................F.......... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DY

199 : Job ID 59dbb29604ab44d7a56b525ae961ce28
test outcome: killed
binarySearchTree1.py, start pos: (121, 14), end pos: (121, 18)
operator: core/AddNot, occurrence: 16
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -118,7 +118,7 @@
     def __contains__(self, target):
         """Check whether BST contains target value."""
         node = self.root
-        while node:
+        while not node:
             if target < node.value :
                 node = node.left
             elif target > node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..F....F.F..FFF.FF.FFFFF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F.F...... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_7 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Attr

200 : Job ID b27bb69fa79947e496ab0f217df2fec2
test outcome: killed
binarySearchTree1.py, start pos: (122, 15), end pos: (122, 34)
operator: core/AddNot, occurrence: 17
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -119,7 +119,7 @@
         """Check whether BST contains target value."""
         node = self.root
         while node:
-            if target < node.value :
+            if not target < node.value :
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...F.FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test
