201 : Job ID b9a83e76938f4661b98fe341a1674730
test outcome: killed
binarySearchTree1.py, start pos: (136, 11), end pos: (136, 28)
operator: core/AddNot, occurrence: 18
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -133,7 +133,7 @@
         Return value closest to target. If there are several, then
         return one of them.
         """
-        if self.root is None:
+        if not self.root is None:
             return None
         best = node = self.root
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .......F....FF..F..FFFFF [ 38%]
..FFFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py .......................FF.... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_7 - Attribu...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
FAILED DYNAMOSA-MIO/test_binarySearc

202 : Job ID 350071c439934cd6a6788c03534b35c4
test outcome: killed
binarySearchTree1.py, start pos: (141, 14), end pos: (141, 18)
operator: core/AddNot, occurrence: 19
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -138,7 +138,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
-        while node:
+        while not node:
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ......................FF [ 38%]
.....FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_29 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 4 failed, 58 passed in 0.09s =========================

203 : Job ID 68bf2477f5054ad896d2ac70ef310311
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (142, 15), end pos: (142, 50)
operator: core/AddNot, occurrence: 20
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -139,7 +139,7 @@
         best = node = self.root
         distance = abs(self.root.value - target)
         while node:
-            if abs(node.value - target) < distance:
+            if not abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
             if target < node.value:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.10s ==============================

204 : Job ID d08fed95ab974f759a8f64c18859717a
test outcome: killed
binarySearchTree1.py, start pos: (145, 15), end pos: (145, 34)
operator: core/AddNot, occurrence: 21
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -142,7 +142,7 @@
             if abs(node.value - target) < distance:
                 distance = abs(node.value - target)
                 best = node
-            if target < node.value:
+            if not target < node.value:
                 node = node.left
             elif target > node.value:
                 node = node.right
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .....................FFF [ 38%]
.....FF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_23 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_29 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - assert...
========================= 5 failed, 57 passed in 0.11s =========================

205 : Job ID dce05953eefb47a5bdc4bfdc0077175d
test outcome: killed
binarySearchTree1.py, start pos: (156, 11), end pos: (156, 20)
operator: core/AddNot, occurrence: 22
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -153,7 +153,7 @@
     def __iter__(self):
         """In order traversal of elements in the tree."""
-        if self.root:
+        if not self.root:
             for e in self.root.inorder():
                 yield e
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ...............F........ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ..........................F.. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_15 - Attrib...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_MIO.py::test_case_26 - AttributeEr...
========================= 2 failed, 60 passed in 0.10s =========================

206 : Job ID 25177b4ac25c4446b68f831f530cc6c7
test outcome: killed
binarySearchTree1.py, start pos: (161, 11), end pos: (161, 28)
operator: core/AddNot, occurrence: 23
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -158,7 +158,7 @@
                 yield e
     def __repr__(self):
-        if self.root is None:
+        if not self.root is None:
             return "binary:()"
         return "binary:" + str(self.root)
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........FF......FF....F. [ 38%]
F...F.F                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ...............F...........F. [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_8 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - Asserti...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_24 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_28 - Assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_30 - Assert..

207 : Job ID 55087d344a2748da880aaa3e8ceb9356
test outcome: killed
binarySearchTree1.py, start pos: (127, 23), end pos: (127, 27)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -124,7 +124,7 @@
             elif target > node.value:
                 node = node.right
             else:
-                return True
+                return False
         return False
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py .............FF.FF.FFFFF [ 38%]
...FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ....................F........ [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_19 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_20 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_21 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_22 - assert...
FA

208 : Job ID f286d03d64cf4a8ca82000aad5d3b31c
test outcome: killed
binarySearchTree1.py, start pos: (129, 15), end pos: (129, 20)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -126,7 +126,7 @@
             else:
                 return True
-        return False
+        return True
     def closest(self, target):
         """
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ..F....F.F..FFF.FF.FFFFF [ 38%]
FF.FFFF                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ......................F...... [ 96%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_2 - assert ...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_7 - assert ...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_9 - assert ...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_12 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_13 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_14 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_16 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_17 - assert...
FAILED DYNAMOSA-MIO/test_binarySearchTre

209 : Job ID 5f0030e84d0c4f8fa4ed3c9f54b2ca82
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (73, 21), end pos: (73, 40)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -70,7 +70,7 @@
     def inorder(self):
         """In order traversal generator of tree rooted at given node."""
         if self.left:
-            for v in self.left.inorder():
+            for v in []:
                 yield v
         yield self.value
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

210 : Job ID 113be22f08f94c5785232233f27f2fd4
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (79, 21), end pos: (79, 41)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -76,7 +76,7 @@
         yield self.value
         if self.right:
-            for v in self.right.inorder():
+            for v in []:
                 yield v
 class BinaryTree:
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================

211 : Job ID 02e0465a0b7248f6a66e78444c071a4f
SURVIVED
test outcome: survived
binarySearchTree1.py, start pos: (157, 21), end pos: (157, 40)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- abinarySearchTree1.py
+++ bbinarySearchTree1.py
@@ -154,7 +154,7 @@
     def __iter__(self):
         """In order traversal of elements in the tree."""
         if self.root:
-            for e in self.root.inorder():
+            for e in []:
                 yield e
     def __repr__(self):
DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py ........................ [ 38%]
.......                                                                  [ 50%]
DYNAMOSA-MIO/test_binarySearchTree1_MIO.py ............................. [ 96%]
..                                                                       [100%]
============================== 62 passed in 0.09s ==============================
