   - [# 112] SDI binarySearchTree1: 
--------------------------------------------------------------------------------
   66:         if self.right:
   67:             rightS = str(self.right)
   68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
   69:     
-  70:     def inorder(self):
-  71:         '''In order traversal generator of tree rooted at given node.'''
-  72:         if self.left:
-  73:             for v in self.left.inorder():
-  74:                 yield v
-  75:         
-  76:         yield self.value
-  77:         
-  78:         if self.right:
-  79:             for v in self.right.inorder():
-  80:                 yield v
-  81: 
+  70:     @staticmethod
+  71:     def inorder(self):
+  72:         '''In order traversal generator of tree rooted at given node.'''
+  73:         if self.left:
+  74:             for v in self.left.inorder():
+  75:                 yield v
+  76:         
+  77:         yield self.value
+  78:         
+  79:         if self.right:
+  80:             for v in self.right.inorder():
+  81:                 yield v
   82: class BinaryTree:
   83:     
   84:     def __init__(self):
   85:         '''Create empty binary tree.'''
--------------------------------------------------------------------------------
[0.62041 s] survived

   - [# 145] SDL binarySearchTree1: 
--------------------------------------------------------------------------------
   64:         if self.left:
   65:             leftS = str(self.left)
   66:         if self.right:
   67:             rightS = str(self.right)
-  68:         return ((((('(L:' + leftS) + ' ') + str(self.value)) + ' R:') + rightS) + ')'
+  68:         pass
   69:     
   70:     def inorder(self):
   71:         '''In order traversal generator of tree rooted at given node.'''
   72:         if self.left:
--------------------------------------------------------------------------------
[0.55170 s] killed by DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py::test_case_1

def test_case_1():
        none_type_0 = None
        binary_node_0 = module_0.BinaryNode(none_type_0)
        var_0 = binary_node_0.__repr__()
>       assert var_0 == '(L: None R:)'
E       AssertionError

DYNAMOSA-MIO/test_binarySearchTree1_DYNAMOSA.py:16: AssertionError
