   - [#  11] CDI binarySearchTree1: 
--------------------------------------------------------------------------------
    4:     Author: George Heineman    
    5: '''
    6: class BinaryNode:
    7:     
-   8:     def __init__(self, value):
-   9:         '''Create binary node.'''
-  10:         self.value = value
-  11:         self.left = None
-  12:         self.right = None
-  13:     
+   8:     @classmethod
+   9:     def __init__(self, value):
+  10:         '''Create binary node.'''
+  11:         self.value = value
+  12:         self.left = None
+  13:         self.right = None
   14:     def add(self, val):
   15:         '''
   16:         Add a new node to the tree with value. Respond based on Set semantics
   17:         '''
--------------------------------------------------------------------------------
[0.75978 s] killed by DYNAMOSA-MOSA/test_binarySearchTree1_MOSA.py::test_case_24

def test_case_24():
        binary_tree_0 = module_0.BinaryTree()
        var_0 = binary_tree_0.__contains__(binary_tree_0)
        assert var_0 is False
        binary_node_0 = module_0.BinaryNode(var_0)
        var_1 = binary_node_0.add(var_0)
        assert f'{type(binary_node_0.left).__module__}.{type(binary_node_0.left).__qualname__}' == 'binarySearchTree1.BinaryNode'
        binary_node_1 = module_0.BinaryNode(binary_node_0)
        bool_0 = True
        var_2 = binary_tree_0.add(var_0)
        assert f'{type(binary_tree_0.root).__module__}.{type(binary_tree_0.root).__qualname__}' == 'binarySearchTree1.BinaryNode'
        var_3 = binary_tree_0.add(bool_0)
        var_4 = binary_node_0.__repr__()
>       assert var_4 == '(L:(L: False R:) False R:)'
E       AssertionError

DYNAMOSA-MOSA/test_binarySearchTree1_MOSA.py:297: AssertionError
