1 : Job ID df021803e96c4cacad037e162b1f1c51
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left - right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binary

2 : Job ID 5c1aea11743349309e51be0ba79a2a68
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid - 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySear

3 : Job ID 28eca68835f1405dbf67bf77b7932762
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left * right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.........F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Index...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Index...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_3 - Recu...
FAILED ALL-SMART-GPT-MUTPY/test_binary

4 : Job ID 017310887cd3444398641be5649cf742
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid * 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySear

5 : Job ID edee8ac0583e4953b883c27dd660bb3e
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left / right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binary

6 : Job ID 11adff9d7b3e4d879ffdb8f755bbe837
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid / 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySear

7 : Job ID 5611c1794fc64409bdd33c3019d71993
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left // right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_

8 : Job ID 3a04b66bc2ca406684cacbc87dec67bd
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid // 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_bina

9 : Job ID cf0d1207663b473bb8dd457926b7af77
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left % right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binary

10 : Job ID 0cd6b401b37647d386f599677cc4a319
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid % 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySea

11 : Job ID d3149becaa0448e4825900a64caa9dea
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left ** right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_bina

12 : Job ID 1e3bb9c879de47f8a25157a36aa59d12
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid ** 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySe

13 : Job ID 1d78e12f43bc4cf58ed87935120526ad
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left >> right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_b

14 : Job ID f470524b95244bb88de47e020c45d889
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid >> 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binar

15 : Job ID 4bb36f3aea8648aaad1fbd277a289df4
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left << right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...F......F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .............FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ............F. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Index...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Index...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Index...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_13 - Ind...
FAILED ALL-SMART-GPT-MUTPY/test_b

16 : Job ID 23462cc353f1482f8f336755903a1afe
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid << 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binar

17 : Job ID 176ad2deb68045e8896525682166d89c
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left | right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_bin

18 : Job ID e3010adad75a4575a08f8c974e1475e2
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid | 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binaryS

19 : Job ID e432efce6e7a4e3f9abca7326ec01040
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left & right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_bi
