20 : Job ID 2a34c055ece94533964a4704d0a9e604
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid & 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binary

21 : Job ID 9f1daf5c63604c35a874c870d5d8ec80
test outcome: killed
binarySearchTree2.py, start pos: (127, 20), end pos: (127, 21)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left ^ right) // 2
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_bi

22 : Job ID e0425fefd0f242fe9636af677f8416f3
test outcome: killed
binarySearchTree2.py, start pos: (139, 38), end pos: (139, 39)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid ^ 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binary

23 : Job ID 39e6870a14a94734afe28a214e6d3cd0
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) + 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMAR

24 : Job ID cc062f20a2824ddcb2e430f10ba47817
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid + 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySear

25 : Job ID 4c38e7fc5fe14a3eb1491575bce20352
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) * 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMAR

26 : Job ID c76666d41e1542f79d236d351fba8ec0
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid * 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySear

27 : Job ID f38539196a414436bbb5449e25c389e1
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) / 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMAR

28 : Job ID 4cf99287f1104341afbbb3d1a373a8ca
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid / 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySear

29 : Job ID 4bc8ebc8981f4e928f46c02b11697d15
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) // 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED AL

30 : Job ID f832ecc1fdf34c24a9be871df015469a
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid // 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_bina

31 : Job ID fc025e4f60d342daae3699b710ca7984
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) % 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT

32 : Job ID 284731cde4ac48deb9d6608d65a0e91f
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid % 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySear

33 : Job ID 9e89d0bcfe5e4ca3a23133844947dbdb
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) ** 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMA

34 : Job ID 8e02c4e787aa41aeb8c4f11ddd125d2e
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid ** 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySea

35 : Job ID ff880db05ac342158a34b697cfa5c357
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) >> 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...F......FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...........F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ............F. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART

36 : Job ID 30f6db4d14e246e1a6330a413f5544be
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid >> 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binary

37 : Job ID 52f277254cb1426095d81ff66505bb79
test outcome: killed
binarySearchTree2.py, start pos: (120, 60), end pos: (120, 61)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) << 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-

38 : Job ID 6a78447321b943e0b6488be3d08818ec
test outcome: killed
binarySearchTree2.py, start pos: (138, 44), end pos: (138, 45)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid << 1)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binary
