58 : Job ID c946c525d06040c7ad6b711744aec176
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order != "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F...FF.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ...................F   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.....F...... [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_8 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_19 - Asse...
FAILED ALL-SMAR

59 : Job ID c0b60022f59748e0ae2537e1a7e6a81a
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order != "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......FF...         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_preOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_15
========================= 4 failed, 75 passed in 0.27s ======

60 : Job ID 0b497628733f4f458efffd736bec0fe6
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order != "postOrder":
             postOrder(self.root)
             return traversal
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......F....         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_15
========================= 3 failed, 76 passed in 0.27s =========================

61 : Job ID 1fae9d8aa8a746e49020a19487c389ec
test outcome: killed
binarySearchTree2.py, start pos: (48, 24), end pos: (48, 26)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -45,7 +45,7 @@
     def __contains(self, root, value):
         if root == None:
             return False
-        elif root.value == value:
+        elif root.value < value:
             return True
         else:
             if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F.......F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ...F..F..F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F.......F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F...FFFF.F.... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - asser...
FAILED ALL-SMART-GPT-

62 : Job ID 4aef26e72c634640b7125752e04a13e8
test outcome: killed
binarySearchTree2.py, start pos: (67, 25), end pos: (67, 27)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -64,7 +64,7 @@
     def remove(self, value):
         if self.contains(value):
-            if self.size == 1:
+            if self.size < 1:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ............F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....F.......         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_0
========================= 4 failed, 75 passed in 0.28s =========================

63 : Job ID 0ba8ca5ff06c4f1c836b4e646c3ba0e8
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order < "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F...FF.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F.....F   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFF...FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.....F...... [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_8 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GP

64 : Job ID ea3e7c2969854671a7ceeaf3112af64e
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order < "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......FF...         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_preOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.p

65 : Job ID 638fa28412d2401a8c5ebdeace019edc
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order < "postOrder":
             postOrder(self.root)
             return traversal
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......F....         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_15
==================

66 : Job ID 35049319d0504b61885027928d496c49
test outcome: killed
binarySearchTree2.py, start pos: (48, 24), end pos: (48, 26)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -45,7 +45,7 @@
     def __contains(self, root, value):
         if root == None:
             return False
-        elif root.value == value:
+        elif root.value <= value:
             return True
         else:
             if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F.......F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ...F..F..F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F...FF...F.... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - asser...
FAILED ALL-SMART-GP

67 : Job ID 25c86271b09a42d5b4ab3d8a4749a575
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (67, 25), end pos: (67, 27)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -64,7 +64,7 @@
     def remove(self, value):
         if self.contains(value):
-            if self.size == 1:
+            if self.size <= 1:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
============================== 79 passed in 0.26s ==============================

68 : Job ID a6b8bdc19453400891f5cc6970dabb7c
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order <= "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_15
========================= 4 failed, 75 passed in 0.27s =========================

69 : Job ID 23873ad4a342414489c19fe951c972b2
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order <= "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......F....         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::

70 : Job ID db1f8edb1832496cacc7e06cfbae4e55
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order <= "postOrder":
             postOrder(self.root)
             return traversal
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_15
========================= 4 failed, 75 passed in 0.26s =========================

71 : Job ID b65df04a709e4f1ca9033fbeed68b886
test outcome: killed
binarySearchTree2.py, start pos: (48, 24), end pos: (48, 26)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -45,7 +45,7 @@
     def __contains(self, root, value):
         if root == None:
             return False
-        elif root.value == value:
+        elif root.value > value:
             return True
         else:
             if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F.......F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..FF..F..F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F.......F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F...FFFF.F.F.. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3 - TypeE...
FAILED ALL-SMART-GPT-

72 : Job ID b89570222ad94dd2889a3b6c4efbc279
test outcome: killed
binarySearchTree2.py, start pos: (67, 25), end pos: (67, 27)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -64,7 +64,7 @@
     def remove(self, value):
         if self.contains(value):
-            if self.size == 1:
+            if self.size > 1:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ............F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....FF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearc

73 : Job ID d1cdc175fdc74e948037fe3ff19fc8ca
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order > "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F...FF.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F.....F   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.....F...... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_8 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GP

74 : Job ID b287b672c0664f03932639ad242eecc2
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order > "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ........F...         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_preOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
========================= 4 failed, 75 passed in 0.28s ==============

75 : Job ID ee5cc0652bc84c0c99e1a35bc2a1064c
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order > "postOrder":
             postOrder(self.root)
             return traversal
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......F....         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
========================= 4 failed, 75 passed in 0.26s =========================

76 : Job ID 76a4df7fcc25420cb023e51e1ff33193
test outcome: killed
binarySearchTree2.py, start pos: (48, 24), end pos: (48, 26)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -45,7 +45,7 @@
     def __contains(self, root, value):
         if root == None:
             return False
-        elif root.value == value:
+        elif root.value >= value:
             return True
         else:
             if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F.......F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..FF..F..F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F........F.F.. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3 - TypeE...
FAILED ALL-SMART-GP

77 : Job ID 0d0117fb813549998bf24069a41ab860
test outcome: killed
binarySearchTree2.py, start pos: (67, 25), end pos: (67, 27)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -64,7 +64,7 @@
     def remove(self, value):
         if self.contains(value):
-            if self.size == 1:
+            if self.size >= 1:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================
