78 : Job ID 553ddbda872b466ca60b81aa25ee2813
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order >= "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......FF...         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_preOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
===============

79 : Job ID d1f7ec97a60946198abee603b014d48e
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order >= "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
========================= 3 failed, 76 passed in 0.26s =========================

80 : Job ID 4142cfd10a144ad0b100102cf36cfff4
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order >= "postOrder":
             postOrder(self.root)
             return traversal
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .............F......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .F............ [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_13 - Type...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_1
========================= 3 failed, 76 passed in 0.26s =========================

81 : Job ID c4289162584349f9937bd00a4b038a7c
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (48, 24), end pos: (48, 26)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -45,7 +45,7 @@
     def __contains(self, root, value):
         if root == None:
             return False
-        elif root.value == value:
+        elif root.value is value:
             return True
         else:
             if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
============================== 79 passed in 0.26s ==============================

82 : Job ID 0541b8b665214eb1812122b3d7907eb7
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order is "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:163
  /home/lucca/desktop/ic/experimento/testes/python_experiments/binarySearchTree2/binarySearchTree2.py:163: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if order is "inOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 79 passed, 1 warning in 0.26s =========================

83 : Job ID 9df000c732214b6aba0e8a2270f54bc4
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order is "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:166
  /home/lucca/desktop/ic/experimento/testes/python_experiments/binarySearchTree2/binarySearchTree2.py:166: SyntaxWarning: "is" with a literal. Did you mean "=="?
    elif order is "preOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 79 passed, 1 warning in 0.27s =========================

84 : Job ID 0a7f9bbe782e4bc4ab412aa84b7da74b
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order is "postOrder":
             postOrder(self.root)
             return traversal
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:169
  /home/lucca/desktop/ic/experimento/testes/python_experiments/binarySearchTree2/binarySearchTree2.py:169: SyntaxWarning: "is" with a literal. Did you mean "=="?
    elif order is "postOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 79 passed, 1 warning in 0.26s =========================

85 : Job ID 241fb4c365804958a7f0c1171990230a
test outcome: killed
binarySearchTree2.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -18,7 +18,7 @@
     def add(self, value: T):
         if self.contains(value):
             return False
-        elif self.root == None:
+        elif self.root is not None:
             self.root = Node(value)
             self.size += 1
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ..F......F..F.F   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .F.F.F...F.....F....   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .F.......F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F..FFFFF.F.... [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_14
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_1 - Attri...
FAILED ALL-SMART-GPT

86 : Job ID f22c02f858514f268e34e637270d5c0c
test outcome: killed
binarySearchTree2.py, start pos: (29, 25), end pos: (29, 27)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -26,7 +26,7 @@
     def __add(self, root, value):
         if value < root.value:
-            if root.left == None:
+            if root.left is not None:
                 root.left = Node(value)
                 self.size += 1
             else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Attri...
FAILED ALL-SMART-GPT-M

87 : Job ID 5ce77344e79d4abe986a13dccc2b3248
test outcome: killed
binarySearchTree2.py, start pos: (35, 26), end pos: (35, 28)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -32,7 +32,7 @@
             else:
                 self.__add(root.left, value)
         elif value >= root.value:
-            if root.right == None:
+            if root.right is not None:
                 root.right = Node(value)
                 self.size += 1
             else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case

88 : Job ID ef4dcd282ef5449fb973dd98ef29fa95
test outcome: killed
binarySearchTree2.py, start pos: (46, 16), end pos: (46, 18)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -43,7 +43,7 @@
         return self.__contains(self.root, value)
     def __contains(self, root, value):
-        if root == None:
+        if root is not None:
             return False
         elif root.value == value:
             return True
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .FF.F.F..F..F.F   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .FFF.F.F.FF....F....   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .FF.F..F.F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.FFFFF.F.FF. [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_6 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-G

89 : Job ID e829ca4f59724e13be75b5618143ee4c
test outcome: killed
binarySearchTree2.py, start pos: (48, 24), end pos: (48, 26)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -45,7 +45,7 @@
     def __contains(self, root, value):
         if root == None:
             return False
-        elif root.value == value:
+        elif root.value is not value:
             return True
         else:
             if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F.......F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..FF..F..F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F.......F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F...FFFF.F.F.. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3 - TypeE...
FAILED ALL-SM

90 : Job ID f82877484f5b41eab997a2c05ae1d68f
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order is not "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F...FF.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ...................F   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.....F...... [ 97%]
.F                                                                       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:163
  /home/lucca/desktop/ic/experimento/testes/python_experiments/binarySearchTree2/binarySearchTree2.py:163: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if order is not "inOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySea

91 : Job ID 30710e74264743a2804defef140ff1b8
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 6
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order is not "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......FF...         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
.F                                                                       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:166
  /home/lucca/desktop/ic/experimento/testes/python_experiments/binarySearchTree2/binarySearchTree2.py:166: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    elif order is not "preOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED

92 : Job ID 87dcfd5a5ff8413198e30ee806644370
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 7
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order is not "postOrder":
             postOrder(self.root)
             return traversal
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .........F.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......F....         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
.F                                                                       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:169
  /home/lucca/desktop/ic/experimento/testes/python_experiments/binarySearchTree2/binarySearchTree2.py:169: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    elif order is not "postOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_bi

93 : Job ID 1a91e5a4e17c4847a954a99a2611ccd0
test outcome: killed
binarySearchTree2.py, start pos: (28, 17), end pos: (28, 18)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if value == root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F..........F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED A

94 : Job ID a98b02fcfc674f228678b056e862ef6b
test outcome: killed
binarySearchTree2.py, start pos: (51, 21), end pos: (51, 22)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if value == root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
========================= 2 failed, 77 passed in 0.26s =========================

95 : Job ID 34fb39b341db49e28e54e1da66cdafb4
test outcome: killed
binarySearchTree2.py, start pos: (89, 17), end pos: (89, 18)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if value == root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

96 : Job ID c300d6c4c80e4198a24fb22b868cd5f9
test outcome: killed
binarySearchTree2.py, start pos: (28, 17), end pos: (28, 18)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if value != root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FF..FFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_add_multiple_elements
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::t

97 : Job ID 7d60c52a710645949100a5a3cd8ff78d
test outcome: killed
binarySearchTree2.py, start pos: (51, 21), end pos: (51, 22)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if value != root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================
