98 : Job ID 2b9aa04a41d84340be97e9aa25d8240b
test outcome: killed
binarySearchTree2.py, start pos: (89, 17), end pos: (89, 18)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if value != root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 1 failed, 78 passed in 0.26s =========================

99 : Job ID 3f4acaf58bb3417aa948073cfc7978df
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (28, 17), end pos: (28, 18)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if value <= root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
============================== 79 passed in 0.26s ==============================

100 : Job ID 7c23ff79841745c18ad7d08aa729b260
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (51, 21), end pos: (51, 22)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if value <= root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
============================== 79 passed in 0.26s ==============================

101 : Job ID b886a95f3afc44e3b73ea650540bca0d
test outcome: killed
binarySearchTree2.py, start pos: (89, 17), end pos: (89, 18)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if value <= root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================

102 : Job ID b38a288228364718a7f91880131de4b4
test outcome: killed
binarySearchTree2.py, start pos: (28, 17), end pos: (28, 18)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if value > root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F..........F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED A

103 : Job ID 06353b27b2394df4a1c1f285e6638c7b
test outcome: killed
binarySearchTree2.py, start pos: (51, 21), end pos: (51, 22)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if value > root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================

104 : Job ID 65aab2d34ef146018b79067cefaf43fb
test outcome: killed
binarySearchTree2.py, start pos: (89, 17), end pos: (89, 18)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if value > root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ..........FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 2 failed, 77 passed in 0.26s =========================

105 : Job ID 90ee09c64ebb42eb90969fc83163fcd3
test outcome: killed
binarySearchTree2.py, start pos: (28, 17), end pos: (28, 18)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if value >= root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED

106 : Job ID 4e59bfbfd179455d953c45635311a318
test outcome: killed
binarySearchTree2.py, start pos: (51, 21), end pos: (51, 22)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if value >= root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

107 : Job ID 7332c642f02643d186770e834094af1b
test outcome: killed
binarySearchTree2.py, start pos: (89, 17), end pos: (89, 18)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if value >= root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================

108 : Job ID 7f0c5927221c427d925209975740b835
test outcome: killed
binarySearchTree2.py, start pos: (28, 17), end pos: (28, 18)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if value is root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F..........F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED

109 : Job ID 332e356b1c1f4faf96e48c846e2ef08c
test outcome: killed
binarySearchTree2.py, start pos: (51, 21), end pos: (51, 22)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if value is root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
========================= 2 failed, 77 passed in 0.26s =========================

110 : Job ID 80bc0e9a067f468e9ff62cfc1ee8a104
test outcome: killed
binarySearchTree2.py, start pos: (89, 17), end pos: (89, 18)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if value is root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

111 : Job ID c0cf5507a9224d2d96635592681c5d29
test outcome: killed
binarySearchTree2.py, start pos: (28, 17), end pos: (28, 18)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if value is not root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FF..FFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_add_multiple_elements
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.

112 : Job ID 2e8a5f1b5e044685a6c554b7823d37fb
test outcome: killed
binarySearchTree2.py, start pos: (51, 21), end pos: (51, 22)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if value is not root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

113 : Job ID 44aa5b176d984a8cb64045d3bd2cdea8
test outcome: killed
binarySearchTree2.py, start pos: (89, 17), end pos: (89, 18)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if value is not root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 1 failed, 78 passed in 0.29s =========================

114 : Job ID 12ec3019dd204a2b83923f532122f91f
test outcome: killed
binarySearchTree2.py, start pos: (92, 19), end pos: (92, 20)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -89,7 +89,7 @@
         if value < root.value:
             root.left = self.__remove(root.left, value)
-        elif value > root.value:
+        elif value == root.value:
             root.right = self.__remove(root.right, value)
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

115 : Job ID 3e891be21eb640128618d0f30fff80bf
test outcome: killed
binarySearchTree2.py, start pos: (124, 16), end pos: (124, 17)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if left == right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAI

116 : Job ID b0890c449ae84a92a788720c4688acca
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (92, 19), end pos: (92, 20)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -89,7 +89,7 @@
         if value < root.value:
             root.left = self.__remove(root.left, value)
-        elif value > root.value:
+        elif value != root.value:
             root.right = self.__remove(root.right, value)
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
============================== 79 passed in 0.26s ==============================

117 : Job ID f80e79ad7c32472290b8fdea45640847
test outcome: killed
binarySearchTree2.py, start pos: (124, 16), end pos: (124, 17)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if left != right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - asse

118 : Job ID 19140a7f4db34443949a0c7e7ddab604
test outcome: killed
binarySearchTree2.py, start pos: (92, 19), end pos: (92, 20)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -89,7 +89,7 @@
         if value < root.value:
             root.left = self.__remove(root.left, value)
-        elif value > root.value:
+        elif value < root.value:
             root.right = self.__remove(root.right, value)
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 1 failed, 78 passed in 0.26s =========================
