119 : Job ID 7aa77ef5216a4b798ba8abe07c7466f1
test outcome: killed
binarySearchTree2.py, start pos: (124, 16), end pos: (124, 17)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if left < right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAIL

120 : Job ID 95dec72cdd494964b4acb461efe15c09
test outcome: killed
binarySearchTree2.py, start pos: (92, 19), end pos: (92, 20)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -89,7 +89,7 @@
         if value < root.value:
             root.left = self.__remove(root.left, value)
-        elif value > root.value:
+        elif value <= root.value:
             root.right = self.__remove(root.right, value)
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

121 : Job ID b4b2fc3fa6694f6da9f1cb4f94a32c96
test outcome: killed
binarySearchTree2.py, start pos: (124, 16), end pos: (124, 17)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if left <= right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FA

122 : Job ID a11a4399085047c7a01b2609e33094fe
test outcome: killed
binarySearchTree2.py, start pos: (92, 19), end pos: (92, 20)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -89,7 +89,7 @@
         if value < root.value:
             root.left = self.__remove(root.left, value)
-        elif value > root.value:
+        elif value >= root.value:
             root.right = self.__remove(root.right, value)
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================

123 : Job ID 3ee7824b06284149b745e6114054cdcb
test outcome: killed
binarySearchTree2.py, start pos: (124, 16), end pos: (124, 17)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if left >= right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser.

124 : Job ID 80323ef65c0747e99e865e3e1a76ce22
test outcome: killed
binarySearchTree2.py, start pos: (92, 19), end pos: (92, 20)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -89,7 +89,7 @@
         if value < root.value:
             root.left = self.__remove(root.left, value)
-        elif value > root.value:
+        elif value is root.value:
             root.right = self.__remove(root.right, value)
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

125 : Job ID 4a8190aa1c9741d78d869607052171ac
test outcome: killed
binarySearchTree2.py, start pos: (124, 16), end pos: (124, 17)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if left is right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAI

126 : Job ID ad206875f3a24883b11e5ff1e090dc9e
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (92, 19), end pos: (92, 20)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -89,7 +89,7 @@
         if value < root.value:
             root.left = self.__remove(root.left, value)
-        elif value > root.value:
+        elif value is not root.value:
             root.right = self.__remove(root.right, value)
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
============================== 79 passed in 0.26s ==============================

127 : Job ID e90fedce8cc64e79a562f34cd1fec5d4
test outcome: killed
binarySearchTree2.py, start pos: (124, 16), end pos: (124, 17)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if left is not right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 -

128 : Job ID 9aeab404bd4a4503a04987955ee5cac9
test outcome: killed
binarySearchTree2.py, start pos: (34, 19), end pos: (34, 21)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -31,7 +31,7 @@
                 self.size += 1
             else:
                 self.__add(root.left, value)
-        elif value >= root.value:
+        elif value == root.value:
             if root.right == None:
                 root.right = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::te

129 : Job ID 549f2c391e374b6284c49e1b663fa4e1
test outcome: killed
binarySearchTree2.py, start pos: (34, 19), end pos: (34, 21)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -31,7 +31,7 @@
                 self.size += 1
             else:
                 self.__add(root.left, value)
-        elif value >= root.value:
+        elif value != root.value:
             if root.right == None:
                 root.right = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...F.F.....F.FF.      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ............F. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_3 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_5 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_11 - ass...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MO

130 : Job ID 97bc548702f743e5af0ba60dd3b27fd1
test outcome: killed
binarySearchTree2.py, start pos: (34, 19), end pos: (34, 21)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -31,7 +31,7 @@
                 self.size += 1
             else:
                 self.__add(root.left, value)
-        elif value >= root.value:
+        elif value < root.value:
             if root.right == None:
                 root.right = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::tes

131 : Job ID bd0dc78b0a8d44fe884570a69c58cb63
test outcome: killed
binarySearchTree2.py, start pos: (34, 19), end pos: (34, 21)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -31,7 +31,7 @@
                 self.size += 1
             else:
                 self.__add(root.left, value)
-        elif value >= root.value:
+        elif value <= root.value:
             if root.right == None:
                 root.right = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::t

132 : Job ID f285d5a35f884c9ca6c473bed7ba8eb6
test outcome: killed
binarySearchTree2.py, start pos: (34, 19), end pos: (34, 21)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -31,7 +31,7 @@
                 self.size += 1
             else:
                 self.__add(root.left, value)
-        elif value >= root.value:
+        elif value > root.value:
             if root.right == None:
                 root.right = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...F.F.....F.FF.      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ............F. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_3 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_5 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_11 - ass...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.p

133 : Job ID 64a3e03a9e394df88b2217f480a11fea
test outcome: killed
binarySearchTree2.py, start pos: (34, 19), end pos: (34, 21)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -31,7 +31,7 @@
                 self.size += 1
             else:
                 self.__add(root.left, value)
-        elif value >= root.value:
+        elif value is root.value:
             if root.right == None:
                 root.right = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::te

134 : Job ID 19ab60f8dac84163bcc10623b3ec6f91
test outcome: killed
binarySearchTree2.py, start pos: (34, 19), end pos: (34, 21)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -31,7 +31,7 @@
                 self.size += 1
             else:
                 self.__add(root.left, value)
-        elif value >= root.value:
+        elif value is not root.value:
             if root.right == None:
                 root.right = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...F.F.....F.FF.      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ............F. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_3 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_5 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_11 - ass...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree

135 : Job ID e08b26f2842d43a980a9d0fd75c31125
test outcome: killed
binarySearchTree2.py, start pos: (86, 16), end pos: (86, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -83,7 +83,7 @@
             return current
-        if root is None:
+        if root is not None:
             return root
         if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================

136 : Job ID 4406ead24b21432aac2a2f6f9ba29fb0
test outcome: killed
binarySearchTree2.py, start pos: (97, 25), end pos: (97, 27)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -94,7 +94,7 @@
         else:
-            if root.left is None:
+            if root.left is not None:
                 temp = root.right
                 root = None
                 return temp
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.27s =========================

137 : Job ID 8f6ba2519e9c472c84b6954d7b714cf3
test outcome: killed
binarySearchTree2.py, start pos: (102, 28), end pos: (102, 30)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -99,7 +99,7 @@
                 root = None
                 return temp
-            elif root.right is None:
+            elif root.right is not None:
                 temp = root.left
                 root = None
                 return temp
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

138 : Job ID a5f5e187a1634c3ba8980b269ee68350
test outcome: killed
binarySearchTree2.py, start pos: (59, 27), end pos: (59, 33)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -56,7 +56,7 @@
     def minValueNode(self, node):
         current = node
-        while current.left is not None:
+        while current.left is None:
             current = current.left
         return current
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .....F..FF.F...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ........F...........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .F....F...F.F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .........F..         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ..........F... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_5 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_8 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_8 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py
