140 : Job ID a8f57c4bf8b74d9590e7c297088b0375
test outcome: killed
binarySearchTree2.py, start pos: (129, 11), end pos: (129, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -126,7 +126,7 @@
         mid = (left + right) // 2
-        if not root:
+        if  root:
             root = Node(array[mid])
             self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test

141 : Job ID 5935d7eb42284ccf88a97e0db9f24bd7
test outcome: killed
binarySearchTree2.py, start pos: (19, 11), end pos: (19, 31)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -16,7 +16,7 @@
         self.size = 0
     def add(self, value: T):
-        if self.contains(value):
+        if not self.contains(value):
             return False
         elif self.root == None:
             self.root = Node(value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .FF.F....F..F.F   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .FFF.F...F.....F....   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .FF.F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F..FFFFF.F.F.. [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py

142 : Job ID f784732159174007850b935fe2103b3d
test outcome: killed
binarySearchTree2.py, start pos: (28, 11), end pos: (28, 29)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -25,7 +25,7 @@
             self.__add(self.root, value)
     def __add(self, root, value):
-        if value < root.value:
+        if not value < root.value:
             if root.left == None:
                 root.left = Node(value)
                 self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/te

143 : Job ID 38c75a6a4f9f430c919ad67b9e25a22d
test outcome: killed
binarySearchTree2.py, start pos: (29, 15), end pos: (29, 32)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -26,7 +26,7 @@
     def __add(self, root, value):
         if value < root.value:
-            if root.left == None:
+            if not root.left == None:
                 root.left = Node(value)
                 self.size += 1
             else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2

144 : Job ID b3bd9383455f4eb5b7a0e8548f7e5a73
test outcome: killed
binarySearchTree2.py, start pos: (35, 15), end pos: (35, 33)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -32,7 +32,7 @@
             else:
                 self.__add(root.left, value)
         elif value >= root.value:
-            if root.right == None:
+            if not root.right == None:
                 root.right = Node(value)
                 self.size += 1
             else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.FFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Attri...
FAILED ALL-SM

145 : Job ID cc8cc484e3bd453295033b885f46dcba
test outcome: killed
binarySearchTree2.py, start pos: (46, 11), end pos: (46, 23)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -43,7 +43,7 @@
         return self.__contains(self.root, value)
     def __contains(self, root, value):
-        if root == None:
+        if not root == None:
             return False
         elif root.value == value:
             return True
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .FF.F.F..F..F.F   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .FFF.F.F.FF....F....   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .FF.F..F.F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.FFFFF.F.FF. [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_6 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchT

146 : Job ID 00e037edc0f14b9cb29693345e8354fa
test outcome: killed
binarySearchTree2.py, start pos: (51, 15), end pos: (51, 33)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -48,7 +48,7 @@
         elif root.value == value:
             return True
         else:
-            if value < root.value:
+            if not value < root.value:
                 return self.__contains(root.left, value)
             else:
                 return self.__contains(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...........F         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

147 : Job ID 3500993715dd4de99bed50eaf1fc00a2
test outcome: killed
binarySearchTree2.py, start pos: (59, 14), end pos: (59, 38)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -56,7 +56,7 @@
     def minValueNode(self, node):
         current = node
-        while current.left is not None:
+        while not current.left is not None:
             current = current.left
         return current
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .....F..FF.F...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ........F...........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .F....F...F.F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .........F..         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ..........F... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_5 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_8 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_8 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_1 - Attr

148 : Job ID 99ad947aabfe4df7a9ac358e7068add6
test outcome: killed
binarySearchTree2.py, start pos: (66, 11), end pos: (66, 31)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -63,7 +63,7 @@
     def remove(self, value):
-        if self.contains(value):
+        if not self.contains(value):
             if self.size == 1:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F.......F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F.......F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....FF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F...FFFF...... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_12 - ass...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node

149 : Job ID 56f039c3c57246df83a000f1b8bf8f01
test outcome: killed
binarySearchTree2.py, start pos: (67, 15), end pos: (67, 29)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -64,7 +64,7 @@
     def remove(self, value):
         if self.contains(value):
-            if self.size == 1:
+            if not self.size == 1:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ............F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....FF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::te

151 : Job ID 7ac8feae40854d168d1126dcd3d580b7
test outcome: killed
binarySearchTree2.py, start pos: (86, 11), end pos: (86, 23)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -83,7 +83,7 @@
             return current
-        if root is None:
+        if not root is None:
             return root
         if value < root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

152 : Job ID 944d9b180e6540fe914a86c532348392
test outcome: killed
binarySearchTree2.py, start pos: (89, 11), end pos: (89, 29)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -86,7 +86,7 @@
         if root is None:
             return root
-        if value < root.value:
+        if not value < root.value:
             root.left = self.__remove(root.left, value)
         elif value > root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

153 : Job ID eb1f09644c8c40c6b846dd94876f56b2
test outcome: killed
binarySearchTree2.py, start pos: (97, 15), end pos: (97, 32)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -94,7 +94,7 @@
         else:
-            if root.left is None:
+            if not root.left is None:
                 temp = root.right
                 root = None
                 return temp
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
========================= 3 failed, 76 passed in 0.26s =========================

154 : Job ID f3d37213eceb41bbb541894ec5c71a28
test outcome: killed
binarySearchTree2.py, start pos: (124, 11), end pos: (124, 23)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -121,7 +121,7 @@
     def __build(self, array: list, root, left: int, right: int):
-        if left > right:
+        if not left > right:
             return
         mid = (left + right) // 2
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_11
FAILED ALL-SMART-GPT-MUT

155 : Job ID 2a1aa85d9d8f4f7fb6871809646049da
test outcome: killed
binarySearchTree2.py, start pos: (129, 11), end pos: (129, 19)
operator: core/AddNot, occurrence: 14
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -126,7 +126,7 @@
         mid = (left + right) // 2
-        if not root:
+        if not not root:
             root = Node(array[mid])
             self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Attri...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree

156 : Job ID 9a72658affef4382b8d48eb91e5df9f0
test outcome: killed
binarySearchTree2.py, start pos: (145, 15), end pos: (145, 19)
operator: core/AddNot, occurrence: 15
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -142,7 +142,7 @@
     def getOrder(self, order="inOrder"):
         def inOrder(root):
-            if root:
+            if not root:
                 inOrder(root.left)
                 traversal.append(root.value)
                 inOrder(root.right)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F...FF.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..............F....F   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFF...FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.....F...FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_8 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_14 - Attr...
FAILED ALL-SMART-GPT-MUTPY/test_bin

157 : Job ID 1c4fc8c1e414496db7eb29e95e102010
test outcome: killed
binarySearchTree2.py, start pos: (151, 15), end pos: (151, 19)
operator: core/AddNot, occurrence: 16
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -148,7 +148,7 @@
                 inOrder(root.right)
         def preOrder(root):
-            if root:
+            if not root:
                 traversal.append(root.value)
                 preOrder(root.left)
                 preOrder(root.right)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .............F.   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......FF...         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_13
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_preOrder
========================= 3 failed, 76 passed in 0.26s =========================

158 : Job ID ff5f1feb2127424fa0c860221d87f01b
test outcome: killed
binarySearchTree2.py, start pos: (157, 15), end pos: (157, 19)
operator: core/AddNot, occurrence: 17
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -154,7 +154,7 @@
                 preOrder(root.right)
         def postOrder(root):
-            if root:
+            if not root:
                 preOrder(root.left)
                 preOrder(root.right)
                 traversal.append(root.value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .......F....         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_getOrder_postOrder
========================= 1 failed, 78 passed in 0.26s =========================

159 : Job ID 4b0247caafa6463e8a78ae25482d3d5a
test outcome: killed
binarySearchTree2.py, start pos: (163, 11), end pos: (163, 29)
operator: core/AddNot, occurrence: 18
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if not order == "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F...FF.....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ...................F   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFF.FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.....F...... [ 97%]
.F                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_8 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_19 - Asse...
FAILED ALL-SMART-GPT-MUTPY/test_binar

160 : Job ID 2cbdee05e0724299b1b12286eff27931
test outcome: killed
binarySearchTree2.py, start pos: (49, 19), end pos: (49, 23)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -46,7 +46,7 @@
         if root == None:
             return False
         elif root.value == value:
-            return True
+            return False
         else:
             if value < root.value:
                 return self.__contains(root.left, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F..F.......F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ...F.....F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.F.......F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....FF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F...FFFF.F.... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - asser...
FAILED ALL-SMART-GPT-
