161 : Job ID 20617ffc79d54cbba72a597fe6760764
test outcome: killed
binarySearchTree2.py, start pos: (20, 19), end pos: (20, 24)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -17,7 +17,7 @@
     def add(self, value: T):
         if self.contains(value):
-            return False
+            return True
         elif self.root == None:
             self.root = Node(value)
             self.size += 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ...F................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..F.............      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .........F.... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_2 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_9
========================= 4 failed, 75 passed in 0.26s =========================

162 : Job ID 2fadf66632f242c5ae8aed446d3d8179
test outcome: killed
binarySearchTree2.py, start pos: (47, 19), end pos: (47, 24)
operator: core/ReplaceFalseWithTrue, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -44,7 +44,7 @@
     def __contains(self, root, value):
         if root == None:
-            return False
+            return True
         elif root.value == value:
             return True
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ..F.F....F..F.F   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .FFF.FFF.F.....F....   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .F..F....F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFFFFFFFF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FF.FFFFF.F.F.. [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_14
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_1 - asser...

163 : Job ID 2f51e7bc4d4348f9a8a46f75c3512636
test outcome: killed
binarySearchTree2.py, start pos: (16, 20), end pos: (16, 21)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -13,7 +13,7 @@
 class BST:
     def __init__(self):
         self.root = None
-        self.size = 0
+        self.size = 1
     def add(self, value: T):
         if self.contains(value):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py FFFFFFFFFFFFFFF   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py FFFFFFFFFFFFFFFFFFFF   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py FFFFFFFFFFFFFFFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FFFFFFFFFFFFFF [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_0 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_5 - ...
FAILED ALL-SMAR

164 : Job ID 2556947f07ed438588b6e94bf9e1bc04
test outcome: killed
binarySearchTree2.py, start pos: (16, 20), end pos: (16, 21)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -13,7 +13,7 @@
 class BST:
     def __init__(self):
         self.root = None
-        self.size = 0
+        self.size = -1
     def add(self, value: T):
         if self.contains(value):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py FFFFFFFFFFFFFFF   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py FFFFFFFFFFFFFFFFFFFF   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py FFFFFFFFFFFFFFFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py FFFFFFFFFFFFFF [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_0 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_5 - ...
FAILED ALL-SMA

165 : Job ID ac7edeed35f54d05bc01c8dddda189db
test outcome: killed
binarySearchTree2.py, start pos: (23, 25), end pos: (23, 26)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -20,7 +20,7 @@
             return False
         elif self.root == None:
             self.root = Node(value)
-            self.size += 1
+            self.size += 2
         else:
             self.__add(self.root, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ..F......F..F.F   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .F.F.F...F.....F....   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .F.......F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F..FFFFF.F.... [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_14
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_1 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3

166 : Job ID 6071552fa5c340448ea4a0104caab679
test outcome: killed
binarySearchTree2.py, start pos: (23, 25), end pos: (23, 26)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -20,7 +20,7 @@
             return False
         elif self.root == None:
             self.root = Node(value)
-            self.size += 1
+            self.size += 0
         else:
             self.__add(self.root, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ..F......F..F.F   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .F.F.F...F.....F....   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py .F.......F..F..F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...FFF....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F..FFFFF.F.... [ 97%]
FF                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_2 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_9 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_14
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_1 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_3

167 : Job ID 9df0fc69c1b144199d017aa264b33eee
test outcome: killed
binarySearchTree2.py, start pos: (31, 29), end pos: (31, 30)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -28,7 +28,7 @@
         if value < root.value:
             if root.left == None:
                 root.left = Node(value)
-                self.size += 1
+                self.size += 2
             else:
                 self.__add(root.left, value)
         elif value >= root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FA

168 : Job ID 9505b46553454fe0b3c9faaaffc5953a
test outcome: killed
binarySearchTree2.py, start pos: (31, 29), end pos: (31, 30)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -28,7 +28,7 @@
         if value < root.value:
             if root.left == None:
                 root.left = Node(value)
-                self.size += 1
+                self.size += 0
             else:
                 self.__add(root.left, value)
         elif value >= root.value:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F........F.F      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FA

169 : Job ID 9a9e3e0fcde4443da293543b36a1eb17
test outcome: killed
binarySearchTree2.py, start pos: (37, 29), end pos: (37, 30)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -34,7 +34,7 @@
         elif value >= root.value:
             if root.right == None:
                 root.right = Node(value)
-                self.size += 1
+                self.size += 2
             else:
                 self.__add(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test

170 : Job ID 656856314316410598f8a3f124f775c2
test outcome: killed
binarySearchTree2.py, start pos: (37, 29), end pos: (37, 30)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -34,7 +34,7 @@
         elif value >= root.value:
             if root.right == None:
                 root.right = Node(value)
-                self.size += 1
+                self.size += 0
             else:
                 self.__add(root.right, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ...F.F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF.....FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test

171 : Job ID 66229ca2e4e8477d8d2809f4fcb64b99
test outcome: killed
binarySearchTree2.py, start pos: (67, 28), end pos: (67, 29)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -64,7 +64,7 @@
     def remove(self, value):
         if self.contains(value):
-            if self.size == 1:
+            if self.size == 2:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ............F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....F.......         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_0
========================= 4 failed, 75 passed in 0.26s =========================

172 : Job ID d43daf40206a4f65a007c7f60c72dcc1
test outcome: killed
binarySearchTree2.py, start pos: (67, 28), end pos: (67, 29)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -64,7 +64,7 @@
     def remove(self, value):
         if self.contains(value):
-            if self.size == 1:
+            if self.size == 0:
                 self.root = None
                 self.size -= 1
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ............F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....F.......         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F............. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_0
========================= 4 failed, 75 passed in 0.26s =========================

173 : Job ID a094c377f6db4781a7a27d0d3a1bc42b
test outcome: killed
binarySearchTree2.py, start pos: (69, 29), end pos: (69, 30)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -66,7 +66,7 @@
         if self.contains(value):
             if self.size == 1:
                 self.root = None
-                self.size -= 1
+                self.size -= 2
             else:
                 self.__remove(self.root, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ............F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ............F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....F.......         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F.....FF...... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - Value...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_12 - Val...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_0
FAILED ALL-SMART-GPT-MUTPY/test_binarySearc

174 : Job ID 139ad17dda404fa3b869ad049f517e53
test outcome: killed
binarySearchTree2.py, start pos: (69, 29), end pos: (69, 30)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -66,7 +66,7 @@
         if self.contains(value):
             if self.size == 1:
                 self.root = None
-                self.size -= 1
+                self.size -= 0
             else:
                 self.__remove(self.root, value)
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ............F..   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py .........F..........   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ............F...      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ....F.......         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py F.....FF...... [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_12
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_9 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_12 - ass...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_leaf_node
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::test_case_0
FAILED ALL-SMART-GPT-MUTPY/test_binarySearc

175 : Job ID 5349621117bf4717b3e8e2dd1fe056fe
test outcome: killed
binarySearchTree2.py, start pos: (73, 29), end pos: (73, 30)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -70,7 +70,7 @@
             else:
                 self.__remove(self.root, value)
-                self.size -= 1
+                self.size -= 2
         else:
             pass
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF........ [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::

176 : Job ID da51621f287f4a9bbfae49e18edf0463
test outcome: killed
binarySearchTree2.py, start pos: (73, 29), end pos: (73, 30)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -70,7 +70,7 @@
             else:
                 self.__remove(self.root, value)
-                self.size -= 1
+                self.size -= 0
         else:
             pass
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ....F..........   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ....F...........      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py .....F....FF         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ....FF........ [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py::test_case_4 - asse...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_with_two_children
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_root_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py::test_remove_node_to_right_large_tree
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py::

177 : Job ID 9bf151c9bdf04133a0b3806d7297a813
test outcome: killed
binarySearchTree2.py, start pos: (120, 46), end pos: (120, 47)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 1, len(array) - 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/t

178 : Job ID bb5e9b18622340cda99e8d11a4d66bd6
test outcome: killed
binarySearchTree2.py, start pos: (120, 46), end pos: (120, 47)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, -1, len(array) - 1)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/

179 : Job ID 1f55e5d62b6b4417b37db0c99721f206
test outcome: killed
binarySearchTree2.py, start pos: (120, 62), end pos: (120, 63)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) - 2)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/t

180 : Job ID 9daf4058143444e38edd2126afca9f8c
test outcome: killed
binarySearchTree2.py, start pos: (120, 62), end pos: (120, 63)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -117,7 +117,7 @@
     def build(self, array: list) -> None:
-        self.root = self.__build(array, None, 0, len(array) - 1)
+        self.root = self.__build(array, None, 0, len(array) - 0)
     def __build(self, array: list, root, left: int, right: int):
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..FF...   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.....F.......   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/t
