181 : Job ID 9dfb0691ea15454cb85211b8e54e3216
test outcome: killed
binarySearchTree2.py, start pos: (127, 32), end pos: (127, 33)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left + right) // 3
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - Recur...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_

182 : Job ID c6832de471804f96a1aebf64074bec40
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (127, 32), end pos: (127, 33)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -124,7 +124,7 @@
         if left > right:
             return
-        mid = (left + right) // 2
+        mid = (left + right) // 1
         if not root:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...............   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ....................   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ................      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py .............. [ 97%]
..                                                                       [100%]
============================== 79 passed in 0.26s ==============================

183 : Job ID febbf820ef4d4f8db436227241e77bb6
test outcome: killed
binarySearchTree2.py, start pos: (132, 25), end pos: (132, 26)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -129,7 +129,7 @@
         if not root:
             root = Node(array[mid])
-            self.size += 1
+            self.size += 2
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::

184 : Job ID bf1b7a321c204bc7b8275df292a34fdd
test outcome: killed
binarySearchTree2.py, start pos: (132, 25), end pos: (132, 26)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -129,7 +129,7 @@
         if not root:
             root = Node(array[mid])
-            self.size += 1
+            self.size += 0
         else:
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::

185 : Job ID df538e002d4048de94a9c99835cebacb
test outcome: killed
binarySearchTree2.py, start pos: (138, 46), end pos: (138, 47)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid - 2)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...F......F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...........F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ............F. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_6 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.

186 : Job ID 8237119aaba8439b97d92d263675ce85
test outcome: killed
binarySearchTree2.py, start pos: (138, 46), end pos: (138, 47)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -135,7 +135,7 @@
             self.__add(root, array[mid])
-        self.__build(array, root, left, mid - 1)
+        self.__build(array, root, left, mid - 0)
         self.__build(array, root, mid + 1, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.p

187 : Job ID 9831c74fd7744d39a9693570d89cf383
test outcome: killed
binarySearchTree2.py, start pos: (139, 40), end pos: (139, 41)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid + 2, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py ...FF.....F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ...FFF.....F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_2 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py::test_case_4 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.

188 : Job ID 6ceff64f58024fd486b94ff16e8306a0
test outcome: killed
binarySearchTree2.py, start pos: (139, 40), end pos: (139, 41)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -136,7 +136,7 @@
             self.__add(root, array[mid])
         self.__build(array, root, left, mid - 1)
-        self.__build(array, root, mid + 1, right)
+        self.__build(array, root, mid + 0, right)
         return root
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py .F.FF..F..F....   [ 18%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.py ..F.F.F.............   [ 44%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MOSA.py ..FFFF..F..F.FFF      [ 64%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MUTPY.py ............         [ 79%]
ALL-SMART-GPT-MUTPY/test_binarySearchTree2_WHOLE_SUITE.py ...........FF. [ 97%]
..                                                                       [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_1 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_3 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_4 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_7 - ...
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_DYNAMOSA.py::test_case_10
FAILED ALL-SMART-GPT-MUTPY/test_binarySearchTree2_MIO.
