   - [#   5] AOR binarySearchTree2: 
--------------------------------------------------------------------------------
  134:             
  135:             
  136:             self.__add(root, array[mid])
  137:         
- 138:         self.__build(array, root, left, mid - 1)
+ 138:         self.__build(array, root, left, mid + 1)
  139:         self.__build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
--------------------------------------------------------------------------------
[0.10479 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py::test_case_2

def test_case_2():
        dict_0 = {}
        node_0 = module_0.Node(dict_0)
        int_0 = 698
        list_0 = [int_0, int_0, int_0, int_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:138: in __build
    ???
E   RecursionError: maximum recursion depth exceeded in comparison
!!! Recursion detected (same locals & position)

   - [#  36] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   44:     
   45:     def __contains(self, root, value):
   46:         if root == None:
   47:             return False
-  48:         elif root.value == value:
+  48:         elif not (root.value == value):
   49:             return True
   50:         
   51:         elif value < root.value:
   52:             return self.__contains(root.left, value)
--------------------------------------------------------------------------------
[0.07983 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py::test_case_2

def test_case_2():
        dict_0 = {}
        node_0 = module_0.Node(dict_0)
        int_0 = 698
        list_0 = [int_0, int_0, int_0, int_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
        assert len(b_s_t_0) == 4
        bool_0 = True
        var_0 = b_s_t_0.add(bool_0)
>       assert len(b_s_t_0) == 5
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py:26: AssertionError

   - [# 108] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
  120:         self.root = self.__build(array, None, 0, len(array) - 1)
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
- 124:         if left > right:
+ 124:         if left < right:
  125:             return
  126:         
  127:         mid = (left + right) // 2
  128:         
--------------------------------------------------------------------------------
[0.07716 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py::test_case_2

def test_case_2():
        dict_0 = {}
        node_0 = module_0.Node(dict_0)
        int_0 = 698
        list_0 = [int_0, int_0, int_0, int_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 4
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py:23: AssertionError

   - [# 169] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
  124:         if left > right:
- 125:             return
+ 125:             pass
  126:         
  127:         mid = (left + right) // 2
  128:         
  129:         if not root:
--------------------------------------------------------------------------------
[0.10777 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py::test_case_2

def test_case_2():
        dict_0 = {}
        node_0 = module_0.Node(dict_0)
        int_0 = 698
        list_0 = [int_0, int_0, int_0, int_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:138: in __build
    ???
E   RecursionError: maximum recursion depth exceeded in comparison
!!! Recursion detected (same locals & position)
