   - [#   1] AOR binarySearchTree2: 
--------------------------------------------------------------------------------
  116:         pass
  117:     
  118:     def build(self, array: list) -> None:
  119:         
- 120:         self.root = self.__build(array, None, 0, len(array) - 1)
+ 120:         self.root = self.__build(array, None, 0, len(array) + 1)
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
  124:         if left > right:
--------------------------------------------------------------------------------
[0.07600 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b358912d0>
array = [<binarySearchTree2.BST object at 0x7f1b358912d0>], root = None
left = 0, right = 2

>   ???
E   IndexError: list index out of range

binarySearchTree2:131: IndexError

   - [#   2] AOR binarySearchTree2: 
--------------------------------------------------------------------------------
  123:         
  124:         if left > right:
  125:             return
  126:         
- 127:         mid = (left + right) // 2
+ 127:         mid = (left - right) // 2
  128:         
  129:         if not root:
  130:             
  131:             root = Node(array[mid])
--------------------------------------------------------------------------------
[0.09683 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:139: in __build
    ???
binarySearchTree2:139: in __build
    ???
E   RecursionError: maximum recursion depth exceeded in comparison
!!! Recursion detected (same locals & position)

   - [#   4] AOR binarySearchTree2: 
--------------------------------------------------------------------------------
  123:         
  124:         if left > right:
  125:             return
  126:         
- 127:         mid = (left + right) // 2
+ 127:         mid = (left + right) * 2
  128:         
  129:         if not root:
  130:             
  131:             root = Node(array[mid])
--------------------------------------------------------------------------------
[0.07768 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b354a26e0>, array = [True, True]
root = None, left = 0, right = 1

>   ???
E   IndexError: list index out of range

binarySearchTree2:131: IndexError

   - [#   7] ASR binarySearchTree2: 
--------------------------------------------------------------------------------
   19:         if self.contains(value):
   20:             return False
   21:         elif self.root == None:
   22:             self.root = Node(value)
-  23:             self.size += 1
+  23:             self.size -= 1
   24:         else:
   25:             self.__add(self.root, value)
   26:     
   27:     def __add(self, root, value):
--------------------------------------------------------------------------------
[0.07667 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
>       assert len(b_s_t_0) == 1
E       ValueError: __len__() should return >= 0

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:13: ValueError

   - [#   8] ASR binarySearchTree2: 
--------------------------------------------------------------------------------
   27:     def __add(self, root, value):
   28:         if value < root.value:
   29:             if root.left == None:
   30:                 root.left = Node(value)
-  31:                 self.size += 1
+  31:                 self.size -= 1
   32:             else:
   33:                 self.__add(root.left, value)
   34:         elif value >= root.value:
   35:             if root.right == None:
--------------------------------------------------------------------------------
[0.07800 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
>       assert len(b_s_t_0) == 3
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:53: AssertionError

   - [#   9] ASR binarySearchTree2: 
--------------------------------------------------------------------------------
   33:                 self.__add(root.left, value)
   34:         elif value >= root.value:
   35:             if root.right == None:
   36:                 root.right = Node(value)
-  37:                 self.size += 1
+  37:                 self.size -= 1
   38:             else:
   39:                 self.__add(root.right, value)
   40:     
   41:     def contains(self, value):
--------------------------------------------------------------------------------
[0.07995 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:43: AssertionError

   - [#  10] ASR binarySearchTree2: 
--------------------------------------------------------------------------------
   65:         
   66:         if self.contains(value):
   67:             if self.size == 1:
   68:                 self.root = None
-  69:                 self.size -= 1
+  69:                 self.size += 1
   70:             else:
   71:                 
   72:                 self.__remove(self.root, value)
   73:                 self.size -= 1
--------------------------------------------------------------------------------
[0.10726 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_12

def test_case_12():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 1
        node_0 = module_0.Node(var_0)
        assert node_0.value == '[]'
        var_2 = b_s_t_0.minValueNode(node_0)
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'binarySearchTree2.Node'
        assert var_2.value == '[]'
        assert var_2.left is None
        assert var_2.right is None
        var_3 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 0
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:141: AssertionError

   - [#  11] ASR binarySearchTree2: 
--------------------------------------------------------------------------------
   69:                 self.size -= 1
   70:             else:
   71:                 
   72:                 self.__remove(self.root, value)
-  73:                 self.size -= 1
+  73:                 self.size += 1
   74:         else:
   75:             pass
   76:     
   77:     def __remove(self, root, value: T):
--------------------------------------------------------------------------------
[0.07837 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [#  12] ASR binarySearchTree2: 
--------------------------------------------------------------------------------
  128:         
  129:         if not root:
  130:             
  131:             root = Node(array[mid])
- 132:             self.size += 1
+ 132:             self.size -= 1
  133:         else:
  134:             
  135:             
  136:             self.__add(root, array[mid])
--------------------------------------------------------------------------------
[0.07780 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 1
E       ValueError: __len__() should return >= 0

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:29: ValueError

   - [#  14] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
   10:         self.left = None
   11:         self.right = None
   12: 
   13: class BST:
-  14:     def __init__(self):
-  15:         self.root = None
-  16:         self.size = 0
-  17:     
+  14:     @classmethod
+  15:     def __init__(self):
+  16:         self.root = None
+  17:         self.size = 0
   18:     def add(self, value: T):
   19:         if self.contains(value):
   20:             return False
   21:         elif self.root == None:
--------------------------------------------------------------------------------
[0.07985 s] survived

   - [#  16] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
   23:             self.size += 1
   24:         else:
   25:             self.__add(self.root, value)
   26:     
-  27:     def __add(self, root, value):
-  28:         if value < root.value:
-  29:             if root.left == None:
-  30:                 root.left = Node(value)
-  31:                 self.size += 1
-  32:             else:
-  33:                 self.__add(root.left, value)
-  34:         elif value >= root.value:
-  35:             if root.right == None:
-  36:                 root.right = Node(value)
-  37:                 self.size += 1
-  38:             else:
-  39:                 self.__add(root.right, value)
-  40:     
+  27:     @classmethod
+  28:     def __add(self, root, value):
+  29:         if value < root.value:
+  30:             if root.left == None:
+  31:                 root.left = Node(value)
+  32:                 self.size += 1
+  33:             else:
+  34:                 self.__add(root.left, value)
+  35:         elif value >= root.value:
+  36:             if root.right == None:
+  37:                 root.right = Node(value)
+  38:                 self.size += 1
+  39:             else:
+  40:                 self.__add(root.right, value)
   41:     def contains(self, value):
   42:         
   43:         return self.__contains(self.root, value)
   44:     
--------------------------------------------------------------------------------
[0.07955 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()

   - [#  17] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
   37:                 self.size += 1
   38:             else:
   39:                 self.__add(root.right, value)
   40:     
-  41:     def contains(self, value):
-  42:         
-  43:         return self.__contains(self.root, value)
-  44:     
+  41:     @classmethod
+  42:     def contains(self, value):
+  43:         
+  44:         return self.__contains(self.root, value)
   45:     def __contains(self, root, value):
   46:         if root == None:
   47:             return False
   48:         elif root.value == value:
--------------------------------------------------------------------------------
[0.07641 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree2.BST'>
value = <binarySearchTree2.BST object at 0x7f1b359fe7d0>

>   ???
E   AttributeError: type object 'BST' has no attribute 'root'

binarySearchTree2:44: AttributeError

   - [#  18] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
   41:     def contains(self, value):
   42:         
   43:         return self.__contains(self.root, value)
   44:     
-  45:     def __contains(self, root, value):
-  46:         if root == None:
-  47:             return False
-  48:         elif root.value == value:
-  49:             return True
-  50:         
-  51:         elif value < root.value:
-  52:             return self.__contains(root.left, value)
-  53:         else:
-  54:             return self.__contains(root.right, value)
-  55:     
+  45:     @classmethod
+  46:     def __contains(self, root, value):
+  47:         if root == None:
+  48:             return False
+  49:         elif root.value == value:
+  50:             return True
+  51:         
+  52:         elif value < root.value:
+  53:             return self.__contains(root.left, value)
+  54:         else:
+  55:             return self.__contains(root.right, value)
   56:     def minValueNode(self, node):
   57:         current = node
   58:         
   59:         while current.left is not None:
--------------------------------------------------------------------------------
[0.08942 s] survived

   - [#  19] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
   52:             return self.__contains(root.left, value)
   53:         else:
   54:             return self.__contains(root.right, value)
   55:     
-  56:     def minValueNode(self, node):
-  57:         current = node
-  58:         
-  59:         while current.left is not None:
-  60:             current = current.left
-  61:         
-  62:         return current
-  63:     
+  56:     @classmethod
+  57:     def minValueNode(self, node):
+  58:         current = node
+  59:         
+  60:         while current.left is not None:
+  61:             current = current.left
+  62:         
+  63:         return current
   64:     def remove(self, value):
   65:         
   66:         if self.contains(value):
   67:             if self.size == 1:
--------------------------------------------------------------------------------
[0.08038 s] survived

   - [#  21] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
   73:                 self.size -= 1
   74:         else:
   75:             pass
   76:     
-  77:     def __remove(self, root, value: T):
-  78:         def minValueNode(node):
-  79:             current = node
-  80:             
-  81:             while current.left is not None:
-  82:                 current = current.left
-  83:             
-  84:             return current
-  85:         
-  86:         if root is None:
-  87:             return root
-  88:         
-  89:         if value < root.value:
-  90:             root.left = self.__remove(root.left, value)
-  91:         
-  92:         elif value > root.value:
-  93:             root.right = self.__remove(root.right, value)
-  94:         else:
-  95:             
+  77:     @classmethod
+  78:     def __remove(self, root, value: T):
+  79:         def minValueNode(node):
+  80:             current = node
+  81:             
+  82:             while current.left is not None:
+  83:                 current = current.left
+  84:             
+  85:             return current
+  86:         
+  87:         if root is None:
+  88:             return root
+  89:         
+  90:         if value < root.value:
+  91:             root.left = self.__remove(root.left, value)
+  92:         
+  93:         elif value > root.value:
+  94:             root.right = self.__remove(root.right, value)
+  95:         else:
   96:

   - [#  22] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
  111:             root.right = self.__remove(root.right, temp.value)
  112:         
  113:         return root
  114:     
- 115:     def isValid(self):
- 116:         pass
- 117:     
+ 115:     @classmethod
+ 116:     def isValid(self):
+ 117:         pass
  118:     def build(self, array: list) -> None:
  119:         
  120:         self.root = self.__build(array, None, 0, len(array) - 1)
  121:     
--------------------------------------------------------------------------------
[0.07982 s] survived

   - [#  24] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
  118:     def build(self, array: list) -> None:
  119:         
  120:         self.root = self.__build(array, None, 0, len(array) - 1)
  121:     
- 122:     def __build(self, array: list, root, left: int, right: int):
- 123:         
- 124:         if left > right:
- 125:             return
- 126:         
- 127:         mid = (left + right) // 2
- 128:         
- 129:         if not root:
- 130:             
- 131:             root = Node(array[mid])
- 132:             self.size += 1
- 133:         else:
- 134:             
+ 122:     @classmethod
+ 123:     def __build(self, array: list, root, left: int, right: int):
+ 124:         
+ 125:         if left > right:
+ 126:             return
+ 127:         
+ 128:         mid = (left + right) // 2
+ 129:         
+ 130:         if not root:
+ 131:             
+ 132:             root = Node(array[mid])
+ 133:             self.size += 1
+ 134:         else:
  135:             
- 136:             self.__add(root, array[mid])
- 137:         
- 138:         self.__build(array, root, left, mid - 1)
- 139:         self.__build(array, root, mid + 1, right)
- 140:         
- 141:         return root
- 142:     
+ 136:             
+ 137:             self.__add(root, array[mid])
+ 138:         
+ 139:         self.__build(array, root, left, mid - 1)
+ 140:         self.__build(array, root, mid + 1, right)

   - [#  25] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
  139:         self.__build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
- 143:     def getOrder(self, order='inOrder'):
- 144:         def inOrder(root):
- 145:             if root:
- 146:                 inOrder(root.left)
- 147:                 traversal.append(root.value)
- 148:                 inOrder(root.right)
- 149:         
- 150:         def preOrder(root):
- 151:             if root:
- 152:                 traversal.append(root.value)
- 153:                 preOrder(root.left)
- 154:                 preOrder(root.right)
- 155:         
- 156:         def postOrder(root):
- 157:             if root:
- 158:                 preOrder(root.left)
- 159:                 preOrder(root.right)
- 160:                 traversal.append(root.value)
- 161:         
- 162:         traversal = []
- 163:         if order == 'inOrder':
- 164:             inOrder(self.root)
- 165:             return traversal
- 166:         elif order == 'preOrder':
- 167:             preOrder(self.root)
- 168:             return traversal
- 169:         elif order == 'postOrder':
- 170:             postOrder(self.root)
- 171:             return traversal
- 172:     
+ 143:     @classmethod
+ 144:     def getOrder(self, order='inOrder'):
+ 145:         def inOrder(root):
+ 146:             if root:
+ 147:                 inOrder(root.left)
+ 148:                 traversal.append(root.value)
+ 149:                 inOrder(root.right)
+ 150:         
+ 151:         def preOrder(root):

   - [#  28] COD binarySearchTree2: 
--------------------------------------------------------------------------------
  125:             return
  126:         
  127:         mid = (left + right) // 2
  128:         
- 129:         if not root:
+ 129:         if root:
  130:             
  131:             root = Node(array[mid])
  132:             self.size += 1
  133:         else:
--------------------------------------------------------------------------------
[0.07736 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:136: in __build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b357f9240>, root = None
value = <binarySearchTree2.BST object at 0x7f1b357f9240>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError

   - [#  29] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   15:         self.root = None
   16:         self.size = 0
   17:     
   18:     def add(self, value: T):
-  19:         if self.contains(value):
+  19:         if not (self.contains(value)):
   20:             return False
   21:         elif self.root == None:
   22:             self.root = Node(value)
   23:             self.size += 1
--------------------------------------------------------------------------------
[0.07585 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
>       assert len(b_s_t_0) == 1
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:13: AssertionError

   - [#  30] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   17:     
   18:     def add(self, value: T):
   19:         if self.contains(value):
   20:             return False
-  21:         elif self.root == None:
+  21:         elif not (self.root == None):
   22:             self.root = Node(value)
   23:             self.size += 1
   24:         else:
   25:             self.__add(self.root, value)
--------------------------------------------------------------------------------
[0.07730 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:25: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35c2a200>, root = None
value = <binarySearchTree2.BST object at 0x7f1b35c2a200>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError

   - [#  31] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   24:         else:
   25:             self.__add(self.root, value)
   26:     
   27:     def __add(self, root, value):
-  28:         if value < root.value:
+  28:         if not (value < root.value):
   29:             if root.left == None:
   30:                 root.left = Node(value)
   31:                 self.size += 1
   32:             else:
--------------------------------------------------------------------------------
[0.07925 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
>       assert len(b_s_t_0) == 3
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:53: AssertionError

   - [#  32] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   25:             self.__add(self.root, value)
   26:     
   27:     def __add(self, root, value):
   28:         if value < root.value:
-  29:             if root.left == None:
+  29:             if not (root.left == None):
   30:                 root.left = Node(value)
   31:                 self.size += 1
   32:             else:
   33:                 self.__add(root.left, value)
--------------------------------------------------------------------------------
[0.08014 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
>       var_1 = b_s_t_0.add(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:25: in add
    ???
binarySearchTree2:39: in __add
    ???
binarySearchTree2:33: in __add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b356c5270>, root = None
value = '[]'

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError

   - [#  33] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   30:                 root.left = Node(value)
   31:                 self.size += 1
   32:             else:
   33:                 self.__add(root.left, value)
-  34:         elif value >= root.value:
+  34:         elif not (value >= root.value):
   35:             if root.right == None:
   36:                 root.right = Node(value)
   37:                 self.size += 1
   38:             else:
--------------------------------------------------------------------------------
[0.08040 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:43: AssertionError

   - [#  34] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   31:                 self.size += 1
   32:             else:
   33:                 self.__add(root.left, value)
   34:         elif value >= root.value:
-  35:             if root.right == None:
+  35:             if not (root.right == None):
   36:                 root.right = Node(value)
   37:                 self.size += 1
   38:             else:
   39:                 self.__add(root.right, value)
--------------------------------------------------------------------------------
[0.10477 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:139: in __build
    ???
binarySearchTree2:136: in __build
    ???
binarySearchTree2:39: in __add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b3527c4c0>, root = None
value = True

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError
