   - [#  35] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   42:         
   43:         return self.__contains(self.root, value)
   44:     
   45:     def __contains(self, root, value):
-  46:         if root == None:
+  46:         if not (root == None):
   47:             return False
   48:         elif root.value == value:
   49:             return True
   50:         
--------------------------------------------------------------------------------
[0.07802 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
binarySearchTree2:43: in contains
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b359c10f0>, root = None
value = <binarySearchTree2.BST object at 0x7f1b359c10f0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:48: AttributeError

   - [#  37] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   47:             return False
   48:         elif root.value == value:
   49:             return True
   50:         
-  51:         elif value < root.value:
+  51:         elif not (value < root.value):
   52:             return self.__contains(root.left, value)
   53:         else:
   54:             return self.__contains(root.right, value)
   55:     
--------------------------------------------------------------------------------
[0.07869 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [#  38] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   55:     
   56:     def minValueNode(self, node):
   57:         current = node
   58:         
-  59:         while current.left is not None:
+  59:         while not (current.left is not None):
   60:             current = current.left
   61:         
   62:         return current
   63:     
--------------------------------------------------------------------------------
[0.07737 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
        assert len(b_s_t_0) == 1
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
>       var_1 = b_s_t_0.minValueNode(node_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35780ee0>
node = <binarySearchTree2.Node object at 0x7f1b35780d00>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'left'

binarySearchTree2:59: AttributeError

   - [#  39] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   62:         return current
   63:     
   64:     def remove(self, value):
   65:         
-  66:         if self.contains(value):
+  66:         if not (self.contains(value)):
   67:             if self.size == 1:
   68:                 self.root = None
   69:                 self.size -= 1
   70:             else:
--------------------------------------------------------------------------------
[0.09990 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [#  42] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   82:                 current = current.left
   83:             
   84:             return current
   85:         
-  86:         if root is None:
+  86:         if not (root is None):
   87:             return root
   88:         
   89:         if value < root.value:
   90:             root.left = self.__remove(root.left, value)
--------------------------------------------------------------------------------
[0.08016 s] survived

   - [#  43] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   85:         
   86:         if root is None:
   87:             return root
   88:         
-  89:         if value < root.value:
+  89:         if not (value < root.value):
   90:             root.left = self.__remove(root.left, value)
   91:         
   92:         elif value > root.value:
   93:             root.right = self.__remove(root.right, value)
--------------------------------------------------------------------------------
[0.07935 s] survived

   - [#  44] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   88:         
   89:         if value < root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
-  92:         elif value > root.value:
+  92:         elif not (value > root.value):
   93:             root.right = self.__remove(root.right, value)
   94:         else:
   95:             
   96:             
--------------------------------------------------------------------------------
[0.08020 s] survived

   - [#  45] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   93:             root.right = self.__remove(root.right, value)
   94:         else:
   95:             
   96:             
-  97:             if root.left is None:
+  97:             if not (root.left is None):
   98:                 temp = root.right
   99:                 root = None
  100:                 return temp
  101:             
--------------------------------------------------------------------------------
[0.08004 s] survived

   - [#  46] COI binarySearchTree2: 
--------------------------------------------------------------------------------
   98:                 temp = root.right
   99:                 root = None
  100:                 return temp
  101:             
- 102:             elif root.right is None:
+ 102:             elif not (root.right is None):
  103:                 temp = root.left
  104:                 root = None
  105:                 return temp
  106:             
--------------------------------------------------------------------------------
[0.08804 s] survived

   - [#  47] COI binarySearchTree2: 
--------------------------------------------------------------------------------
  120:         self.root = self.__build(array, None, 0, len(array) - 1)
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
- 124:         if left > right:
+ 124:         if not (left > right):
  125:             return
  126:         
  127:         mid = (left + right) // 2
  128:         
--------------------------------------------------------------------------------
[0.07573 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 1
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:29: AssertionError

   - [#  48] COI binarySearchTree2: 
--------------------------------------------------------------------------------
  125:             return
  126:         
  127:         mid = (left + right) // 2
  128:         
- 129:         if not root:
+ 129:         if not ((not root)):
  130:             
  131:             root = Node(array[mid])
  132:             self.size += 1
  133:         else:
--------------------------------------------------------------------------------
[0.07843 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:136: in __build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35889c60>, root = None
value = <binarySearchTree2.BST object at 0x7f1b35889c60>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError

   - [#  52] COI binarySearchTree2: 
--------------------------------------------------------------------------------
  159:                 preOrder(root.right)
  160:                 traversal.append(root.value)
  161:         
  162:         traversal = []
- 163:         if order == 'inOrder':
+ 163:         if not (order == 'inOrder'):
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
--------------------------------------------------------------------------------
[0.07773 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [#  53] COI binarySearchTree2: 
--------------------------------------------------------------------------------
  162:         traversal = []
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
- 166:         elif order == 'preOrder':
+ 166:         elif not (order == 'preOrder'):
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
--------------------------------------------------------------------------------
[0.09433 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py::test_case_9

def test_case_9():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.getOrder(b_s_t_0)
        node_0 = module_0.Node(b_s_t_0)
        assert len(node_0.value) == 0
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 1
        assert len(node_0.value) == 1
        var_2 = b_s_t_0.__str__()
>       assert var_2 == '[None]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py:105: AssertionError

   - [#  54] COI binarySearchTree2: 
--------------------------------------------------------------------------------
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
- 169:         elif order == 'postOrder':
+ 169:         elif not (order == 'postOrder'):
  170:             postOrder(self.root)
  171:             return traversal
  172:     
  173:     def __len__(self):
--------------------------------------------------------------------------------
[0.08845 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py::test_case_9

def test_case_9():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.getOrder(b_s_t_0)
        node_0 = module_0.Node(b_s_t_0)
        assert len(node_0.value) == 0
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 1
        assert len(node_0.value) == 1
        var_2 = b_s_t_0.__str__()
>       assert var_2 == '[None]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py:105: AssertionError

   - [#  65] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  116:         pass
  117:     
  118:     def build(self, array: list) -> None:
  119:         
- 120:         self.root = self.__build(array, None, 0, len(array) - 1)
+ 120:         self.root = self.__build(array, None, 1, len(array) - 1)
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
  124:         if left > right:
--------------------------------------------------------------------------------
[0.07801 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 1
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:29: AssertionError

   - [#  66] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  116:         pass
  117:     
  118:     def build(self, array: list) -> None:
  119:         
- 120:         self.root = self.__build(array, None, 0, len(array) - 1)
+ 120:         self.root = self.__build(array, None, 0, len(array) - 2)
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
  124:         if left > right:
--------------------------------------------------------------------------------
[0.07721 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 1
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:29: AssertionError

   - [#  67] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  123:         
  124:         if left > right:
  125:             return
  126:         
- 127:         mid = (left + right) // 2
+ 127:         mid = (left + right) // 3
  128:         
  129:         if not root:
  130:             
  131:             root = Node(array[mid])
--------------------------------------------------------------------------------
[0.10466 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:139: in __build
    ???
binarySearchTree2:139: in __build
    ???
binarySearchTree2:139: in __build
    ???
E   RecursionError: maximum recursion depth exceeded in comparison
!!! Recursion detected (same locals & position)

   - [#  69] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  134:             
  135:             
  136:             self.__add(root, array[mid])
  137:         
- 138:         self.__build(array, root, left, mid - 1)
+ 138:         self.__build(array, root, left, mid - 2)
  139:         self.__build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
--------------------------------------------------------------------------------
[0.08157 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_11

def test_case_11():
        bool_0 = True
        list_0 = [bool_0, bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 3
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:122: AssertionError

   - [#  71] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  139:         self.__build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
- 143:     def getOrder(self, order='inOrder'):
+ 143:     def getOrder(self, order='mutpy'):
  144:         def inOrder(root):
  145:             if root:
  146:                 inOrder(root.left)
  147:                 traversal.append(root.value)
--------------------------------------------------------------------------------
[0.07678 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [#  72] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  139:         self.__build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
- 143:     def getOrder(self, order='inOrder'):
+ 143:     def getOrder(self, order=''):
  144:         def inOrder(root):
  145:             if root:
  146:                 inOrder(root.left)
  147:                 traversal.append(root.value)
--------------------------------------------------------------------------------
[0.07709 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [#  73] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  159:                 preOrder(root.right)
  160:                 traversal.append(root.value)
  161:         
  162:         traversal = []
- 163:         if order == 'inOrder':
+ 163:         if order == 'mutpy':
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
--------------------------------------------------------------------------------
[0.07696 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [#  74] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  159:                 preOrder(root.right)
  160:                 traversal.append(root.value)
  161:         
  162:         traversal = []
- 163:         if order == 'inOrder':
+ 163:         if order == '':
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
--------------------------------------------------------------------------------
[0.07672 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [#  75] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  162:         traversal = []
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
- 166:         elif order == 'preOrder':
+ 166:         elif order == 'mutpy':
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
--------------------------------------------------------------------------------
[0.08019 s] survived

   - [#  76] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  162:         traversal = []
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
- 166:         elif order == 'preOrder':
+ 166:         elif order == '':
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
--------------------------------------------------------------------------------
[0.08083 s] survived

   - [#  77] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
- 169:         elif order == 'postOrder':
+ 169:         elif order == 'mutpy':
  170:             postOrder(self.root)
  171:             return traversal
  172:     
  173:     def __len__(self):
--------------------------------------------------------------------------------
[0.07948 s] survived

   - [#  78] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
- 169:         elif order == 'postOrder':
+ 169:         elif order == '':
  170:             postOrder(self.root)
  171:             return traversal
  172:     
  173:     def __len__(self):
--------------------------------------------------------------------------------
[0.07923 s] survived

   - [#  81] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  186: if __name__ == '__main__':
  187:     
  188:     tree = BST()
  189:     
- 190:     tree.add(3)
+ 190:     tree.add(4)
  191:     tree.add(2)
  192:     tree.add(4)
  193:     
  194:     
--------------------------------------------------------------------------------
[0.08087 s] survived

   - [#  89] CRP binarySearchTree2: 
--------------------------------------------------------------------------------
  201:     tree2.remove(1)
  202:     print(tree2, tree2.size)
  203:     tree2.remove(3)
  204:     print(tree2, tree2.size)
- 205:     tree2.remove(2)
+ 205:     tree2.remove(3)
  206:     print(tree2, tree2.size)
--------------------------------------------------------------------------------
[0.07913 s] survived

   - [#  90] OIL binarySearchTree2: 
--------------------------------------------------------------------------------
   57:         current = node
   58:         
   59:         while current.left is not None:
   60:             current = current.left
-  61:         
+  61:             break
   62:         return current
   63:     
   64:     def remove(self, value):
   65:         
--------------------------------------------------------------------------------
[0.08079 s] survived

   - [#  92] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   17:     
   18:     def add(self, value: T):
   19:         if self.contains(value):
   20:             return False
-  21:         elif self.root == None:
+  21:         elif self.root != None:
   22:             self.root = Node(value)
   23:             self.size += 1
   24:         else:
   25:             self.__add(self.root, value)
--------------------------------------------------------------------------------
[0.07677 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:25: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b3565b730>, root = None
value = <binarySearchTree2.BST object at 0x7f1b3565b730>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError

   - [#  95] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   25:             self.__add(self.root, value)
   26:     
   27:     def __add(self, root, value):
   28:         if value < root.value:
-  29:             if root.left == None:
+  29:             if root.left != None:
   30:                 root.left = Node(value)
   31:                 self.size += 1
   32:             else:
   33:                 self.__add(root.left, value)
--------------------------------------------------------------------------------
[0.07986 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
>       var_1 = b_s_t_0.add(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:25: in add
    ???
binarySearchTree2:39: in __add
    ???
binarySearchTree2:33: in __add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35543dc0>, root = None
value = '[]'

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError

   - [#  98] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   31:                 self.size += 1
   32:             else:
   33:                 self.__add(root.left, value)
   34:         elif value >= root.value:
-  35:             if root.right == None:
+  35:             if root.right != None:
   36:                 root.right = Node(value)
   37:                 self.size += 1
   38:             else:
   39:                 self.__add(root.right, value)
--------------------------------------------------------------------------------
[0.07968 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:139: in __build
    ???
binarySearchTree2:136: in __build
    ???
binarySearchTree2:39: in __add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b356d6d40>, root = None
value = True

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:28: AttributeError

   - [#  99] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   42:         
   43:         return self.__contains(self.root, value)
   44:     
   45:     def __contains(self, root, value):
-  46:         if root == None:
+  46:         if root != None:
   47:             return False
   48:         elif root.value == value:
   49:             return True
   50:         
--------------------------------------------------------------------------------
[0.07798 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
binarySearchTree2:43: in contains
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35464cd0>, root = None
value = <binarySearchTree2.BST object at 0x7f1b35464cd0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binarySearchTree2:48: AttributeError
