   - [# 101] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   47:             return False
   48:         elif root.value == value:
   49:             return True
   50:         
-  51:         elif value < root.value:
+  51:         elif value > root.value:
   52:             return self.__contains(root.left, value)
   53:         else:
   54:             return self.__contains(root.right, value)
   55:     
--------------------------------------------------------------------------------
[0.07859 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [# 102] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   47:             return False
   48:         elif root.value == value:
   49:             return True
   50:         
-  51:         elif value < root.value:
+  51:         elif value <= root.value:
   52:             return self.__contains(root.left, value)
   53:         else:
   54:             return self.__contains(root.right, value)
   55:     
--------------------------------------------------------------------------------
[0.07960 s] survived

   - [# 104] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   85:         
   86:         if root is None:
   87:             return root
   88:         
-  89:         if value < root.value:
+  89:         if value > root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
   92:         elif value > root.value:
   93:             root.right = self.__remove(root.right, value)
--------------------------------------------------------------------------------
[0.07935 s] survived

   - [# 105] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   85:         
   86:         if root is None:
   87:             return root
   88:         
-  89:         if value < root.value:
+  89:         if value <= root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
   92:         elif value > root.value:
   93:             root.right = self.__remove(root.right, value)
--------------------------------------------------------------------------------
[0.07978 s] survived

   - [# 106] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   88:         
   89:         if value < root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
-  92:         elif value > root.value:
+  92:         elif value < root.value:
   93:             root.right = self.__remove(root.right, value)
   94:         else:
   95:             
   96:             
--------------------------------------------------------------------------------
[0.08092 s] survived

   - [# 107] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
   88:         
   89:         if value < root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
-  92:         elif value > root.value:
+  92:         elif value >= root.value:
   93:             root.right = self.__remove(root.right, value)
   94:         else:
   95:             
   96:             
--------------------------------------------------------------------------------
[0.08124 s] survived

   - [# 109] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
  120:         self.root = self.__build(array, None, 0, len(array) - 1)
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
- 124:         if left > right:
+ 124:         if left >= right:
  125:             return
  126:         
  127:         mid = (left + right) // 2
  128:         
--------------------------------------------------------------------------------
[0.07682 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 1
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:29: AssertionError

   - [# 110] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
  159:                 preOrder(root.right)
  160:                 traversal.append(root.value)
  161:         
  162:         traversal = []
- 163:         if order == 'inOrder':
+ 163:         if order != 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
--------------------------------------------------------------------------------
[0.07655 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [# 111] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
  162:         traversal = []
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
- 166:         elif order == 'preOrder':
+ 166:         elif order != 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
--------------------------------------------------------------------------------
[0.09058 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py::test_case_9

def test_case_9():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.getOrder(b_s_t_0)
        node_0 = module_0.Node(b_s_t_0)
        assert len(node_0.value) == 0
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 1
        assert len(node_0.value) == 1
        var_2 = b_s_t_0.__str__()
>       assert var_2 == '[None]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py:105: AssertionError

   - [# 112] ROR binarySearchTree2: 
--------------------------------------------------------------------------------
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
- 169:         elif order == 'postOrder':
+ 169:         elif order != 'postOrder':
  170:             postOrder(self.root)
  171:             return traversal
  172:     
  173:     def __len__(self):
--------------------------------------------------------------------------------
[0.09078 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py::test_case_9

def test_case_9():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.getOrder(b_s_t_0)
        node_0 = module_0.Node(b_s_t_0)
        assert len(node_0.value) == 0
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 1
        assert len(node_0.value) == 1
        var_2 = b_s_t_0.__str__()
>       assert var_2 == '[None]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py:105: AssertionError

   - [# 133] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   11:         self.right = None
   12: 
   13: class BST:
   14:     def __init__(self):
-  15:         self.root = None
+  15:         pass
   16:         self.size = 0
   17:     
   18:     def add(self, value: T):
   19:         if self.contains(value):
--------------------------------------------------------------------------------
[0.07710 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35beb0d0>
value = <binarySearchTree2.BST object at 0x7f1b35beb0d0>

>   ???
E   AttributeError: 'BST' object has no attribute 'root'

binarySearchTree2:43: AttributeError

   - [# 134] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   12: 
   13: class BST:
   14:     def __init__(self):
   15:         self.root = None
-  16:         self.size = 0
+  16:         pass
   17:     
   18:     def add(self, value: T):
   19:         if self.contains(value):
   20:             return False
--------------------------------------------------------------------------------
[0.08817 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_0

def test_case_0():
        b_s_t_0 = module_0.BST()
>       assert len(b_s_t_0) == 0

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35627820>

>   ???
E   AttributeError: 'BST' object has no attribute 'size'

binarySearchTree2:174: AttributeError

   - [# 135] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   16:         self.size = 0
   17:     
   18:     def add(self, value: T):
   19:         if self.contains(value):
-  20:             return False
+  20:             pass
   21:         elif self.root == None:
   22:             self.root = Node(value)
   23:             self.size += 1
   24:         else:
--------------------------------------------------------------------------------
[0.07678 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.__str__()
        var_2 = b_s_t_0.isValid()
        var_3 = b_s_t_0.add(b_s_t_0)
>       assert var_3 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:33: AssertionError

   - [# 136] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   18:     def add(self, value: T):
   19:         if self.contains(value):
   20:             return False
   21:         elif self.root == None:
-  22:             self.root = Node(value)
+  22:             pass
   23:             self.size += 1
   24:         else:
   25:             self.__add(self.root, value)
   26:     
--------------------------------------------------------------------------------
[0.08128 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_9

def test_case_9():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        bool_0 = False
        var_0 = b_s_t_0.add(bool_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.__str__()
>       assert var_1 == '[False]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:100: AssertionError

   - [# 137] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   21:         elif self.root == None:
   22:             self.root = Node(value)
   23:             self.size += 1
   24:         else:
-  25:             self.__add(self.root, value)
+  25:             pass
   26:     
   27:     def __add(self, root, value):
   28:         if value < root.value:
   29:             if root.left == None:
--------------------------------------------------------------------------------
[0.07903 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
>       assert len(b_s_t_0) == 3
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:53: AssertionError

   - [# 138] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   26:     
   27:     def __add(self, root, value):
   28:         if value < root.value:
   29:             if root.left == None:
-  30:                 root.left = Node(value)
+  30:                 pass
   31:                 self.size += 1
   32:             else:
   33:                 self.__add(root.left, value)
   34:         elif value >= root.value:
--------------------------------------------------------------------------------
[0.10148 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [# 139] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   29:             if root.left == None:
   30:                 root.left = Node(value)
   31:                 self.size += 1
   32:             else:
-  33:                 self.__add(root.left, value)
+  33:                 pass
   34:         elif value >= root.value:
   35:             if root.right == None:
   36:                 root.right = Node(value)
   37:                 self.size += 1
--------------------------------------------------------------------------------
[0.08468 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_15

def test_case_15():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        bool_0 = False
        var_0 = b_s_t_0.add(bool_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.__str__()
        assert var_1 == '[False]'
        none_type_0 = b_s_t_0.build(var_1)
>       assert len(b_s_t_0) == 8
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:170: AssertionError

   - [# 140] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   32:             else:
   33:                 self.__add(root.left, value)
   34:         elif value >= root.value:
   35:             if root.right == None:
-  36:                 root.right = Node(value)
+  36:                 pass
   37:                 self.size += 1
   38:             else:
   39:                 self.__add(root.right, value)
   40:     
--------------------------------------------------------------------------------
[0.07854 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [# 141] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   35:             if root.right == None:
   36:                 root.right = Node(value)
   37:                 self.size += 1
   38:             else:
-  39:                 self.__add(root.right, value)
+  39:                 pass
   40:     
   41:     def contains(self, value):
   42:         
   43:         return self.__contains(self.root, value)
--------------------------------------------------------------------------------
[0.07853 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
>       assert len(b_s_t_0) == 3
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:53: AssertionError

   - [# 143] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   43:         return self.__contains(self.root, value)
   44:     
   45:     def __contains(self, root, value):
   46:         if root == None:
-  47:             return False
+  47:             pass
   48:         elif root.value == value:
   49:             return True
   50:         
   51:         elif value < root.value:
--------------------------------------------------------------------------------
[0.12408 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MIO.py::test_case_6

def test_case_6():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        str_0 = 'Oz9!2~3'
        none_type_0 = b_s_t_0.build(str_0)
        assert len(b_s_t_0) == 7
        var_0 = b_s_t_0.contains(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MIO.py:59: AssertionError

   - [# 145] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   48:         elif root.value == value:
   49:             return True
   50:         
   51:         elif value < root.value:
-  52:             return self.__contains(root.left, value)
+  52:             pass
   53:         else:
   54:             return self.__contains(root.right, value)
   55:     
   56:     def minValueNode(self, node):
--------------------------------------------------------------------------------
[0.07818 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [# 146] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   50:         
   51:         elif value < root.value:
   52:             return self.__contains(root.left, value)
   53:         else:
-  54:             return self.__contains(root.right, value)
+  54:             pass
   55:     
   56:     def minValueNode(self, node):
   57:         current = node
   58:         
--------------------------------------------------------------------------------
[0.07841 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
        var_2 = b_s_t_0.remove(var_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:55: AssertionError

   - [# 147] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   53:         else:
   54:             return self.__contains(root.right, value)
   55:     
   56:     def minValueNode(self, node):
-  57:         current = node
+  57:         pass
   58:         
   59:         while current.left is not None:
   60:             current = current.left
   61:         
--------------------------------------------------------------------------------
[0.07762 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
        assert len(b_s_t_0) == 1
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
>       var_1 = b_s_t_0.minValueNode(node_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b358bf010>
node = <binarySearchTree2.Node object at 0x7f1b358be0b0>

>   ???
E   UnboundLocalError: local variable 'current' referenced before assignment

binarySearchTree2:59: UnboundLocalError

   - [# 148] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   56:     def minValueNode(self, node):
   57:         current = node
   58:         
   59:         while current.left is not None:
-  60:             current = current.left
+  60:             pass
   61:         
   62:         return current
   63:     
   64:     def remove(self, value):
--------------------------------------------------------------------------------
[0.10417 s] survived

   - [# 149] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   58:         
   59:         while current.left is not None:
   60:             current = current.left
   61:         
-  62:         return current
+  62:         pass
   63:     
   64:     def remove(self, value):
   65:         
   66:         if self.contains(value):
--------------------------------------------------------------------------------
[0.07753 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
        assert len(b_s_t_0) == 1
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        var_1 = b_s_t_0.minValueNode(node_0)
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree2.Node'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:17: AssertionError

   - [# 150] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   64:     def remove(self, value):
   65:         
   66:         if self.contains(value):
   67:             if self.size == 1:
-  68:                 self.root = None
+  68:                 pass
   69:                 self.size -= 1
   70:             else:
   71:                 
   72:                 self.__remove(self.root, value)
--------------------------------------------------------------------------------
[0.07990 s] survived

   - [# 151] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   68:                 self.root = None
   69:                 self.size -= 1
   70:             else:
   71:                 
-  72:                 self.__remove(self.root, value)
+  72:                 pass
   73:                 self.size -= 1
   74:         else:
   75:             pass
   76:     
--------------------------------------------------------------------------------
[0.07951 s] survived

   - [# 152] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   75:             pass
   76:     
   77:     def __remove(self, root, value: T):
   78:         def minValueNode(node):
-  79:             current = node
+  79:             pass
   80:             
   81:             while current.left is not None:
   82:                 current = current.left
   83:             
--------------------------------------------------------------------------------
[0.08000 s] survived

   - [# 155] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   83:             
   84:             return current
   85:         
   86:         if root is None:
-  87:             return root
+  87:             pass
   88:         
   89:         if value < root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
--------------------------------------------------------------------------------
[0.08108 s] survived

   - [# 156] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   86:         if root is None:
   87:             return root
   88:         
   89:         if value < root.value:
-  90:             root.left = self.__remove(root.left, value)
+  90:             pass
   91:         
   92:         elif value > root.value:
   93:             root.right = self.__remove(root.right, value)
   94:         else:
--------------------------------------------------------------------------------
[0.07910 s] survived

   - [# 157] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   89:         if value < root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
   92:         elif value > root.value:
-  93:             root.right = self.__remove(root.right, value)
+  93:             pass
   94:         else:
   95:             
   96:             
   97:             if root.left is None:
--------------------------------------------------------------------------------
[0.08054 s] survived

   - [# 158] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   94:         else:
   95:             
   96:             
   97:             if root.left is None:
-  98:                 temp = root.right
+  98:                 pass
   99:                 root = None
  100:                 return temp
  101:             
  102:             elif root.right is None:
--------------------------------------------------------------------------------
[0.10416 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:72: in remove
    ???
binarySearchTree2:93: in __remove
    ???
binarySearchTree2:90: in __remove
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b352f8220>, root = None
value = '[]'

>   ???
E   UnboundLocalError: local variable 'temp' referenced before assignment

binarySearchTree2:100: UnboundLocalError

   - [# 159] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   95:             
   96:             
   97:             if root.left is None:
   98:                 temp = root.right
-  99:                 root = None
+  99:                 pass
  100:                 return temp
  101:             
  102:             elif root.right is None:
  103:                 temp = root.left
--------------------------------------------------------------------------------
[0.08012 s] survived
