   - [# 160] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   96:             
   97:             if root.left is None:
   98:                 temp = root.right
   99:                 root = None
- 100:                 return temp
+ 100:                 pass
  101:             
  102:             elif root.right is None:
  103:                 temp = root.left
  104:                 root = None
--------------------------------------------------------------------------------
[0.08034 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:72: in remove
    ???
binarySearchTree2:93: in __remove
    ???
binarySearchTree2:90: in __remove
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35957190>, root = None
value = '[]'

>   ???
E   AttributeError: 'NoneType' object has no attribute 'right'

binarySearchTree2:107: AttributeError

   - [# 161] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   99:                 root = None
  100:                 return temp
  101:             
  102:             elif root.right is None:
- 103:                 temp = root.left
+ 103:                 pass
  104:                 root = None
  105:                 return temp
  106:             
  107:             temp = minValueNode(root.right)
--------------------------------------------------------------------------------
[0.08106 s] survived

   - [# 162] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  100:                 return temp
  101:             
  102:             elif root.right is None:
  103:                 temp = root.left
- 104:                 root = None
+ 104:                 pass
  105:                 return temp
  106:             
  107:             temp = minValueNode(root.right)
  108:             
--------------------------------------------------------------------------------
[0.07943 s] survived

   - [# 164] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  103:                 temp = root.left
  104:                 root = None
  105:                 return temp
  106:             
- 107:             temp = minValueNode(root.right)
+ 107:             pass
  108:             
  109:             root.value = temp.value
  110:             
  111:             root.right = self.__remove(root.right, temp.value)
--------------------------------------------------------------------------------
[0.07997 s] survived

   - [# 165] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  105:                 return temp
  106:             
  107:             temp = minValueNode(root.right)
  108:             
- 109:             root.value = temp.value
+ 109:             pass
  110:             
  111:             root.right = self.__remove(root.right, temp.value)
  112:         
  113:         return root
--------------------------------------------------------------------------------
[0.08024 s] survived

   - [# 166] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  107:             temp = minValueNode(root.right)
  108:             
  109:             root.value = temp.value
  110:             
- 111:             root.right = self.__remove(root.right, temp.value)
+ 111:             pass
  112:         
  113:         return root
  114:     
  115:     def isValid(self):
--------------------------------------------------------------------------------
[0.08042 s] survived

   - [# 167] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  109:             root.value = temp.value
  110:             
  111:             root.right = self.__remove(root.right, temp.value)
  112:         
- 113:         return root
+ 113:         pass
  114:     
  115:     def isValid(self):
  116:         pass
  117:     
--------------------------------------------------------------------------------
[0.08216 s] survived

   - [# 168] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  116:         pass
  117:     
  118:     def build(self, array: list) -> None:
  119:         
- 120:         self.root = self.__build(array, None, 0, len(array) - 1)
+ 120:         pass
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
  124:         if left > right:
--------------------------------------------------------------------------------
[0.07704 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 1
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:29: AssertionError

   - [# 170] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  123:         
  124:         if left > right:
  125:             return
  126:         
- 127:         mid = (left + right) // 2
+ 127:         pass
  128:         
  129:         if not root:
  130:             
  131:             root = Node(array[mid])
--------------------------------------------------------------------------------
[0.07863 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b354740d0>
array = [<binarySearchTree2.BST object at 0x7f1b354740d0>], root = None
left = 0, right = 0

>   ???
E   NameError: name 'mid' is not defined

binarySearchTree2:131: NameError

   - [# 171] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  127:         mid = (left + right) // 2
  128:         
  129:         if not root:
  130:             
- 131:             root = Node(array[mid])
+ 131:             pass
  132:             self.size += 1
  133:         else:
  134:             
  135:             
--------------------------------------------------------------------------------
[0.07723 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
        none_type_0 = b_s_t_0.build(list_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.__str__()
        var_2 = b_s_t_0.isValid()
        var_3 = b_s_t_0.add(b_s_t_0)
>       assert var_3 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:33: AssertionError

   - [# 172] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  132:             self.size += 1
  133:         else:
  134:             
  135:             
- 136:             self.__add(root, array[mid])
+ 136:             pass
  137:         
  138:         self.__build(array, root, left, mid - 1)
  139:         self.__build(array, root, mid + 1, right)
  140:         
--------------------------------------------------------------------------------
[0.08098 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:43: AssertionError

   - [# 173] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  134:             
  135:             
  136:             self.__add(root, array[mid])
  137:         
- 138:         self.__build(array, root, left, mid - 1)
+ 138:         pass
  139:         self.__build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
--------------------------------------------------------------------------------
[0.08427 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_11

def test_case_11():
        bool_0 = True
        list_0 = [bool_0, bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 3
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:122: AssertionError

   - [# 174] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  135:             
  136:             self.__add(root, array[mid])
  137:         
  138:         self.__build(array, root, left, mid - 1)
- 139:         self.__build(array, root, mid + 1, right)
+ 139:         pass
  140:         
  141:         return root
  142:     
  143:     def getOrder(self, order='inOrder'):
--------------------------------------------------------------------------------
[0.08157 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        none_type_0 = b_s_t_0.build(list_0)
>       assert len(b_s_t_0) == 2
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:43: AssertionError

   - [# 176] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  142:     
  143:     def getOrder(self, order='inOrder'):
  144:         def inOrder(root):
  145:             if root:
- 146:                 inOrder(root.left)
+ 146:                 pass
  147:                 traversal.append(root.value)
  148:                 inOrder(root.right)
  149:         
  150:         def preOrder(root):
--------------------------------------------------------------------------------
[0.08051 s] survived

   - [# 177] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  143:     def getOrder(self, order='inOrder'):
  144:         def inOrder(root):
  145:             if root:
  146:                 inOrder(root.left)
- 147:                 traversal.append(root.value)
+ 147:                 pass
  148:                 inOrder(root.right)
  149:         
  150:         def preOrder(root):
  151:             if root:
--------------------------------------------------------------------------------
[0.08261 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_9

def test_case_9():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        bool_0 = False
        var_0 = b_s_t_0.add(bool_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.__str__()
>       assert var_1 == '[False]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:100: AssertionError

   - [# 178] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  144:         def inOrder(root):
  145:             if root:
  146:                 inOrder(root.left)
  147:                 traversal.append(root.value)
- 148:                 inOrder(root.right)
+ 148:                 pass
  149:         
  150:         def preOrder(root):
  151:             if root:
  152:                 traversal.append(root.value)
--------------------------------------------------------------------------------
[0.08139 s] survived

   - [# 179] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  148:                 inOrder(root.right)
  149:         
  150:         def preOrder(root):
  151:             if root:
- 152:                 traversal.append(root.value)
+ 152:                 pass
  153:                 preOrder(root.left)
  154:                 preOrder(root.right)
  155:         
  156:         def postOrder(root):
--------------------------------------------------------------------------------
[0.08033 s] survived

   - [# 180] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  149:         
  150:         def preOrder(root):
  151:             if root:
  152:                 traversal.append(root.value)
- 153:                 preOrder(root.left)
+ 153:                 pass
  154:                 preOrder(root.right)
  155:         
  156:         def postOrder(root):
  157:             if root:
--------------------------------------------------------------------------------
[0.07947 s] survived

   - [# 181] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  150:         def preOrder(root):
  151:             if root:
  152:                 traversal.append(root.value)
  153:                 preOrder(root.left)
- 154:                 preOrder(root.right)
+ 154:                 pass
  155:         
  156:         def postOrder(root):
  157:             if root:
  158:                 preOrder(root.left)
--------------------------------------------------------------------------------
[0.07947 s] survived

   - [# 182] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  154:                 preOrder(root.right)
  155:         
  156:         def postOrder(root):
  157:             if root:
- 158:                 preOrder(root.left)
+ 158:                 pass
  159:                 preOrder(root.right)
  160:                 traversal.append(root.value)
  161:         
  162:         traversal = []
--------------------------------------------------------------------------------
[0.08056 s] survived

   - [# 184] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  156:         def postOrder(root):
  157:             if root:
  158:                 preOrder(root.left)
  159:                 preOrder(root.right)
- 160:                 traversal.append(root.value)
+ 160:                 pass
  161:         
  162:         traversal = []
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
--------------------------------------------------------------------------------
[0.08024 s] survived

   - [# 185] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  158:                 preOrder(root.left)
  159:                 preOrder(root.right)
  160:                 traversal.append(root.value)
  161:         
- 162:         traversal = []
+ 162:         pass
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
--------------------------------------------------------------------------------
[0.07859 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.__str__()

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:183: in __str__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b3590b130>, order = 'inOrder'

>   ???
E   NameError: name 'traversal' is not defined

binarySearchTree2:165: NameError

   - [# 186] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  160:                 traversal.append(root.value)
  161:         
  162:         traversal = []
  163:         if order == 'inOrder':
- 164:             inOrder(self.root)
+ 164:             pass
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
--------------------------------------------------------------------------------
[0.08145 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_9

def test_case_9():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        bool_0 = False
        var_0 = b_s_t_0.add(bool_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.__str__()
>       assert var_1 == '[False]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:100: AssertionError

   - [# 187] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  161:         
  162:         traversal = []
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
- 165:             return traversal
+ 165:             pass
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
--------------------------------------------------------------------------------
[0.07812 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [# 188] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
- 167:             preOrder(self.root)
+ 167:             pass
  168:             return traversal
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
  171:             return traversal
--------------------------------------------------------------------------------
[0.08071 s] survived

   - [# 189] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
- 168:             return traversal
+ 168:             pass
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
  171:             return traversal
  172:     
--------------------------------------------------------------------------------
[0.08030 s] survived

   - [# 190] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
- 170:             postOrder(self.root)
+ 170:             pass
  171:             return traversal
  172:     
  173:     def __len__(self):
  174:         return self.size
--------------------------------------------------------------------------------
[0.08018 s] survived

   - [# 191] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
- 171:             return traversal
+ 171:             pass
  172:     
  173:     def __len__(self):
  174:         return self.size
  175:     
--------------------------------------------------------------------------------
[0.08172 s] survived

   - [# 193] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  179:         Returns:
  180:             String: String inorder representaion of BST.
  181:         '''
  182:         
- 183:         return str(self.getOrder())
+ 183:         pass
  184: 
  185: 
  186: if __name__ == '__main__':
  187:     
--------------------------------------------------------------------------------
[0.07777 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
>       assert var_0 == '[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:26: AssertionError

   - [# 194] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  184: 
  185: 
  186: if __name__ == '__main__':
  187:     
- 188:     tree = BST()
+ 188:     pass
  189:     
  190:     tree.add(3)
  191:     tree.add(2)
  192:     tree.add(4)
--------------------------------------------------------------------------------
[0.08078 s] survived

   - [# 195] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  186: if __name__ == '__main__':
  187:     
  188:     tree = BST()
  189:     
- 190:     tree.add(3)
+ 190:     pass
  191:     tree.add(2)
  192:     tree.add(4)
  193:     
  194:     
--------------------------------------------------------------------------------
[0.08030 s] survived

   - [# 196] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  187:     
  188:     tree = BST()
  189:     
  190:     tree.add(3)
- 191:     tree.add(2)
+ 191:     pass
  192:     tree.add(4)
  193:     
  194:     
  195:     
--------------------------------------------------------------------------------
[0.08097 s] survived

   - [# 197] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  188:     tree = BST()
  189:     
  190:     tree.add(3)
  191:     tree.add(2)
- 192:     tree.add(4)
+ 192:     pass
  193:     
  194:     
  195:     
  196:     
--------------------------------------------------------------------------------
[0.08188 s] survived

   - [# 198] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  194:     
  195:     
  196:     
  197:     
- 198:     tree2 = BST()
+ 198:     pass
  199:     tree2.build([1, 2, 3])
  200:     print(tree2, tree2.size)
  201:     tree2.remove(1)
  202:     print(tree2, tree2.size)
--------------------------------------------------------------------------------
[0.08007 s] survived

   - [# 199] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  195:     
  196:     
  197:     
  198:     tree2 = BST()
- 199:     tree2.build([1, 2, 3])
+ 199:     pass
  200:     print(tree2, tree2.size)
  201:     tree2.remove(1)
  202:     print(tree2, tree2.size)
  203:     tree2.remove(3)
--------------------------------------------------------------------------------
[0.07973 s] survived

   - [# 200] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  196:     
  197:     
  198:     tree2 = BST()
  199:     tree2.build([1, 2, 3])
- 200:     print(tree2, tree2.size)
+ 200:     pass
  201:     tree2.remove(1)
  202:     print(tree2, tree2.size)
  203:     tree2.remove(3)
  204:     print(tree2, tree2.size)
--------------------------------------------------------------------------------
[0.08051 s] survived

   - [# 201] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  197:     
  198:     tree2 = BST()
  199:     tree2.build([1, 2, 3])
  200:     print(tree2, tree2.size)
- 201:     tree2.remove(1)
+ 201:     pass
  202:     print(tree2, tree2.size)
  203:     tree2.remove(3)
  204:     print(tree2, tree2.size)
  205:     tree2.remove(2)
--------------------------------------------------------------------------------
[0.07983 s] survived

   - [# 202] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  198:     tree2 = BST()
  199:     tree2.build([1, 2, 3])
  200:     print(tree2, tree2.size)
  201:     tree2.remove(1)
- 202:     print(tree2, tree2.size)
+ 202:     pass
  203:     tree2.remove(3)
  204:     print(tree2, tree2.size)
  205:     tree2.remove(2)
  206:     print(tree2, tree2.size)
--------------------------------------------------------------------------------
[0.08036 s] survived

   - [# 203] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  199:     tree2.build([1, 2, 3])
  200:     print(tree2, tree2.size)
  201:     tree2.remove(1)
  202:     print(tree2, tree2.size)
- 203:     tree2.remove(3)
+ 203:     pass
  204:     print(tree2, tree2.size)
  205:     tree2.remove(2)
  206:     print(tree2, tree2.size)
--------------------------------------------------------------------------------
[0.08208 s] survived

   - [# 204] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  200:     print(tree2, tree2.size)
  201:     tree2.remove(1)
  202:     print(tree2, tree2.size)
  203:     tree2.remove(3)
- 204:     print(tree2, tree2.size)
+ 204:     pass
  205:     tree2.remove(2)
  206:     print(tree2, tree2.size)
--------------------------------------------------------------------------------
[0.08044 s] survived

   - [# 205] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  201:     tree2.remove(1)
  202:     print(tree2, tree2.size)
  203:     tree2.remove(3)
  204:     print(tree2, tree2.size)
- 205:     tree2.remove(2)
+ 205:     pass
  206:     print(tree2, tree2.size)
--------------------------------------------------------------------------------
[0.07973 s] survived

   - [# 206] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
  202:     print(tree2, tree2.size)
  203:     tree2.remove(3)
  204:     print(tree2, tree2.size)
  205:     tree2.remove(2)
- 206:     print(tree2, tree2.size)
+ 206:     pass
--------------------------------------------------------------------------------
[0.08068 s] survived

   - [# 212] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   15:         self.root = None
   16:         self.size = 0
   17:     
   18:     def add(self, value: T):
-  19:         if self.contains(value):
+  19:         if contains(value):
   20:             return False
   21:         elif self.root == None:
   22:             self.root = Node(value)
   23:             self.size += 1
--------------------------------------------------------------------------------
[0.07702 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35924df0>
value = <binarySearchTree2.BST object at 0x7f1b35924df0>

>   ???
E   NameError: name 'contains' is not defined

binarySearchTree2:19: NameError

   - [# 213] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   17:     
   18:     def add(self, value: T):
   19:         if self.contains(value):
   20:             return False
-  21:         elif self.root == None:
+  21:         elif root == None:
   22:             self.root = Node(value)
   23:             self.size += 1
   24:         else:
   25:             self.__add(self.root, value)
--------------------------------------------------------------------------------
[0.07846 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b3594e800>
value = <binarySearchTree2.BST object at 0x7f1b3594e800>

>   ???
E   NameError: name 'root' is not defined

binarySearchTree2:21: NameError
