   - [# 216] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   21:         elif self.root == None:
   22:             self.root = Node(value)
   23:             self.size += 1
   24:         else:
-  25:             self.__add(self.root, value)
+  25:             __add(self.root, value)
   26:     
   27:     def __add(self, root, value):
   28:         if value < root.value:
   29:             if root.left == None:
--------------------------------------------------------------------------------
[0.07836 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
>       var_1 = b_s_t_0.add(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35c2abc0>, value = '[]'

>   ???
E   NameError: name '_BST__add' is not defined

binarySearchTree2:25: NameError

   - [# 217] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   21:         elif self.root == None:
   22:             self.root = Node(value)
   23:             self.size += 1
   24:         else:
-  25:             self.__add(self.root, value)
+  25:             self.__add(root, value)
   26:     
   27:     def __add(self, root, value):
   28:         if value < root.value:
   29:             if root.left == None:
--------------------------------------------------------------------------------
[0.07924 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
>       var_1 = b_s_t_0.add(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b358601f0>, value = '[]'

>   ???
E   NameError: name 'root' is not defined

binarySearchTree2:25: NameError

   - [# 219] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   29:             if root.left == None:
   30:                 root.left = Node(value)
   31:                 self.size += 1
   32:             else:
-  33:                 self.__add(root.left, value)
+  33:                 __add(root.left, value)
   34:         elif value >= root.value:
   35:             if root.right == None:
   36:                 root.right = Node(value)
   37:                 self.size += 1
--------------------------------------------------------------------------------
[0.10920 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_15

def test_case_15():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        bool_0 = False
        var_0 = b_s_t_0.add(bool_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.__str__()
        assert var_1 == '[False]'
>       none_type_0 = b_s_t_0.build(var_1)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:169: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:138: in __build
    ???
binarySearchTree2:136: in __build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35699b70>
root = <binarySearchTree2.Node object at 0x7f1b35699ff0>, value = '['

>   ???
E   NameError: name '_BST__add' is not defined

binarySearchTree2:33: NameError

   - [# 221] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   35:             if root.right == None:
   36:                 root.right = Node(value)
   37:                 self.size += 1
   38:             else:
-  39:                 self.__add(root.right, value)
+  39:                 __add(root.right, value)
   40:     
   41:     def contains(self, value):
   42:         
   43:         return self.__contains(self.root, value)
--------------------------------------------------------------------------------
[0.07960 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
>       var_1 = b_s_t_0.add(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:25: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b358a6830>
root = <binarySearchTree2.Node object at 0x7f1b358a5ea0>, value = '[]'

>   ???
E   NameError: name '_BST__add' is not defined

binarySearchTree2:39: NameError

   - [# 222] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   39:                 self.__add(root.right, value)
   40:     
   41:     def contains(self, value):
   42:         
-  43:         return self.__contains(self.root, value)
+  43:         return __contains(self.root, value)
   44:     
   45:     def __contains(self, root, value):
   46:         if root == None:
   47:             return False
--------------------------------------------------------------------------------
[0.07805 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b358bc7c0>
value = <binarySearchTree2.BST object at 0x7f1b358bc7c0>

>   ???
E   NameError: name '_BST__contains' is not defined

binarySearchTree2:43: NameError

   - [# 223] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   39:                 self.__add(root.right, value)
   40:     
   41:     def contains(self, value):
   42:         
-  43:         return self.__contains(self.root, value)
+  43:         return self.__contains(root, value)
   44:     
   45:     def __contains(self, root, value):
   46:         if root == None:
   47:             return False
--------------------------------------------------------------------------------
[0.07813 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_1

def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.add(b_s_t_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b358be260>
value = <binarySearchTree2.BST object at 0x7f1b358be260>

>   ???
E   NameError: name 'root' is not defined

binarySearchTree2:43: NameError

   - [# 224] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   48:         elif root.value == value:
   49:             return True
   50:         
   51:         elif value < root.value:
-  52:             return self.__contains(root.left, value)
+  52:             return __contains(root.left, value)
   53:         else:
   54:             return self.__contains(root.right, value)
   55:     
   56:     def minValueNode(self, node):
--------------------------------------------------------------------------------
[0.10542 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
>       var_1 = b_s_t_0.add(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
binarySearchTree2:43: in contains
    ???
binarySearchTree2:54: in __contains
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b352b69e0>
root = <binarySearchTree2.Node object at 0x7f1b352b4f10>, value = '[]'

>   ???
E   NameError: name '_BST__contains' is not defined

binarySearchTree2:52: NameError

   - [# 225] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   50:         
   51:         elif value < root.value:
   52:             return self.__contains(root.left, value)
   53:         else:
-  54:             return self.__contains(root.right, value)
+  54:             return __contains(root.right, value)
   55:     
   56:     def minValueNode(self, node):
   57:         current = node
   58:         
--------------------------------------------------------------------------------
[0.08009 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
>       var_1 = b_s_t_0.add(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:19: in add
    ???
binarySearchTree2:43: in contains
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b352b42e0>
root = <binarySearchTree2.Node object at 0x7f1b352b4460>, value = '[]'

>   ???
E   NameError: name '_BST__contains' is not defined

binarySearchTree2:54: NameError

   - [# 226] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   62:         return current
   63:     
   64:     def remove(self, value):
   65:         
-  66:         if self.contains(value):
+  66:         if contains(value):
   67:             if self.size == 1:
   68:                 self.root = None
   69:                 self.size -= 1
   70:             else:
--------------------------------------------------------------------------------
[0.07990 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b353d7f70>, value = '[]'

>   ???
E   NameError: name 'contains' is not defined

binarySearchTree2:66: NameError

   - [# 227] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   63:     
   64:     def remove(self, value):
   65:         
   66:         if self.contains(value):
-  67:             if self.size == 1:
+  67:             if size == 1:
   68:                 self.root = None
   69:                 self.size -= 1
   70:             else:
   71:                 
--------------------------------------------------------------------------------
[0.07967 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b359c14e0>, value = '[]'

>   ???
E   NameError: name 'size' is not defined

binarySearchTree2:67: NameError

   - [# 230] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   68:                 self.root = None
   69:                 self.size -= 1
   70:             else:
   71:                 
-  72:                 self.__remove(self.root, value)
+  72:                 __remove(self.root, value)
   73:                 self.size -= 1
   74:         else:
   75:             pass
   76:     
--------------------------------------------------------------------------------
[0.07872 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35954e50>, value = '[]'

>   ???
E   NameError: name '_BST__remove' is not defined

binarySearchTree2:72: NameError

   - [# 231] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   68:                 self.root = None
   69:                 self.size -= 1
   70:             else:
   71:                 
-  72:                 self.__remove(self.root, value)
+  72:                 self.__remove(root, value)
   73:                 self.size -= 1
   74:         else:
   75:             pass
   76:     
--------------------------------------------------------------------------------
[0.07880 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b353d4b50>, value = '[]'

>   ???
E   NameError: name 'root' is not defined

binarySearchTree2:72: NameError

   - [# 233] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   86:         if root is None:
   87:             return root
   88:         
   89:         if value < root.value:
-  90:             root.left = self.__remove(root.left, value)
+  90:             root.left = __remove(root.left, value)
   91:         
   92:         elif value > root.value:
   93:             root.right = self.__remove(root.right, value)
   94:         else:
--------------------------------------------------------------------------------
[0.07864 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:72: in remove
    ???
binarySearchTree2:93: in __remove
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b359e8a90>
root = <binarySearchTree2.Node object at 0x7f1b359e85b0>, value = '[]'

>   ???
E   NameError: name '_BST__remove' is not defined

binarySearchTree2:90: NameError

   - [# 234] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
   89:         if value < root.value:
   90:             root.left = self.__remove(root.left, value)
   91:         
   92:         elif value > root.value:
-  93:             root.right = self.__remove(root.right, value)
+  93:             root.right = __remove(root.right, value)
   94:         else:
   95:             
   96:             
   97:             if root.left is None:
--------------------------------------------------------------------------------
[0.07939 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_4

def test_case_4():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        none_type_0 = b_s_t_0.build(var_0)
        assert len(b_s_t_0) == 2
        var_1 = b_s_t_0.add(var_0)
        assert len(b_s_t_0) == 3
>       var_2 = b_s_t_0.remove(var_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:72: in remove
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b353e6b90>
root = <binarySearchTree2.Node object at 0x7f1b353e6c80>, value = '[]'

>   ???
E   NameError: name '_BST__remove' is not defined

binarySearchTree2:93: NameError

   - [# 235] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  107:             temp = minValueNode(root.right)
  108:             
  109:             root.value = temp.value
  110:             
- 111:             root.right = self.__remove(root.right, temp.value)
+ 111:             root.right = __remove(root.right, temp.value)
  112:         
  113:         return root
  114:     
  115:     def isValid(self):
--------------------------------------------------------------------------------
[0.08026 s] survived

   - [# 237] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  116:         pass
  117:     
  118:     def build(self, array: list) -> None:
  119:         
- 120:         self.root = self.__build(array, None, 0, len(array) - 1)
+ 120:         self.root = __build(array, None, 0, len(array) - 1)
  121:     
  122:     def __build(self, array: list, root, left: int, right: int):
  123:         
  124:         if left > right:
--------------------------------------------------------------------------------
[0.07835 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b359c1a50>
array = [<binarySearchTree2.BST object at 0x7f1b359c1a50>]

>   ???
E   NameError: name '_BST__build' is not defined

binarySearchTree2:120: NameError

   - [# 239] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  132:             self.size += 1
  133:         else:
  134:             
  135:             
- 136:             self.__add(root, array[mid])
+ 136:             __add(root, array[mid])
  137:         
  138:         self.__build(array, root, left, mid - 1)
  139:         self.__build(array, root, mid + 1, right)
  140:         
--------------------------------------------------------------------------------
[0.08073 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_3

def test_case_3():
        bool_0 = True
        list_0 = [bool_0, bool_0]
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
binarySearchTree2:139: in __build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35396c80>, array = [True, True]
root = <binarySearchTree2.Node object at 0x7f1b35396980>, left = 1, right = 1

>   ???
E   NameError: name '_BST__add' is not defined

binarySearchTree2:136: NameError

   - [# 240] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  134:             
  135:             
  136:             self.__add(root, array[mid])
  137:         
- 138:         self.__build(array, root, left, mid - 1)
+ 138:         __build(array, root, left, mid - 1)
  139:         self.__build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
--------------------------------------------------------------------------------
[0.07773 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b353ebac0>
array = [<binarySearchTree2.BST object at 0x7f1b353ebac0>]
root = <binarySearchTree2.Node object at 0x7f1b353eb4f0>, left = 0, right = 0

>   ???
E   NameError: name '_BST__build' is not defined

binarySearchTree2:138: NameError

   - [# 241] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  135:             
  136:             self.__add(root, array[mid])
  137:         
  138:         self.__build(array, root, left, mid - 1)
- 139:         self.__build(array, root, mid + 1, right)
+ 139:         __build(array, root, mid + 1, right)
  140:         
  141:         return root
  142:     
  143:     def getOrder(self, order='inOrder'):
--------------------------------------------------------------------------------
[0.07826 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.__str__()
        assert var_0 == '[]'
        list_0 = [b_s_t_0]
>       none_type_0 = b_s_t_0.build(list_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:120: in build
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b356e3400>
array = [<binarySearchTree2.BST object at 0x7f1b356e3400>]
root = <binarySearchTree2.Node object at 0x7f1b356e1e10>, left = 0, right = 0

>   ???
E   NameError: name '_BST__build' is not defined

binarySearchTree2:139: NameError

   - [# 242] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  160:                 traversal.append(root.value)
  161:         
  162:         traversal = []
  163:         if order == 'inOrder':
- 164:             inOrder(self.root)
+ 164:             inOrder(root)
  165:             return traversal
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
--------------------------------------------------------------------------------
[0.07834 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.__str__()

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree2:183: in __str__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35c28520>, order = 'inOrder'

>   ???
E   NameError: name 'root' is not defined

binarySearchTree2:164: NameError

   - [# 243] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  163:         if order == 'inOrder':
  164:             inOrder(self.root)
  165:             return traversal
  166:         elif order == 'preOrder':
- 167:             preOrder(self.root)
+ 167:             preOrder(root)
  168:             return traversal
  169:         elif order == 'postOrder':
  170:             postOrder(self.root)
  171:             return traversal
--------------------------------------------------------------------------------
[0.09433 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py::test_case_13

def test_case_13():
        str_0 = 'preOrder'
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.getOrder(str_0)

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_DYNAMOSA.py:154: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b35624460>, order = 'preOrder'

>   ???
E   NameError: name 'root' is not defined

binarySearchTree2:167: NameError

   - [# 244] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  166:         elif order == 'preOrder':
  167:             preOrder(self.root)
  168:             return traversal
  169:         elif order == 'postOrder':
- 170:             postOrder(self.root)
+ 170:             postOrder(root)
  171:             return traversal
  172:     
  173:     def __len__(self):
  174:         return self.size
--------------------------------------------------------------------------------
[0.08112 s] survived

   - [# 246] SVD binarySearchTree2: 
--------------------------------------------------------------------------------
  179:         Returns:
  180:             String: String inorder representaion of BST.
  181:         '''
  182:         
- 183:         return str(self.getOrder())
+ 183:         return str(getOrder())
  184: 
  185: 
  186: if __name__ == '__main__':
  187:     
--------------------------------------------------------------------------------
[0.07818 s] killed by DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py::test_case_2

def test_case_2():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
>       var_0 = b_s_t_0.__str__()

DYNAMOSA-MIO-MOSA/test_binarySearchTree2_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree2.BST object at 0x7f1b353a12a0>

>   ???
E   NameError: name 'getOrder' is not defined

binarySearchTree2:183: NameError

   - [# 247] ZIL binarySearchTree2: 
--------------------------------------------------------------------------------
   56:     def minValueNode(self, node):
   57:         current = node
   58:         
   59:         while current.left is not None:
-  60:             current = current.left
+  60:             break
   61:         
   62:         return current
   63:     
   64:     def remove(self, value):
--------------------------------------------------------------------------------
[0.08042 s] survived
