   - [#  13] CDI binarySearchTree2: 
--------------------------------------------------------------------------------
    4: 
    5: T = TypeVar('T')
    6: 
    7: class Node:
-   8:     def __init__(self, value: T):
-   9:         self.value = value
-  10:         self.left = None
-  11:         self.right = None
-  12: 
+   8:     @classmethod
+   9:     def __init__(self, value: T):
+  10:         self.value = value
+  11:         self.left = None
+  12:         self.right = None
   13: class BST:
   14:     def __init__(self):
   15:         self.root = None
   16:         self.size = 0
--------------------------------------------------------------------------------
[0.08217 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py::test_case_4

def test_case_4():
        none_type_0 = None
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        bool_0 = False
        b_s_t_1 = module_0.BST()
        assert len(b_s_t_1) == 0
        var_0 = b_s_t_1.add(bool_0)
        assert len(b_s_t_1) == 1
        var_1 = b_s_t_1.contains(bool_0)
        assert var_1 is True
        var_2 = b_s_t_1.add(var_1)
        assert len(b_s_t_1) == 2
        var_3 = var_1.__str__()
        assert var_3 == 'True'
        var_4 = b_s_t_1.remove(bool_0)
>       assert len(b_s_t_1) == 1
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py:60: AssertionError

   - [# 142] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   39:                 self.__add(root.right, value)
   40:     
   41:     def contains(self, value):
   42:         
-  43:         return self.__contains(self.root, value)
+  43:         pass
   44:     
   45:     def __contains(self, root, value):
   46:         if root == None:
   47:             return False
--------------------------------------------------------------------------------
[0.08061 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.remove(b_s_t_0)
>       assert len(b_s_t_0) == 0
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py:11: AssertionError

   - [# 144] SDL binarySearchTree2: 
--------------------------------------------------------------------------------
   45:     def __contains(self, root, value):
   46:         if root == None:
   47:             return False
   48:         elif root.value == value:
-  49:             return True
+  49:             pass
   50:         
   51:         elif value < root.value:
   52:             return self.__contains(root.left, value)
   53:         else:
--------------------------------------------------------------------------------
[0.07545 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.remove(b_s_t_0)
>       assert len(b_s_t_0) == 0
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py:11: AssertionError
