   - [#   1] AOR binarySearchTree3: 
--------------------------------------------------------------------------------
  302:         
  303:         leftbranch = 0 if not (tree.left) else tree.left.height
  304:         rightbranch = 0 if not (tree.right) else tree.right.height
  305:         
- 306:         return leftbranch - rightbranch
+ 306:         return leftbranch + rightbranch
  307:     
  308:     def pre_order(self, node='root'):
  309:         '''Depth first pre-order traversal of tree.'''
  310:         if node == 'root':
--------------------------------------------------------------------------------
[0.10809 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#   7] ASR binarySearchTree3: 
--------------------------------------------------------------------------------
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
  239:         if not (self.root):
  240:             self.root = Node(val)
- 241:             self._size += 1
+ 241:             self._size -= 1
  242:         else:
  243:             self._step(val, self.root)
  244:     
  245:     def _step(self, val, curr):
--------------------------------------------------------------------------------
[0.11095 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.delete(bst_0)
>       assert bst_0.root is None
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:177: AssertionError

   - [#   8] ASR binarySearchTree3: 
--------------------------------------------------------------------------------
  255:         child = getattr(curr, side)
  256:         if child:
  257:             count = self._step(val, child)
  258:             if curr.height <= count:
- 259:                 curr.height += 1
+ 259:                 curr.height -= 1
  260:         else:
  261:             setattr(curr, side, Node(val, curr))
  262:             self._size += 1
  263:             if curr.height == 1:
--------------------------------------------------------------------------------
[0.10842 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#   9] ASR binarySearchTree3: 
--------------------------------------------------------------------------------
  258:             if curr.height <= count:
  259:                 curr.height += 1
  260:         else:
  261:             setattr(curr, side, Node(val, curr))
- 262:             self._size += 1
+ 262:             self._size -= 1
  263:             if curr.height == 1:
  264:                 curr.height += 1
  265:         return curr
  266:     
--------------------------------------------------------------------------------
[0.15654 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [#  10] ASR binarySearchTree3: 
--------------------------------------------------------------------------------
  260:         else:
  261:             setattr(curr, side, Node(val, curr))
  262:             self._size += 1
  263:             if curr.height == 1:
- 264:                 curr.height += 1
+ 264:                 curr.height -= 1
  265:         return curr
  266:     
  267:     def search(self, val):
  268:         '''Return the node containing val.'''
--------------------------------------------------------------------------------
[0.13062 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py::test_case_6

def test_case_6():
        bytes_0 = b'\xd0\x08\x1b$\xda'
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.in_order()
        var_1 = bst_0.depth()
>       assert var_1 == 4
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py:81: AssertionError

   - [#  11] ASR binarySearchTree3: 
--------------------------------------------------------------------------------
  374:                 self.root = None
  375:         
  376:         elif node._is_interior():
  377:             next_node = self._find_replacement(node)
- 378:             self._size += 1
+ 378:             self._size -= 1
  379:             self.delete(next_node.val)
  380:             node.val = next_node.val
  381:         else:
  382:             
--------------------------------------------------------------------------------
[0.18296 s] survived

   - [#  12] ASR binarySearchTree3: 
--------------------------------------------------------------------------------
  386:                 setattr(node.parent, node._side(), child)
  387:             else:
  388:                 self.root = child
  389:         
- 390:         self._size -= 1
+ 390:         self._size += 1
  391:     
  392:     def _find_replacement(self, node):
  393:         '''Find left most node of right subtree.'''
  394:         if node.right:
--------------------------------------------------------------------------------
[0.17351 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [#  17] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
   37:         except TypeError:
   38:             if data:
   39:                 self.push(data)
   40:     
-  41:     def push(self, val):
-  42:         '''Add val to the head of the list.'''
-  43:         old_head = self.head
-  44:         self.head = NodeDLL(val, next_node=old_head)
-  45:         if old_head:
-  46:             old_head.prev = self.head
-  47:         if not (self.tail):
-  48:             self.tail = self.head
-  49:         self._length += 1
-  50:     
+  41:     @classmethod
+  42:     def push(self, val):
+  43:         '''Add val to the head of the list.'''
+  44:         old_head = self.head
+  45:         self.head = NodeDLL(val, next_node=old_head)
+  46:         if old_head:
+  47:             old_head.prev = self.head
+  48:         if not (self.tail):
+  49:             self.tail = self.head
+  50:         self._length += 1
   51:     def pop(self):
   52:         '''Remove the val from the head of the list.'''
   53:         to_return = self.head
   54:         if self._length < 1:
--------------------------------------------------------------------------------
[0.09929 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       double_linked_list_0 = module_0.DoubleLi

   - [#  19] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
   62:         if self._length < 1:
   63:             self.tail = None
   64:         return to_return.data
   65:     
-  66:     def append(self, val):
-  67:         '''Add val to the tail of the list.'''
-  68:         old_tail = self.tail
-  69:         self.tail = NodeDLL(val, prev=old_tail)
-  70:         if old_tail:
-  71:             old_tail.next = self.tail
-  72:         if self._length < 1:
-  73:             self.head = self.tail
-  74:         self._length += 1
-  75:     
+  66:     @classmethod
+  67:     def append(self, val):
+  68:         '''Add val to the tail of the list.'''
+  69:         old_tail = self.tail
+  70:         self.tail = NodeDLL(val, prev=old_tail)
+  71:         if old_tail:
+  72:             old_tail.next = self.tail
+  73:         if self._length < 1:
+  74:             self.head = self.tail
+  75:         self._length += 1
   76:     def shift(self):
   77:         '''Remove the val from the tail of the list.'''
   78:         to_return = self.tail
   79:         if self._length < 1:
--------------------------------------------------------------------------------
[0.09921 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       double_linked_list_0 = module_0.D

   - [#  21] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
   87:         if self._length < 1:
   88:             self.tail = None
   89:         return to_return.data
   90:     
-  91:     def remove(self, val):
-  92:         '''Remove first occurance of val from list.'''
-  93:         curr = self.head
-  94:         while curr:
-  95:             if curr.data is val:
-  96:                 if self._length == 1:
-  97:                     (self.head, self.tail) = (None, None)
-  98:                 elif (curr is not self.head and curr is not self.tail):
-  99:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
- 100:                 elif curr is self.head:
- 101:                     (self.head, curr.next.prev) = (curr.next, None)
- 102:                 elif curr is self.tail:
- 103:                     (self.tail, curr.prev.next) = (curr.prev, None)
- 104:                 self._length -= 1
- 105:                 return
- 106:             curr = curr.next
- 107:         
- 108:         raise ValueError('{} is not in the list'.format(val))
- 109:     
+  91:     @classmethod
+  92:     def remove(self, val):
+  93:         '''Remove first occurance of val from list.'''
+  94:         curr = self.head
+  95:         while curr:
+  96:             if curr.data is val:
+  97:                 if self._length == 1:
+  98:                     (self.head, self.tail) = (None, None)
+  99:                 elif (curr is not self.head and curr is not self.tail):
+ 100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
+ 101:                 elif curr is self.head:
+ 102:                     (self.head, curr.next.prev) = (curr.next, None)
+ 103:                 elif c

   - [#  27] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  148:             return self._container.head.data
  149:         except AttributeError:
  150:             return None
  151:     
- 152:     def size(self):
- 153:         '''Return the size of the queue.'''
- 154:         return self._container._length
- 155: 
+ 152:     @classmethod
+ 153:     def size(self):
+ 154:         '''Return the size of the queue.'''
+ 155:         return self._container._length
  156: class Node(object):
  157:     '''Node, or leaf of the BST.'''
  158:     
  159:     def __init__(self, val=None, parent=None):
--------------------------------------------------------------------------------
[0.11465 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_26

def test_case_26():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
>       var_0 = queue_0.size()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:297: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree3.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_container'

binarySearchTree3:155: AttributeError

   - [#  28] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  155: 
  156: class Node(object):
  157:     '''Node, or leaf of the BST.'''
  158:     
- 159:     def __init__(self, val=None, parent=None):
- 160:         '''Create node object.'''
- 161:         self.val = val
- 162:         self.right = None
- 163:         self.left = None
- 164:         self.parent = parent
- 165:         self.height = 1
- 166:     
+ 159:     @classmethod
+ 160:     def __init__(self, val=None, parent=None):
+ 161:         '''Create node object.'''
+ 162:         self.val = val
+ 163:         self.right = None
+ 164:         self.left = None
+ 165:         self.parent = parent
+ 166:         self.height = 1
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
  169:         return not ((self.right or self.left))
  170:     
--------------------------------------------------------------------------------
[0.10970 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#  29] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  163:         self.left = None
  164:         self.parent = parent
  165:         self.height = 1
  166:     
- 167:     def _is_leaf(self):
- 168:         '''Return true if a leaf.'''
- 169:         return not ((self.right or self.left))
- 170:     
+ 167:     @classmethod
+ 168:     def _is_leaf(self):
+ 169:         '''Return true if a leaf.'''
+ 170:         return not ((self.right or self.left))
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
  173:         return (self.right and self.left)
  174:     
--------------------------------------------------------------------------------
[0.13847 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_1 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:370: in delete
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree3.Node'>

>   ???
E   AttributeError: type object 'Node' has no attribute 'right'

binarySearchTree3:170: AttributeError

   - [#  30] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
  169:         return not ((self.right or self.left))
  170:     
- 171:     def _is_interior(self):
- 172:         '''Return true if a interior node.'''
- 173:         return (self.right and self.left)
- 174:     
+ 171:     @classmethod
+ 172:     def _is_interior(self):
+ 173:         '''Return true if a interior node.'''
+ 174:         return (self.right and self.left)
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
--------------------------------------------------------------------------------
[0.15454 s] survived

   - [#  31] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
  173:         return (self.right and self.left)
  174:     
- 175:     def _onlychild(self):
- 176:         '''Return string depending on children.'''
- 177:         if (self.left and not (self.right)):
- 178:             return 'left'
- 179:         if (self.right and not (self.left)):
- 180:             return 'right'
- 181:     
+ 175:     @classmethod
+ 176:     def _onlychild(self):
+ 177:         '''Return string depending on children.'''
+ 178:         if (self.left and not (self.right)):
+ 179:             return 'left'
+ 180:         if (self.right and not (self.left)):
+ 181:             return 'right'
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
  185:             return 'left' if self.parent.left == self else 'right'
--------------------------------------------------------------------------------
[0.15312 s] survived

   - [#  32] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  178:             return 'left'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
- 182:     def _side(self):
- 183:         '''Return if left or right child of parent.'''
- 184:         if self.parent:
- 185:             return 'left' if self.parent.left == self else 'right'
- 186: 
+ 182:     @classmethod
+ 183:     def _side(self):
+ 184:         '''Return if left or right child of parent.'''
+ 185:         if self.parent:
+ 186:             return 'left' if self.parent.left == self else 'right'
  187: 
  188: class Bst(object):
  189:     '''Binary Search Tree.
  190: 
--------------------------------------------------------------------------------
[0.15643 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_27

def test_case_27():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
>       var_1 = bst_0.delete(str_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:286: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:372: in delete
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree3.Node'>

>   ???
E   AttributeError: type object 'Node' has no attribute 'parent'

binarySearchTree3:185: AttributeError

   - [#  34] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  233:         if data:
  234:             for i in data:
  235:                 self.insert(i)
  236:     
- 237:     def insert(self, val):
- 238:         '''Insert val into BST. If val is already present will be ignored.'''
- 239:         if not (self.root):
- 240:             self.root = Node(val)
- 241:             self._size += 1
- 242:         else:
- 243:             self._step(val, self.root)
- 244:     
+ 237:     @classmethod
+ 238:     def insert(self, val):
+ 239:         '''Insert val into BST. If val is already present will be ignored.'''
+ 240:         if not (self.root):
+ 241:             self.root = Node(val)
+ 242:             self._size += 1
+ 243:         else:
+ 244:             self._step(val, self.root)
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
  248:             curr = self._set_child(curr, 'left', val)
--------------------------------------------------------------------------------
[0.09875 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
>       var_2 = bst_0.insert(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree3.Bst'>, val = 0

>   ???
E   AttributeError: type object 'Bst' has no attribute

   - [#  36] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  249:         elif val > curr.val:
  250:             curr = self._set_child(curr, 'right', val)
  251:         return curr.height
  252:     
- 253:     def _set_child(self, curr, side, val):
- 254:         '''Helping.'''
- 255:         child = getattr(curr, side)
- 256:         if child:
- 257:             count = self._step(val, child)
- 258:             if curr.height <= count:
- 259:                 curr.height += 1
- 260:         else:
- 261:             setattr(curr, side, Node(val, curr))
- 262:             self._size += 1
- 263:             if curr.height == 1:
- 264:                 curr.height += 1
- 265:         return curr
- 266:     
+ 253:     @classmethod
+ 254:     def _set_child(self, curr, side, val):
+ 255:         '''Helping.'''
+ 256:         child = getattr(curr, side)
+ 257:         if child:
+ 258:             count = self._step(val, child)
+ 259:             if curr.height <= count:
+ 260:                 curr.height += 1
+ 261:         else:
+ 262:             setattr(curr, side, Node(val, curr))
+ 263:             self._size += 1
+ 264:             if curr.height == 1:
+ 265:                 curr.height += 1
+ 266:         return curr
  267:     def search(self, val):
  268:         '''Return the node containing val.'''
  269:         curr = self.root
  270:         while curr:
--------------------------------------------------------------------------------
[0.10883 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

   - [#  37] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  263:             if curr.height == 1:
  264:                 curr.height += 1
  265:         return curr
  266:     
- 267:     def search(self, val):
- 268:         '''Return the node containing val.'''
- 269:         curr = self.root
- 270:         while curr:
- 271:             if curr.val == val:
- 272:                 return curr
- 273:             elif val < curr.val:
- 274:                 curr = curr.left
- 275:             else:
- 276:                 curr = curr.right
- 277:     
+ 267:     @classmethod
+ 268:     def search(self, val):
+ 269:         '''Return the node containing val.'''
+ 270:         curr = self.root
+ 271:         while curr:
+ 272:             if curr.val == val:
+ 273:                 return curr
+ 274:             elif val < curr.val:
+ 275:                 curr = curr.left
+ 276:             else:
+ 277:                 curr = curr.right
  278:     def size(self):
  279:         '''Return the size of the BST.'''
  280:         return self._size
  281:     
--------------------------------------------------------------------------------
[0.13428 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_5

def test_case_5():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = do

   - [#  38] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  274:                 curr = curr.left
  275:             else:
  276:                 curr = curr.right
  277:     
- 278:     def size(self):
- 279:         '''Return the size of the BST.'''
- 280:         return self._size
- 281:     
+ 278:     @classmethod
+ 279:     def size(self):
+ 280:         '''Return the size of the BST.'''
+ 281:         return self._size
  282:     def depth(self):
  283:         '''Return depth of the BST, representing total levels.'''
  284:         return 0 if not (self.root) else self.root.height
  285:     
--------------------------------------------------------------------------------
[0.09945 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
>       var_1 = bst_0.size()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree3.Bst'>

>   ???
E   AttributeError: type object 'Bst' has no attribute '_size'. Did you mean: 'size'?

binarySearchTree3:281: AttributeError
