   - [#  39] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  278:     def size(self):
  279:         '''Return the size of the BST.'''
  280:         return self._size
  281:     
- 282:     def depth(self):
- 283:         '''Return depth of the BST, representing total levels.'''
- 284:         return 0 if not (self.root) else self.root.height
- 285:     
+ 282:     @classmethod
+ 283:     def depth(self):
+ 284:         '''Return depth of the BST, representing total levels.'''
+ 285:         return 0 if not (self.root) else self.root.height
  286:     def contains(self, val):
  287:         '''Return true if val is in the bst.'''
  288:         return self.search(val) is not None
  289:     
--------------------------------------------------------------------------------
[0.10480 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_8

def test_case_8():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
>       var_0 = bst_0.depth()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:102: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binarySearchTree3.Bst'>

>   ???
E   AttributeError: type object 'Bst' has no attribute 'root'

binarySearchTree3:285: AttributeError

   - [#  41] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  286:     def contains(self, val):
  287:         '''Return true if val is in the bst.'''
  288:         return self.search(val) is not None
  289:     
- 290:     def balance(self, tree=None):
- 291:         '''Return an integer of how well the tree is balanced.
- 292: 
- 293:         Trees which are higher on the left than the right should return a
- 294:         positive value, trees which are higher on the right than the left
- 295:         should return a negative value. An ideally-balanced tree should
- 296:         return 0.
- 297:         '''
- 298:         if not tree:
- 299:             tree = self.root
- 300:             if not tree:
- 301:                 return 0
- 302:         
- 303:         leftbranch = 0 if not (tree.left) else tree.left.height
- 304:         rightbranch = 0 if not (tree.right) else tree.right.height
- 305:         
- 306:         return leftbranch - rightbranch
- 307:     
+ 290:     @classmethod
+ 291:     def balance(self, tree=None):
+ 292:         '''Return an integer of how well the tree is balanced.
+ 293: 
+ 294:         Trees which are higher on the left than the right should return a
+ 295:         positive value, trees which are higher on the right than the left
+ 296:         should return a negative value. An ideally-balanced tree should
+ 297:         return 0.
+ 298:         '''
+ 299:         if not tree:
+ 300:             tree = self.root
+ 301:             if not tree:
+ 302:                 return 0
+ 303:         
+ 304:         leftbranch = 0 if not (tree.left) else tree.left.height
+ 305:         rightbranch = 0 if not (tree.right) else tree.right.height
+ 306:         
+ 307:         return leftb

   - [#  42] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  304:         rightbranch = 0 if not (tree.right) else tree.right.height
  305:         
  306:         return leftbranch - rightbranch
  307:     
- 308:     def pre_order(self, node='root'):
- 309:         '''Depth first pre-order traversal of tree.'''
- 310:         if node == 'root':
- 311:             node = self.root
- 312:         
- 313:         if not node:
- 314:             return
- 315:         
- 316:         yield node.val
- 317:         
- 318:         for n in self.pre_order(node=node.left):
- 319:             yield n
- 320:         for n in self.pre_order(node=node.right):
- 321:             yield n
- 322:     
+ 308:     @classmethod
+ 309:     def pre_order(self, node='root'):
+ 310:         '''Depth first pre-order traversal of tree.'''
+ 311:         if node == 'root':
+ 312:             node = self.root
+ 313:         
+ 314:         if not node:
+ 315:             return
+ 316:         
+ 317:         yield node.val
+ 318:         
+ 319:         for n in self.pre_order(node=node.left):
+ 320:             yield n
+ 321:         for n in self.pre_order(node=node.right):
+ 322:             yield n
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
  325:         if node == 'root':
  326:             node = self.root
--------------------------------------------------------------------------------
[0.13959 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_17

def test_case_17():
        bst_0 = module_0.Bst()

   - [#  43] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  319:             yield n
  320:         for n in self.pre_order(node=node.right):
  321:             yield n
  322:     
- 323:     def in_order(self, node='root'):
- 324:         '''Depth first in-order traversal of tree.'''
- 325:         if node == 'root':
- 326:             node = self.root
- 327:         
- 328:         if not node:
- 329:             return
- 330:         
- 331:         for n in self.in_order(node=node.left):
- 332:             yield n
- 333:         yield node.val
- 334:         for n in self.in_order(node=node.right):
- 335:             yield n
- 336:     
+ 323:     @classmethod
+ 324:     def in_order(self, node='root'):
+ 325:         '''Depth first in-order traversal of tree.'''
+ 326:         if node == 'root':
+ 327:             node = self.root
+ 328:         
+ 329:         if not node:
+ 330:             return
+ 331:         
+ 332:         for n in self.in_order(node=node.left):
+ 333:             yield n
+ 334:         yield node.val
+ 335:         for n in self.in_order(node=node.right):
+ 336:             yield n
  337:     def post_order(self, node='root'):
  338:         '''Depth frist post_order traversal of tree.'''
  339:         if node == 'root':
  340:             node = self.root
--------------------------------------------------------------------------------
[0.11655 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_29

def test_case_29():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None

   - [#  44] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  333:         yield node.val
  334:         for n in self.in_order(node=node.right):
  335:             yield n
  336:     
- 337:     def post_order(self, node='root'):
- 338:         '''Depth frist post_order traversal of tree.'''
- 339:         if node == 'root':
- 340:             node = self.root
- 341:         
- 342:         if not node:
- 343:             return
- 344:         
- 345:         for n in self.post_order(node=node.left):
- 346:             yield n
- 347:         for n in self.post_order(node=node.right):
- 348:             yield n
- 349:         yield node.val
- 350:     
+ 337:     @classmethod
+ 338:     def post_order(self, node='root'):
+ 339:         '''Depth frist post_order traversal of tree.'''
+ 340:         if node == 'root':
+ 341:             node = self.root
+ 342:         
+ 343:         if not node:
+ 344:             return
+ 345:         
+ 346:         for n in self.post_order(node=node.left):
+ 347:             yield n
+ 348:         for n in self.post_order(node=node.right):
+ 349:             yield n
+ 350:         yield node.val
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
  353:         q = Queue()
  354:         q.enqueue(self.root)
--------------------------------------------------------------------------------
[0.11283 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_20

def test_case_20():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None

   - [#  45] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  347:         for n in self.post_order(node=node.right):
  348:             yield n
  349:         yield node.val
  350:     
- 351:     def breadth_first(self):
- 352:         '''Breadth first traversal of tree.'''
- 353:         q = Queue()
- 354:         q.enqueue(self.root)
- 355:         while q.peek():
- 356:             node = q.dequeue()
- 357:             yield node.val
- 358:             if node.left:
- 359:                 q.enqueue(node.left)
- 360:             if node.right:
- 361:                 q.enqueue(node.right)
- 362:     
+ 351:     @classmethod
+ 352:     def breadth_first(self):
+ 353:         '''Breadth first traversal of tree.'''
+ 354:         q = Queue()
+ 355:         q.enqueue(self.root)
+ 356:         while q.peek():
+ 357:             node = q.dequeue()
+ 358:             yield node.val
+ 359:             if node.left:
+ 360:                 q.enqueue(node.left)
+ 361:             if node.right:
+ 362:                 q.enqueue(node.right)
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
  365:         if (self._size < 1 or not (self.contains(val))):
  366:             return
--------------------------------------------------------------------------------
[0.09918 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)

   - [#  46] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  359:                 q.enqueue(node.left)
  360:             if node.right:
  361:                 q.enqueue(node.right)
  362:     
- 363:     def delete(self, val):
- 364:         '''Remove a node from the tree.'''
- 365:         if (self._size < 1 or not (self.contains(val))):
- 366:             return
- 367:         
- 368:         node = self.search(val)
- 369:         
- 370:         if node._is_leaf():
- 371:             if node.parent:
- 372:                 setattr(node.parent, node._side(), None)
- 373:             else:
- 374:                 self.root = None
- 375:         
- 376:         elif node._is_interior():
- 377:             next_node = self._find_replacement(node)
- 378:             self._size += 1
- 379:             self.delete(next_node.val)
- 380:             node.val = next_node.val
- 381:         else:
- 382:             
- 383:             child = getattr(node, node._onlychild())
- 384:             if node.parent:
- 385:                 child.parent = node.parent
- 386:                 setattr(node.parent, node._side(), child)
- 387:             else:
- 388:                 self.root = child
- 389:         
- 390:         self._size -= 1
- 391:     
+ 363:     @classmethod
+ 364:     def delete(self, val):
+ 365:         '''Remove a node from the tree.'''
+ 366:         if (self._size < 1 or not (self.contains(val))):
+ 367:             return
+ 368:         
+ 369:         node = self.search(val)
+ 370:         
+ 371:         if node._is_leaf():
+ 372:             if node.parent:

   - [#  47] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  388:                 self.root = child
  389:         
  390:         self._size -= 1
  391:     
- 392:     def _find_replacement(self, node):
- 393:         '''Find left most node of right subtree.'''
- 394:         if node.right:
- 395:             return self._findmin(node.right)
- 396:         
- 397:         elif node.parent:
- 398:             if node._side() == 'left':
- 399:                 return self.parent
- 400:             else:
- 401:                 node.parent.right = None
- 402:                 tmp = self._find_replacement(node.parent)
- 403:                 node.parent.right = node
- 404:                 return tmp
- 405:     
+ 392:     @classmethod
+ 393:     def _find_replacement(self, node):
+ 394:         '''Find left most node of right subtree.'''
+ 395:         if node.right:
+ 396:             return self._findmin(node.right)
+ 397:         
+ 398:         elif node.parent:
+ 399:             if node._side() == 'left':
+ 400:                 return self.parent
+ 401:             else:
+ 402:                 node.parent.right = None
+ 403:                 tmp = self._find_replacement(node.parent)
+ 404:                 node.parent.right = node
+ 405:                 return tmp
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
  408:         while node.left:
  409:             node = node.left
--------------------------------------------------------------------------------
[0.15477 s] survived

   - [#  48] CDI binarySearchTree3: 
--------------------------------------------------------------------------------
  402:                 tmp = self._find_replacement(node.parent)
  403:                 node.parent.right = node
  404:                 return tmp
  405:     
- 406:     def _findmin(self, node):
- 407:         '''Find min of subtree, Min is always left most node.'''
- 408:         while node.left:
- 409:             node = node.left
- 410:         return node
+ 406:     @classmethod
+ 407:     def _findmin(self, node):
+ 408:         '''Find min of subtree, Min is always left most node.'''
+ 409:         while node.left:
+ 410:             node = node.left
+ 411:         return node
--------------------------------------------------------------------------------
[0.15327 s] survived

   - [#  51] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  173:         return (self.right and self.left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
- 177:         if (self.left and not (self.right)):
+ 177:         if (self.left and self.right):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
--------------------------------------------------------------------------------
[0.15341 s] survived

   - [#  52] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
- 179:         if (self.right and not (self.left)):
+ 179:         if (self.right and self.left):
  180:             return 'right'
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
--------------------------------------------------------------------------------
[0.15457 s] survived

   - [#  53] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  235:                 self.insert(i)
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
- 239:         if not (self.root):
+ 239:         if self.root:
  240:             self.root = Node(val)
  241:             self._size += 1
  242:         else:
  243:             self._step(val, self.root)
--------------------------------------------------------------------------------
[0.09571 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
>       var_2 = bst_0.insert(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:243: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15573520>, val = 0, curr = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'val'

binarySearchTree3:247: AttributeError

   - [#  54] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  280:         return self._size
  281:     
  282:     def depth(self):
  283:         '''Return depth of the BST, representing total levels.'''
- 284:         return 0 if not (self.root) else self.root.height
+ 284:         return 0 if self.root else self.root.height
  285:     
  286:     def contains(self, val):
  287:         '''Return true if val is in the bst.'''
  288:         return self.search(val) is not None
--------------------------------------------------------------------------------
[0.10438 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_8

def test_case_8():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
>       var_0 = bst_0.depth()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:102: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd14f7d600>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'height'

binarySearchTree3:284: AttributeError

   - [#  55] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  294:         positive value, trees which are higher on the right than the left
  295:         should return a negative value. An ideally-balanced tree should
  296:         return 0.
  297:         '''
- 298:         if not tree:
+ 298:         if tree:
  299:             tree = self.root
  300:             if not tree:
  301:                 return 0
  302:         
--------------------------------------------------------------------------------
[0.10728 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_0 = bst_0.balance()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1526fe80>, tree = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'left'

binarySearchTree3:303: AttributeError

   - [#  57] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  299:             tree = self.root
  300:             if not tree:
  301:                 return 0
  302:         
- 303:         leftbranch = 0 if not (tree.left) else tree.left.height
+ 303:         leftbranch = 0 if tree.left else tree.left.height
  304:         rightbranch = 0 if not (tree.right) else tree.right.height
  305:         
  306:         return leftbranch - rightbranch
  307:     
--------------------------------------------------------------------------------
[0.10933 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#  58] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  300:             if not tree:
  301:                 return 0
  302:         
  303:         leftbranch = 0 if not (tree.left) else tree.left.height
- 304:         rightbranch = 0 if not (tree.right) else tree.right.height
+ 304:         rightbranch = 0 if tree.right else tree.right.height
  305:         
  306:         return leftbranch - rightbranch
  307:     
  308:     def pre_order(self, node='root'):
--------------------------------------------------------------------------------
[0.13822 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#  59] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  309:         '''Depth first pre-order traversal of tree.'''
  310:         if node == 'root':
  311:             node = self.root
  312:         
- 313:         if not node:
+ 313:         if node:
  314:             return
  315:         
  316:         yield node.val
  317:         
--------------------------------------------------------------------------------
[0.14397 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_12

def test_case_12():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.size()
        assert var_0 == 0
        var_1 = bst_0.pre_order()
        var_2 = bst_0.size()
        assert var_2 == 0
>       bst_1 = module_0.Bst(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:144: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:234: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15c087f0>, node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'val'

binarySearchTree3:316: AttributeError

   - [#  62] COD binarySearchTree3: 
--------------------------------------------------------------------------------
  361:                 q.enqueue(node.right)
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
- 365:         if (self._size < 1 or not (self.contains(val))):
+ 365:         if (self._size < 1 or self.contains(val)):
  366:             return
  367:         
  368:         node = self.search(val)
  369:         
--------------------------------------------------------------------------------
[0.11044 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.delete(bst_0)
>       assert bst_0.root is None
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:177: AssertionError

   - [#  81] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  173:         return (self.right and self.left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
- 177:         if (self.left and not (self.right)):
+ 177:         if not ((self.left and not (self.right))):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
--------------------------------------------------------------------------------
[0.15484 s] survived

   - [#  82] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
- 179:         if (self.right and not (self.left)):
+ 179:         if not ((self.right and not (self.left))):
  180:             return 'right'
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
--------------------------------------------------------------------------------
[0.22115 s] survived

   - [#  85] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  235:                 self.insert(i)
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
- 239:         if not (self.root):
+ 239:         if not ((not (self.root))):
  240:             self.root = Node(val)
  241:             self._size += 1
  242:         else:
  243:             self._step(val, self.root)
--------------------------------------------------------------------------------
[0.09978 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
>       var_2 = bst_0.insert(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:243: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd151b1450>, val = 0, curr = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'val'

binarySearchTree3:247: AttributeError

   - [#  86] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  243:             self._step(val, self.root)
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
- 247:         if val < curr.val:
+ 247:         if not (val < curr.val):
  248:             curr = self._set_child(curr, 'left', val)
  249:         elif val > curr.val:
  250:             curr = self._set_child(curr, 'right', val)
  251:         return curr.height
--------------------------------------------------------------------------------
[0.10973 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#  87] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
  248:             curr = self._set_child(curr, 'left', val)
- 249:         elif val > curr.val:
+ 249:         elif not (val > curr.val):
  250:             curr = self._set_child(curr, 'right', val)
  251:         return curr.height
  252:     
  253:     def _set_child(self, curr, side, val):
--------------------------------------------------------------------------------
[0.14158 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError
