   - [#  89] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  254:         '''Helping.'''
  255:         child = getattr(curr, side)
  256:         if child:
  257:             count = self._step(val, child)
- 258:             if curr.height <= count:
+ 258:             if not (curr.height <= count):
  259:                 curr.height += 1
  260:         else:
  261:             setattr(curr, side, Node(val, curr))
  262:             self._size += 1
--------------------------------------------------------------------------------
[0.10906 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#  90] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  259:                 curr.height += 1
  260:         else:
  261:             setattr(curr, side, Node(val, curr))
  262:             self._size += 1
- 263:             if curr.height == 1:
+ 263:             if not (curr.height == 1):
  264:                 curr.height += 1
  265:         return curr
  266:     
  267:     def search(self, val):
--------------------------------------------------------------------------------
[0.15055 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py::test_case_6

def test_case_6():
        bytes_0 = b'\xd0\x08\x1b$\xda'
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.in_order()
        var_1 = bst_0.depth()
        assert var_1 == 4
        var_2 = bst_0.balance()
>       assert var_2 == 2
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py:83: AssertionError

   - [#  93] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  269:         curr = self.root
  270:         while curr:
  271:             if curr.val == val:
  272:                 return curr
- 273:             elif val < curr.val:
+ 273:             elif not (val < curr.val):
  274:                 curr = curr.left
  275:             else:
  276:                 curr = curr.right
  277:     
--------------------------------------------------------------------------------
[0.15699 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [#  94] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  294:         positive value, trees which are higher on the right than the left
  295:         should return a negative value. An ideally-balanced tree should
  296:         return 0.
  297:         '''
- 298:         if not tree:
+ 298:         if not ((not tree)):
  299:             tree = self.root
  300:             if not tree:
  301:                 return 0
  302:         
--------------------------------------------------------------------------------
[0.10778 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_0 = bst_0.balance()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd14f11f00>, tree = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'left'

binarySearchTree3:303: AttributeError

   - [#  95] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  296:         return 0.
  297:         '''
  298:         if not tree:
  299:             tree = self.root
- 300:             if not tree:
+ 300:             if not ((not tree)):
  301:                 return 0
  302:         
  303:         leftbranch = 0 if not (tree.left) else tree.left.height
  304:         rightbranch = 0 if not (tree.right) else tree.right.height
--------------------------------------------------------------------------------
[0.13745 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [#  96] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  306:         return leftbranch - rightbranch
  307:     
  308:     def pre_order(self, node='root'):
  309:         '''Depth first pre-order traversal of tree.'''
- 310:         if node == 'root':
+ 310:         if not (node == 'root'):
  311:             node = self.root
  312:         
  313:         if not node:
  314:             return
--------------------------------------------------------------------------------
[0.10717 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_17

def test_case_17():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.pre_order()
>       queue_0 = module_0.Queue(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:135: in __init__
    ???
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15037970>, node = 'root'

>   ???
E   AttributeError: 'str' object has no attribute 'val'

binarySearchTree3:316: AttributeError

   - [#  97] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  309:         '''Depth first pre-order traversal of tree.'''
  310:         if node == 'root':
  311:             node = self.root
  312:         
- 313:         if not node:
+ 313:         if not ((not node)):
  314:             return
  315:         
  316:         yield node.val
  317:         
--------------------------------------------------------------------------------
[0.14149 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_12

def test_case_12():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.size()
        assert var_0 == 0
        var_1 = bst_0.pre_order()
        var_2 = bst_0.size()
        assert var_2 == 0
>       bst_1 = module_0.Bst(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:144: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:234: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1512cd60>, node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'val'

binarySearchTree3:316: AttributeError

   - [#  98] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  321:             yield n
  322:     
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
- 325:         if node == 'root':
+ 325:         if not (node == 'root'):
  326:             node = self.root
  327:         
  328:         if not node:
  329:             return
--------------------------------------------------------------------------------
[0.14586 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_29

def test_case_29():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.depth()
        assert var_0 == 0
        var_1 = bst_0.__repr__()
        var_2 = bst_0.delete(bst_0)
        var_3 = bst_0.in_order()
>       double_linked_list_0 = module_0.DoubleLinkedList(var_3)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:343: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd14fb6890>, node = 'root'

>   ???
E   AttributeError: 'str' object has no attribute 'left'

binarySearchTree3:331: AttributeError

   - [# 100] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  335:             yield n
  336:     
  337:     def post_order(self, node='root'):
  338:         '''Depth frist post_order traversal of tree.'''
- 339:         if node == 'root':
+ 339:         if not (node == 'root'):
  340:             node = self.root
  341:         
  342:         if not node:
  343:             return
--------------------------------------------------------------------------------
[0.11141 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_20

def test_case_20():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.post_order()
>       queue_0 = module_0.Queue(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:225: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:135: in __init__
    ???
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1553f6a0>, node = 'root'

>   ???
E   AttributeError: 'str' object has no attribute 'left'

binarySearchTree3:345: AttributeError

   - [# 102] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
  353:         q = Queue()
  354:         q.enqueue(self.root)
- 355:         while q.peek():
+ 355:         while not (q.peek()):
  356:             node = q.dequeue()
  357:             yield node.val
  358:             if node.left:
  359:                 q.enqueue(node.left)
--------------------------------------------------------------------------------
[0.10017 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        double_linked_list_0 = module_0.DoubleLinkedList(var_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:16: AssertionError

   - [# 103] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  354:         q.enqueue(self.root)
  355:         while q.peek():
  356:             node = q.dequeue()
  357:             yield node.val
- 358:             if node.left:
+ 358:             if not (node.left):
  359:                 q.enqueue(node.left)
  360:             if node.right:
  361:                 q.enqueue(node.right)
  362:     
--------------------------------------------------------------------------------
[0.14949 s] survived

   - [# 104] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  356:             node = q.dequeue()
  357:             yield node.val
  358:             if node.left:
  359:                 q.enqueue(node.left)
- 360:             if node.right:
+ 360:             if not (node.right):
  361:                 q.enqueue(node.right)
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
--------------------------------------------------------------------------------
[0.15320 s] survived

   - [# 105] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  361:                 q.enqueue(node.right)
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
- 365:         if (self._size < 1 or not (self.contains(val))):
+ 365:         if not ((self._size < 1 or not (self.contains(val)))):
  366:             return
  367:         
  368:         node = self.search(val)
  369:         
--------------------------------------------------------------------------------
[0.10248 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_8

def test_case_8():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.depth()
        assert var_0 == 0
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_1 = double_linked_list_0.append(bst_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
        var_2 = double_linked_list_0.push(double_linked_list_0)
        var_3 = double_linked_list_0.remove(double_linked_list_0)
        var_4 = bst_0.post_order(var_3)
        var_5 = bst_0.contains(double_linked_list_0)
        assert var_5 is False
>       var_6 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:115: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [# 108] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  372:                 setattr(node.parent, node._side(), None)
  373:             else:
  374:                 self.root = None
  375:         
- 376:         elif node._is_interior():
+ 376:         elif not (node._is_interior()):
  377:             next_node = self._find_replacement(node)
  378:             self._size += 1
  379:             self.delete(next_node.val)
  380:             node.val = next_node.val
--------------------------------------------------------------------------------
[0.14970 s] survived

   - [# 109] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  380:             node.val = next_node.val
  381:         else:
  382:             
  383:             child = getattr(node, node._onlychild())
- 384:             if node.parent:
+ 384:             if not (node.parent):
  385:                 child.parent = node.parent
  386:                 setattr(node.parent, node._side(), child)
  387:             else:
  388:                 self.root = child
--------------------------------------------------------------------------------
[0.15026 s] survived

   - [# 110] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  390:         self._size -= 1
  391:     
  392:     def _find_replacement(self, node):
  393:         '''Find left most node of right subtree.'''
- 394:         if node.right:
+ 394:         if not (node.right):
  395:             return self._findmin(node.right)
  396:         
  397:         elif node.parent:
  398:             if node._side() == 'left':
--------------------------------------------------------------------------------
[0.15415 s] survived

   - [# 111] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  393:         '''Find left most node of right subtree.'''
  394:         if node.right:
  395:             return self._findmin(node.right)
  396:         
- 397:         elif node.parent:
+ 397:         elif not (node.parent):
  398:             if node._side() == 'left':
  399:                 return self.parent
  400:             else:
  401:                 node.parent.right = None
--------------------------------------------------------------------------------
[0.15373 s] survived

   - [# 112] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  394:         if node.right:
  395:             return self._findmin(node.right)
  396:         
  397:         elif node.parent:
- 398:             if node._side() == 'left':
+ 398:             if not (node._side() == 'left'):
  399:                 return self.parent
  400:             else:
  401:                 node.parent.right = None
  402:                 tmp = self._find_replacement(node.parent)
--------------------------------------------------------------------------------
[0.15300 s] survived

   - [# 113] COI binarySearchTree3: 
--------------------------------------------------------------------------------
  404:                 return tmp
  405:     
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
- 408:         while node.left:
+ 408:         while not (node.left):
  409:             node = node.left
  410:         return node
--------------------------------------------------------------------------------
[0.15420 s] survived

   - [# 135] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
- 178:             return 'left'
+ 178:             return 'mutpy'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
  182:     def _side(self):
--------------------------------------------------------------------------------
[0.15377 s] survived

   - [# 136] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
- 178:             return 'left'
+ 178:             return ''
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
  182:     def _side(self):
--------------------------------------------------------------------------------
[0.15347 s] survived

   - [# 137] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
- 180:             return 'right'
+ 180:             return 'mutpy'
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
--------------------------------------------------------------------------------
[0.14919 s] survived

   - [# 138] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
- 180:             return 'right'
+ 180:             return ''
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
--------------------------------------------------------------------------------
[0.15440 s] survived

   - [# 139] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
- 185:             return 'left' if self.parent.left == self else 'right'
+ 185:             return 'mutpy' if self.parent.left == self else 'right'
  186: 
  187: 
  188: class Bst(object):
  189:     '''Binary Search Tree.
--------------------------------------------------------------------------------
[0.15629 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [# 140] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
- 185:             return 'left' if self.parent.left == self else 'right'
+ 185:             return '' if self.parent.left == self else 'right'
  186: 
  187: 
  188: class Bst(object):
  189:     '''Binary Search Tree.
--------------------------------------------------------------------------------
[0.15753 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [# 141] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
- 185:             return 'left' if self.parent.left == self else 'right'
+ 185:             return 'left' if self.parent.left == self else 'mutpy'
  186: 
  187: 
  188: class Bst(object):
  189:     '''Binary Search Tree.
--------------------------------------------------------------------------------
[0.18647 s] survived

   - [# 142] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
- 185:             return 'left' if self.parent.left == self else 'right'
+ 185:             return 'left' if self.parent.left == self else ''
  186: 
  187: 
  188: class Bst(object):
  189:     '''Binary Search Tree.
--------------------------------------------------------------------------------
[0.15425 s] survived

   - [# 143] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  226:     '''
  227:     
  228:     def __init__(self, data=None):
  229:         '''Initialize tree.'''
- 230:         self._size = 0
+ 230:         self._size = 1
  231:         self.root = None
  232:         
  233:         if data:
  234:             for i in data:
--------------------------------------------------------------------------------
[0.10233 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
>       assert var_1 == 0
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:11: AssertionError

   - [# 145] CRP binarySearchTree3: 
--------------------------------------------------------------------------------
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
- 248:             curr = self._set_child(curr, 'left', val)
+ 248:             curr = self._set_child(curr, 'mutpy', val)
  249:         elif val > curr.val:
  250:             curr = self._set_child(curr, 'right', val)
  251:         return curr.height
  252:     
--------------------------------------------------------------------------------
[0.10814 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:235: in __init__
    ???
binarySearchTree3:243: in insert
    ???
binarySearchTree3:248: in _step
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd155193f0>
curr = <binarySearchTree3.Node object at 0x7fbd1551b790>, side = 'mutpy'
val = 57

>   ???
E   AttributeError: 'Node' object has no attribute 'mutpy'

binarySearchTree3:255: AttributeError
