   - [# 182] LCR binarySearchTree3: 
--------------------------------------------------------------------------------
  169:         return not ((self.right or self.left))
  170:     
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
- 173:         return (self.right and self.left)
+ 173:         return (self.right or self.left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.15406 s] survived

   - [# 183] LCR binarySearchTree3: 
--------------------------------------------------------------------------------
  173:         return (self.right and self.left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
- 177:         if (self.left and not (self.right)):
+ 177:         if (self.left or not (self.right)):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
--------------------------------------------------------------------------------
[0.15464 s] survived

   - [# 184] LCR binarySearchTree3: 
--------------------------------------------------------------------------------
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
- 179:         if (self.right and not (self.left)):
+ 179:         if (self.right or not (self.left)):
  180:             return 'right'
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
--------------------------------------------------------------------------------
[0.15336 s] survived

   - [# 185] LCR binarySearchTree3: 
--------------------------------------------------------------------------------
  361:                 q.enqueue(node.right)
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
- 365:         if (self._size < 1 or not (self.contains(val))):
+ 365:         if (self._size < 1 and not (self.contains(val))):
  366:             return
  367:         
  368:         node = self.search(val)
  369:         
--------------------------------------------------------------------------------
[0.11259 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_16

def test_case_16():
        bool_0 = False
        bytes_0 = b'\xa6"\x8b\xdam\xe3\x8fL\xeb\xcb\xeb\x95\xec'
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_0 = bst_0.delete(bool_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:185: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15c06ad0>, val = False

>   ???
E   AttributeError: 'NoneType' object has no attribute '_is_leaf'

binarySearchTree3:370: AttributeError

   - [# 189] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  232:         
  233:         if data:
  234:             for i in data:
  235:                 self.insert(i)
- 236:     
+ 236:                 break
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
  239:         if not (self.root):
  240:             self.root = Node(val)
--------------------------------------------------------------------------------
[0.14568 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 190] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  272:                 return curr
  273:             elif val < curr.val:
  274:                 curr = curr.left
  275:             else:
- 276:                 curr = curr.right
+ 276:                 curr = curr.rightbreak
  277:     
  278:     def size(self):
  279:         '''Return the size of the BST.'''
  280:         return self._size
--------------------------------------------------------------------------------
[0.15724 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [# 191] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  316:         yield node.val
  317:         
  318:         for n in self.pre_order(node=node.left):
  319:             yield n
- 320:         for n in self.pre_order(node=node.right):
- 321:             yield n
- 322:     
+ 320:             break
+ 321:         for n in self.pre_order(node=node.right):
+ 322:             yield n
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
  325:         if node == 'root':
  326:             node = self.root
--------------------------------------------------------------------------------
[0.15529 s] survived

   - [# 192] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  318:         for n in self.pre_order(node=node.left):
  319:             yield n
  320:         for n in self.pre_order(node=node.right):
  321:             yield n
- 322:     
+ 322:             break
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
  325:         if node == 'root':
  326:             node = self.root
--------------------------------------------------------------------------------
[0.18655 s] survived

   - [# 193] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  329:             return
  330:         
  331:         for n in self.in_order(node=node.left):
  332:             yield n
- 333:         yield node.val
- 334:         for n in self.in_order(node=node.right):
- 335:             yield n
- 336:     
+ 333:             break
+ 334:         yield node.val
+ 335:         for n in self.in_order(node=node.right):
+ 336:             yield n
  337:     def post_order(self, node='root'):
  338:         '''Depth frist post_order traversal of tree.'''
  339:         if node == 'root':
  340:             node = self.root
--------------------------------------------------------------------------------
[0.15386 s] survived

   - [# 195] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  343:             return
  344:         
  345:         for n in self.post_order(node=node.left):
  346:             yield n
- 347:         for n in self.post_order(node=node.right):
- 348:             yield n
- 349:         yield node.val
- 350:     
+ 347:             break
+ 348:         for n in self.post_order(node=node.right):
+ 349:             yield n
+ 350:         yield node.val
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
  353:         q = Queue()
  354:         q.enqueue(self.root)
--------------------------------------------------------------------------------
[0.15365 s] survived

   - [# 196] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  345:         for n in self.post_order(node=node.left):
  346:             yield n
  347:         for n in self.post_order(node=node.right):
  348:             yield n
- 349:         yield node.val
- 350:     
+ 349:             break
+ 350:         yield node.val
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
  353:         q = Queue()
  354:         q.enqueue(self.root)
--------------------------------------------------------------------------------
[0.15428 s] survived

   - [# 197] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  358:             if node.left:
  359:                 q.enqueue(node.left)
  360:             if node.right:
  361:                 q.enqueue(node.right)
- 362:     
+ 362:             break
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
  365:         if (self._size < 1 or not (self.contains(val))):
  366:             return
--------------------------------------------------------------------------------
[0.18798 s] survived

   - [# 198] OIL binarySearchTree3: 
--------------------------------------------------------------------------------
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
  408:         while node.left:
  409:             node = node.left
- 410:         return node
+ 410:             break
+ 411:         return node
--------------------------------------------------------------------------------
[0.15462 s] survived

   - [# 200] RIL binarySearchTree3: 
--------------------------------------------------------------------------------
  230:         self._size = 0
  231:         self.root = None
  232:         
  233:         if data:
- 234:             for i in data:
+ 234:             for i in reversed(data):
  235:                 self.insert(i)
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
--------------------------------------------------------------------------------
[0.10933 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 201] RIL binarySearchTree3: 
--------------------------------------------------------------------------------
  314:             return
  315:         
  316:         yield node.val
  317:         
- 318:         for n in self.pre_order(node=node.left):
+ 318:         for n in reversed(self.pre_order(node=node.left)):
  319:             yield n
  320:         for n in self.pre_order(node=node.right):
  321:             yield n
  322:     
--------------------------------------------------------------------------------
[0.15724 s] survived

   - [# 202] RIL binarySearchTree3: 
--------------------------------------------------------------------------------
  316:         yield node.val
  317:         
  318:         for n in self.pre_order(node=node.left):
  319:             yield n
- 320:         for n in self.pre_order(node=node.right):
+ 320:         for n in reversed(self.pre_order(node=node.right)):
  321:             yield n
  322:     
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
--------------------------------------------------------------------------------
[0.15426 s] survived

   - [# 203] RIL binarySearchTree3: 
--------------------------------------------------------------------------------
  327:         
  328:         if not node:
  329:             return
  330:         
- 331:         for n in self.in_order(node=node.left):
+ 331:         for n in reversed(self.in_order(node=node.left)):
  332:             yield n
  333:         yield node.val
  334:         for n in self.in_order(node=node.right):
  335:             yield n
--------------------------------------------------------------------------------
[0.11906 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_35

def test_case_35():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.in_order()
        queue_0 = module_0.Queue(var_1)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = queue_0.peek()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'binarySearchTree3.Bst'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:434: AssertionError

   - [# 204] RIL binarySearchTree3: 
--------------------------------------------------------------------------------
  330:         
  331:         for n in self.in_order(node=node.left):
  332:             yield n
  333:         yield node.val
- 334:         for n in self.in_order(node=node.right):
+ 334:         for n in reversed(self.in_order(node=node.right)):
  335:             yield n
  336:     
  337:     def post_order(self, node='root'):
  338:         '''Depth frist post_order traversal of tree.'''
--------------------------------------------------------------------------------
[0.11944 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_35

def test_case_35():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.in_order()
        queue_0 = module_0.Queue(var_1)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = queue_0.peek()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'binarySearchTree3.Bst'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:434: AssertionError

   - [# 219] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  243:             self._step(val, self.root)
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
- 247:         if val < curr.val:
+ 247:         if val > curr.val:
  248:             curr = self._set_child(curr, 'left', val)
  249:         elif val > curr.val:
  250:             curr = self._set_child(curr, 'right', val)
  251:         return curr.height
--------------------------------------------------------------------------------
[0.11119 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 220] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  243:             self._step(val, self.root)
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
- 247:         if val < curr.val:
+ 247:         if val <= curr.val:
  248:             curr = self._set_child(curr, 'left', val)
  249:         elif val > curr.val:
  250:             curr = self._set_child(curr, 'right', val)
  251:         return curr.height
--------------------------------------------------------------------------------
[0.15683 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_27

def test_case_27():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        var_2 = bst_0.depth()
>       assert var_2 == 6
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:288: AssertionError

   - [# 229] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  306:         return leftbranch - rightbranch
  307:     
  308:     def pre_order(self, node='root'):
  309:         '''Depth first pre-order traversal of tree.'''
- 310:         if node == 'root':
+ 310:         if node != 'root':
  311:             node = self.root
  312:         
  313:         if not node:
  314:             return
--------------------------------------------------------------------------------
[0.14385 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_17

def test_case_17():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.pre_order()
>       queue_0 = module_0.Queue(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:135: in __init__
    ???
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd14f949d0>, node = 'root'

>   ???
E   AttributeError: 'str' object has no attribute 'val'

binarySearchTree3:316: AttributeError

   - [# 230] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  321:             yield n
  322:     
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
- 325:         if node == 'root':
+ 325:         if node != 'root':
  326:             node = self.root
  327:         
  328:         if not node:
  329:             return
--------------------------------------------------------------------------------
[0.12098 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_29

def test_case_29():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.depth()
        assert var_0 == 0
        var_1 = bst_0.__repr__()
        var_2 = bst_0.delete(bst_0)
        var_3 = bst_0.in_order()
>       double_linked_list_0 = module_0.DoubleLinkedList(var_3)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:343: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd14fabe80>, node = 'root'

>   ???
E   AttributeError: 'str' object has no attribute 'left'

binarySearchTree3:331: AttributeError

   - [# 231] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  335:             yield n
  336:     
  337:     def post_order(self, node='root'):
  338:         '''Depth frist post_order traversal of tree.'''
- 339:         if node == 'root':
+ 339:         if node != 'root':
  340:             node = self.root
  341:         
  342:         if not node:
  343:             return
--------------------------------------------------------------------------------
[0.11669 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_20

def test_case_20():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.post_order()
>       queue_0 = module_0.Queue(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:225: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:135: in __init__
    ???
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd157b1c60>, node = 'root'

>   ???
E   AttributeError: 'str' object has no attribute 'left'

binarySearchTree3:345: AttributeError

   - [# 232] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  361:                 q.enqueue(node.right)
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
- 365:         if (self._size < 1 or not (self.contains(val))):
+ 365:         if (self._size > 1 or not (self.contains(val))):
  366:             return
  367:         
  368:         node = self.search(val)
  369:         
--------------------------------------------------------------------------------
[0.17415 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [# 233] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  361:                 q.enqueue(node.right)
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
- 365:         if (self._size < 1 or not (self.contains(val))):
+ 365:         if (self._size <= 1 or not (self.contains(val))):
  366:             return
  367:         
  368:         node = self.search(val)
  369:         
--------------------------------------------------------------------------------
[0.11499 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.delete(bst_0)
>       assert bst_0.root is None
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:177: AssertionError

   - [# 234] ROR binarySearchTree3: 
--------------------------------------------------------------------------------
  394:         if node.right:
  395:             return self._findmin(node.right)
  396:         
  397:         elif node.parent:
- 398:             if node._side() == 'left':
+ 398:             if node._side() != 'left':
  399:                 return self.parent
  400:             else:
  401:                 node.parent.right = None
  402:                 tmp = self._find_replacement(node.parent)
--------------------------------------------------------------------------------
[0.27963 s] survived

   - [# 245] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  133:     def __init__(self, data=None):
  134:         '''Initialize queue data structure.'''
  135:         self._container = DoubleLinkedList(data)
  136:     
- 137:     def enqueue(self, val):
- 138:         '''Add a value to the queue.'''
- 139:         self._container.append(val)
- 140:     
+ 137:     @staticmethod
+ 138:     def enqueue(self, val):
+ 139:         '''Add a value to the queue.'''
+ 140:         self._container.append(val)
  141:     def dequeue(self):
  142:         '''Remove a value from the front of the queue.'''
  143:         return self._container.pop()
  144:     
--------------------------------------------------------------------------------
[0.16674 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_31

def test_case_31():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.delete(bst_0)
        var_1 = bst_0.in_order()
        var_2 = bst_0.breadth_first()
        double_linked_list_0 = module_0.DoubleLinkedList(var_2)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
>       assert double_linked_list_0.head is None
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:378: AssertionError

   - [# 249] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  155: 
  156: class Node(object):
  157:     '''Node, or leaf of the BST.'''
  158:     
- 159:     def __init__(self, val=None, parent=None):
- 160:         '''Create node object.'''
- 161:         self.val = val
- 162:         self.right = None
- 163:         self.left = None
- 164:         self.parent = parent
- 165:         self.height = 1
- 166:     
+ 159:     @staticmethod
+ 160:     def __init__(self, val=None, parent=None):
+ 161:         '''Create node object.'''
+ 162:         self.val = val
+ 163:         self.right = None
+ 164:         self.left = None
+ 165:         self.parent = parent
+ 166:         self.height = 1
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
  169:         return not ((self.right or self.left))
  170:     
--------------------------------------------------------------------------------
[0.34130 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
>       var_2 = bst_0.insert(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:240: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = 0, val = None, parent = None

   - [# 251] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
  169:         return not ((self.right or self.left))
  170:     
- 171:     def _is_interior(self):
- 172:         '''Return true if a interior node.'''
- 173:         return (self.right and self.left)
- 174:     
+ 171:     @staticmethod
+ 172:     def _is_interior(self):
+ 173:         '''Return true if a interior node.'''
+ 174:         return (self.right and self.left)
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
--------------------------------------------------------------------------------
[0.32542 s] survived
