   - [# 252] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
  173:         return (self.right and self.left)
  174:     
- 175:     def _onlychild(self):
- 176:         '''Return string depending on children.'''
- 177:         if (self.left and not (self.right)):
- 178:             return 'left'
- 179:         if (self.right and not (self.left)):
- 180:             return 'right'
- 181:     
+ 175:     @staticmethod
+ 176:     def _onlychild(self):
+ 177:         '''Return string depending on children.'''
+ 178:         if (self.left and not (self.right)):
+ 179:             return 'left'
+ 180:         if (self.right and not (self.left)):
+ 181:             return 'right'
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
  185:             return 'left' if self.parent.left == self else 'right'
--------------------------------------------------------------------------------
[0.45373 s] survived

   - [# 268] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  388:                 self.root = child
  389:         
  390:         self._size -= 1
  391:     
- 392:     def _find_replacement(self, node):
- 393:         '''Find left most node of right subtree.'''
- 394:         if node.right:
- 395:             return self._findmin(node.right)
- 396:         
- 397:         elif node.parent:
- 398:             if node._side() == 'left':
- 399:                 return self.parent
- 400:             else:
- 401:                 node.parent.right = None
- 402:                 tmp = self._find_replacement(node.parent)
- 403:                 node.parent.right = node
- 404:                 return tmp
- 405:     
+ 392:     @staticmethod
+ 393:     def _find_replacement(self, node):
+ 394:         '''Find left most node of right subtree.'''
+ 395:         if node.right:
+ 396:             return self._findmin(node.right)
+ 397:         
+ 398:         elif node.parent:
+ 399:             if node._side() == 'left':
+ 400:                 return self.parent
+ 401:             else:
+ 402:                 node.parent.right = None
+ 403:                 tmp = self._find_replacement(node.parent)
+ 404:                 node.parent.right = node
+ 405:                 return tmp
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
  408:         while node.left:
  409:             node = node.left
--------------------------------------------------------------------------------
[0.26646 s] survived

   - [# 269] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  402:                 tmp = self._find_replacement(node.parent)
  403:                 node.parent.right = node
  404:                 return tmp
  405:     
- 406:     def _findmin(self, node):
- 407:         '''Find min of subtree, Min is always left most node.'''
- 408:         while node.left:
- 409:             node = node.left
- 410:         return node
+ 406:     @staticmethod
+ 407:     def _findmin(self, node):
+ 408:         '''Find min of subtree, Min is always left most node.'''
+ 409:         while node.left:
+ 410:             node = node.left
+ 411:         return node
--------------------------------------------------------------------------------
[0.19711 s] survived

   - [# 280] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
   40:     
   41:     def push(self, val):
   42:         '''Add val to the head of the list.'''
   43:         old_head = self.head
-  44:         self.head = NodeDLL(val, next_node=old_head)
+  44:         pass
   45:         if old_head:
   46:             old_head.prev = self.head
   47:         if not (self.tail):
   48:             self.tail = self.head
--------------------------------------------------------------------------------
[0.10950 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        double_linked_list_0 = module_0.DoubleLinkedList(var_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:16: AssertionError

   - [# 290] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
   65:     
   66:     def append(self, val):
   67:         '''Add val to the tail of the list.'''
   68:         old_tail = self.tail
-  69:         self.tail = NodeDLL(val, prev=old_tail)
+  69:         pass
   70:         if old_tail:
   71:             old_tail.next = self.tail
   72:         if self._length < 1:
   73:             self.head = self.tail
--------------------------------------------------------------------------------
[0.14948 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        double_linked_list_0 = module_0.DoubleLinkedList(var_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:16: AssertionError

   - [# 316] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  157:     '''Node, or leaf of the BST.'''
  158:     
  159:     def __init__(self, val=None, parent=None):
  160:         '''Create node object.'''
- 161:         self.val = val
+ 161:         pass
  162:         self.right = None
  163:         self.left = None
  164:         self.parent = parent
  165:         self.height = 1
--------------------------------------------------------------------------------
[0.20705 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       double_linked_list_0 = module_0.DoubleLinkedList(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd155d01f0>

>   ???
E   AttributeError: 'Node' object has no attribute 'val'

binarySearchTree3:357: AttributeError

   - [# 317] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  158:     
  159:     def __init__(self, val=None, parent=None):
  160:         '''Create node object.'''
  161:         self.val = val
- 162:         self.right = None
+ 162:         pass
  163:         self.left = None
  164:         self.parent = parent
  165:         self.height = 1
  166:     
--------------------------------------------------------------------------------
[0.18297 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       double_linked_list_0 = module_0.DoubleLinkedList(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1546b730>

>   ???
E   AttributeError: 'Node' object has no attribute 'right'. Did you mean: 'height'?

binarySearchTree3:360: AttributeError

   - [# 318] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  159:     def __init__(self, val=None, parent=None):
  160:         '''Create node object.'''
  161:         self.val = val
  162:         self.right = None
- 163:         self.left = None
+ 163:         pass
  164:         self.parent = parent
  165:         self.height = 1
  166:     
  167:     def _is_leaf(self):
--------------------------------------------------------------------------------
[0.13774 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       double_linked_list_0 = module_0.DoubleLinkedList(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15037670>

>   ???
E   AttributeError: 'Node' object has no attribute 'left'

binarySearchTree3:358: AttributeError

   - [# 319] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  160:         '''Create node object.'''
  161:         self.val = val
  162:         self.right = None
  163:         self.left = None
- 164:         self.parent = parent
+ 164:         pass
  165:         self.height = 1
  166:     
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
--------------------------------------------------------------------------------
[0.16403 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_1 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1511d960>
val = <binarySearchTree3.Bst object at 0x7fbd1511d960>

>   ???
E   AttributeError: 'Node' object has no attribute 'parent'

binarySearchTree3:371: AttributeError

   - [# 320] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  161:         self.val = val
  162:         self.right = None
  163:         self.left = None
  164:         self.parent = parent
- 165:         self.height = 1
+ 165:         pass
  166:     
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
  169:         return not ((self.right or self.left))
--------------------------------------------------------------------------------
[0.15666 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:235: in __init__
    ???
binarySearchTree3:243: in insert
    ???
binarySearchTree3:248: in _step
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15780970>
curr = <binarySearchTree3.Node object at 0x7fbd15781660>, side = 'left'
val = 57

>   ???
E   AttributeError: 'Node' object has no attribute 'height'. Did you mean: 'right'?

binarySearchTree3:263: AttributeError

   - [# 322] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  169:         return not ((self.right or self.left))
  170:     
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
- 173:         return (self.right and self.left)
+ 173:         pass
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.16397 s] survived

   - [# 323] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
- 178:             return 'left'
+ 178:             pass
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
  182:     def _side(self):
--------------------------------------------------------------------------------
[0.16304 s] survived

   - [# 324] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
- 180:             return 'right'
+ 180:             pass
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
--------------------------------------------------------------------------------
[0.16235 s] survived

   - [# 326] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  226:     '''
  227:     
  228:     def __init__(self, data=None):
  229:         '''Initialize tree.'''
- 230:         self._size = 0
+ 230:         pass
  231:         self.root = None
  232:         
  233:         if data:
  234:             for i in data:
--------------------------------------------------------------------------------
[0.10573 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
>       var_1 = bst_0.size()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15c45810>

>   ???
E   AttributeError: 'Bst' object has no attribute '_size'. Did you mean: 'size'?

binarySearchTree3:280: AttributeError

   - [# 327] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  227:     
  228:     def __init__(self, data=None):
  229:         '''Initialize tree.'''
  230:         self._size = 0
- 231:         self.root = None
+ 231:         pass
  232:         
  233:         if data:
  234:             for i in data:
  235:                 self.insert(i)
--------------------------------------------------------------------------------
[0.10353 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
>       assert bst_0.root is None
E       AttributeError: 'Bst' object has no attribute 'root'

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:8: AttributeError

   - [# 328] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  231:         self.root = None
  232:         
  233:         if data:
  234:             for i in data:
- 235:                 self.insert(i)
+ 235:                 pass
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
  239:         if not (self.root):
--------------------------------------------------------------------------------
[0.10796 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
>       assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:161: AssertionError

   - [# 329] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
  239:         if not (self.root):
- 240:             self.root = Node(val)
+ 240:             pass
  241:             self._size += 1
  242:         else:
  243:             self._step(val, self.root)
  244:     
--------------------------------------------------------------------------------
[0.10906 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
>       assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:13: AssertionError

   - [# 330] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  239:         if not (self.root):
  240:             self.root = Node(val)
  241:             self._size += 1
  242:         else:
- 243:             self._step(val, self.root)
+ 243:             pass
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
--------------------------------------------------------------------------------
[0.15697 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 331] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
- 248:             curr = self._set_child(curr, 'left', val)
+ 248:             pass
  249:         elif val > curr.val:
  250:             curr = self._set_child(curr, 'right', val)
  251:         return curr.height
  252:     
--------------------------------------------------------------------------------
[0.11781 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 332] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
  248:             curr = self._set_child(curr, 'left', val)
  249:         elif val > curr.val:
- 250:             curr = self._set_child(curr, 'right', val)
+ 250:             pass
  251:         return curr.height
  252:     
  253:     def _set_child(self, curr, side, val):
  254:         '''Helping.'''
--------------------------------------------------------------------------------
[0.11810 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 334] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  251:         return curr.height
  252:     
  253:     def _set_child(self, curr, side, val):
  254:         '''Helping.'''
- 255:         child = getattr(curr, side)
+ 255:         pass
  256:         if child:
  257:             count = self._step(val, child)
  258:             if curr.height <= count:
  259:                 curr.height += 1
--------------------------------------------------------------------------------
[0.12399 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:235: in __init__
    ???
binarySearchTree3:243: in insert
    ???
binarySearchTree3:248: in _step
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd156d4df0>
curr = <binarySearchTree3.Node object at 0x7fbd156d71f0>, side = 'left'
val = 57

>   ???
E   NameError: name 'child' is not defined

binarySearchTree3:256: NameError

   - [# 335] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  253:     def _set_child(self, curr, side, val):
  254:         '''Helping.'''
  255:         child = getattr(curr, side)
  256:         if child:
- 257:             count = self._step(val, child)
+ 257:             pass
  258:             if curr.height <= count:
  259:                 curr.height += 1
  260:         else:
  261:             setattr(curr, side, Node(val, curr))
--------------------------------------------------------------------------------
[0.14678 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:235: in __init__
    ???
binarySearchTree3:243: in insert
    ???
binarySearchTree3:250: in _step
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15139a50>
curr = <binarySearchTree3.Node object at 0x7fbd15139a80>, side = 'right'
val = 213

>   ???
E   NameError: name 'count' is not defined

binarySearchTree3:258: NameError

   - [# 336] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  257:             count = self._step(val, child)
  258:             if curr.height <= count:
  259:                 curr.height += 1
  260:         else:
- 261:             setattr(curr, side, Node(val, curr))
+ 261:             pass
  262:             self._size += 1
  263:             if curr.height == 1:
  264:                 curr.height += 1
  265:         return curr
--------------------------------------------------------------------------------
[0.18483 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 337] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  261:             setattr(curr, side, Node(val, curr))
  262:             self._size += 1
  263:             if curr.height == 1:
  264:                 curr.height += 1
- 265:         return curr
+ 265:         pass
  266:     
  267:     def search(self, val):
  268:         '''Return the node containing val.'''
  269:         curr = self.root
--------------------------------------------------------------------------------
[0.12690 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:235: in __init__
    ???
binarySearchTree3:243: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15542050>, val = 57, curr = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'height'

binarySearchTree3:251: AttributeError
