   - [# 338] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  265:         return curr
  266:     
  267:     def search(self, val):
  268:         '''Return the node containing val.'''
- 269:         curr = self.root
+ 269:         pass
  270:         while curr:
  271:             if curr.val == val:
  272:                 return curr
  273:             elif val < curr.val:
--------------------------------------------------------------------------------
[0.11652 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_5

def test_case_5():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.append(bst_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
        var_1 = double_linked_list_0.push(double_linked_list_0)
        var_2 = bst_0.in_order(bst_0)
        var_3 = double_linked_list_0.pop()
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert f'{type(var_3.head).__module__}.{type(var_3.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
        assert f'{type(var_3.tail).__module__}.{type(var_3.tail).__qualname__}' == 'binarySearchTree3.NodeDLL'
>       var_4 = bst_0.contains(var_2)

   - [# 339] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  268:         '''Return the node containing val.'''
  269:         curr = self.root
  270:         while curr:
  271:             if curr.val == val:
- 272:                 return curr
+ 272:                 pass
  273:             elif val < curr.val:
  274:                 curr = curr.left
  275:             else:
  276:                 curr = curr.right
--------------------------------------------------------------------------------
[5.00414 s] timeout

   - [# 340] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  270:         while curr:
  271:             if curr.val == val:
  272:                 return curr
  273:             elif val < curr.val:
- 274:                 curr = curr.left
+ 274:                 pass
  275:             else:
  276:                 curr = curr.right
  277:     
  278:     def size(self):
--------------------------------------------------------------------------------
[5.00305 s] timeout

   - [# 341] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  272:                 return curr
  273:             elif val < curr.val:
  274:                 curr = curr.left
  275:             else:
- 276:                 curr = curr.right
+ 276:                 pass
  277:     
  278:     def size(self):
  279:         '''Return the size of the BST.'''
  280:         return self._size
--------------------------------------------------------------------------------
[5.00663 s] timeout

   - [# 342] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  276:                 curr = curr.right
  277:     
  278:     def size(self):
  279:         '''Return the size of the BST.'''
- 280:         return self._size
+ 280:         pass
  281:     
  282:     def depth(self):
  283:         '''Return depth of the BST, representing total levels.'''
  284:         return 0 if not (self.root) else self.root.height
--------------------------------------------------------------------------------
[0.10461 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
>       assert var_1 == 0
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:11: AssertionError

   - [# 343] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  280:         return self._size
  281:     
  282:     def depth(self):
  283:         '''Return depth of the BST, representing total levels.'''
- 284:         return 0 if not (self.root) else self.root.height
+ 284:         pass
  285:     
  286:     def contains(self, val):
  287:         '''Return true if val is in the bst.'''
  288:         return self.search(val) is not None
--------------------------------------------------------------------------------
[0.10344 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_8

def test_case_8():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.depth()
>       assert var_0 == 0
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:103: AssertionError

   - [# 344] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  284:         return 0 if not (self.root) else self.root.height
  285:     
  286:     def contains(self, val):
  287:         '''Return true if val is in the bst.'''
- 288:         return self.search(val) is not None
+ 288:         pass
  289:     
  290:     def balance(self, tree=None):
  291:         '''Return an integer of how well the tree is balanced.
  292: 
--------------------------------------------------------------------------------
[0.09975 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_5

def test_case_5():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.append(bst_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
        var_1 = double_linked_list_0.push(double_linked_list_0)
        var_2 = bst_0.in_order(bst_0)
        var_3 = double_linked_list_0.pop()
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert f'{type(var_3.head).__module__}.{type(var_3.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
        assert f'{type(var_3.tail).__module__}.{type(var_3.tail).__qualname__}' == 'binarySearchTr

   - [# 345] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  295:         should return a negative value. An ideally-balanced tree should
  296:         return 0.
  297:         '''
  298:         if not tree:
- 299:             tree = self.root
+ 299:             pass
  300:             if not tree:
  301:                 return 0
  302:         
  303:         leftbranch = 0 if not (tree.left) else tree.left.height
--------------------------------------------------------------------------------
[0.11199 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 346] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  297:         '''
  298:         if not tree:
  299:             tree = self.root
  300:             if not tree:
- 301:                 return 0
+ 301:                 pass
  302:         
  303:         leftbranch = 0 if not (tree.left) else tree.left.height
  304:         rightbranch = 0 if not (tree.right) else tree.right.height
  305:         
--------------------------------------------------------------------------------
[0.11439 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_21

def test_case_21():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.depth()
        assert var_0 == 0
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        double_linked_list_1 = module_0.DoubleLinkedList(double_linked_list_0)
        assert f'{type(double_linked_list_1).__module__}.{type(double_linked_list_1).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert f'{type(double_linked_list_1.head).__module__}.{type(double_linked_list_1.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
        assert f'{type(double_linked_list_1.tail).__module__}.{type(double_linked_list_1.tail).__qualname__}' == 'binarySearchTree3.NodeDLL'
        var_1 = double_linked_list_0.append(bst_0)
        assert f'{type(double_linked_list_0.head).__module__}.{t

   - [# 347] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  299:             tree = self.root
  300:             if not tree:
  301:                 return 0
  302:         
- 303:         leftbranch = 0 if not (tree.left) else tree.left.height
+ 303:         pass
  304:         rightbranch = 0 if not (tree.right) else tree.right.height
  305:         
  306:         return leftbranch - rightbranch
  307:     
--------------------------------------------------------------------------------
[0.10857 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_0 = bst_0.balance()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd150679a0>
tree = <binarySearchTree3.Node object at 0x7fbd15064670>

>   ???
E   NameError: name 'leftbranch' is not defined

binarySearchTree3:306: NameError

   - [# 348] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  300:             if not tree:
  301:                 return 0
  302:         
  303:         leftbranch = 0 if not (tree.left) else tree.left.height
- 304:         rightbranch = 0 if not (tree.right) else tree.right.height
+ 304:         pass
  305:         
  306:         return leftbranch - rightbranch
  307:     
  308:     def pre_order(self, node='root'):
--------------------------------------------------------------------------------
[0.11196 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_0 = bst_0.balance()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:162: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd14ff1330>
tree = <binarySearchTree3.Node object at 0x7fbd14ff06d0>

>   ???
E   NameError: name 'rightbranch' is not defined

binarySearchTree3:306: NameError

   - [# 349] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  302:         
  303:         leftbranch = 0 if not (tree.left) else tree.left.height
  304:         rightbranch = 0 if not (tree.right) else tree.right.height
  305:         
- 306:         return leftbranch - rightbranch
+ 306:         pass
  307:     
  308:     def pre_order(self, node='root'):
  309:         '''Depth first pre-order traversal of tree.'''
  310:         if node == 'root':
--------------------------------------------------------------------------------
[0.14242 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.balance()
>       assert var_0 == -3
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:163: AssertionError

   - [# 350] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  307:     
  308:     def pre_order(self, node='root'):
  309:         '''Depth first pre-order traversal of tree.'''
  310:         if node == 'root':
- 311:             node = self.root
+ 311:             pass
  312:         
  313:         if not node:
  314:             return
  315:         
--------------------------------------------------------------------------------
[0.11130 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_17

def test_case_17():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.pre_order()
>       queue_0 = module_0.Queue(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:135: in __init__
    ???
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1583d300>, node = 'root'

>   ???
E   AttributeError: 'str' object has no attribute 'val'

binarySearchTree3:316: AttributeError

   - [# 351] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  310:         if node == 'root':
  311:             node = self.root
  312:         
  313:         if not node:
- 314:             return
+ 314:             pass
  315:         
  316:         yield node.val
  317:         
  318:         for n in self.pre_order(node=node.left):
--------------------------------------------------------------------------------
[0.12184 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_17

def test_case_17():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.pre_order()
>       queue_0 = module_0.Queue(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:194: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:135: in __init__
    ???
binarySearchTree3:35: in __init__
    ???
binarySearchTree3:318: in pre_order
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1546b8e0>, node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'val'

binarySearchTree3:316: AttributeError

   - [# 352] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  312:         
  313:         if not node:
  314:             return
  315:         
- 316:         yield node.val
+ 316:         pass
  317:         
  318:         for n in self.pre_order(node=node.left):
  319:             yield n
  320:         for n in self.pre_order(node=node.right):
--------------------------------------------------------------------------------
[0.19046 s] survived

   - [# 353] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  315:         
  316:         yield node.val
  317:         
  318:         for n in self.pre_order(node=node.left):
- 319:             yield n
+ 319:             pass
  320:         for n in self.pre_order(node=node.right):
  321:             yield n
  322:     
  323:     def in_order(self, node='root'):
--------------------------------------------------------------------------------
[0.16436 s] survived

   - [# 354] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  317:         
  318:         for n in self.pre_order(node=node.left):
  319:             yield n
  320:         for n in self.pre_order(node=node.right):
- 321:             yield n
+ 321:             pass
  322:     
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
  325:         if node == 'root':
--------------------------------------------------------------------------------
[0.15263 s] survived

   - [# 357] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  328:         if not node:
  329:             return
  330:         
  331:         for n in self.in_order(node=node.left):
- 332:             yield n
+ 332:             pass
  333:         yield node.val
  334:         for n in self.in_order(node=node.right):
  335:             yield n
  336:     
--------------------------------------------------------------------------------
[0.16057 s] survived

   - [# 358] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  329:             return
  330:         
  331:         for n in self.in_order(node=node.left):
  332:             yield n
- 333:         yield node.val
+ 333:         pass
  334:         for n in self.in_order(node=node.right):
  335:             yield n
  336:     
  337:     def post_order(self, node='root'):
--------------------------------------------------------------------------------
[0.12418 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_35

def test_case_35():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.in_order()
        queue_0 = module_0.Queue(var_1)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = queue_0.peek()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'binarySearchTree3.Bst'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:434: AssertionError

   - [# 359] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  331:         for n in self.in_order(node=node.left):
  332:             yield n
  333:         yield node.val
  334:         for n in self.in_order(node=node.right):
- 335:             yield n
+ 335:             pass
  336:     
  337:     def post_order(self, node='root'):
  338:         '''Depth frist post_order traversal of tree.'''
  339:         if node == 'root':
--------------------------------------------------------------------------------
[0.16773 s] survived

   - [# 362] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  342:         if not node:
  343:             return
  344:         
  345:         for n in self.post_order(node=node.left):
- 346:             yield n
+ 346:             pass
  347:         for n in self.post_order(node=node.right):
  348:             yield n
  349:         yield node.val
  350:     
--------------------------------------------------------------------------------
[0.16332 s] survived

   - [# 363] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  344:         
  345:         for n in self.post_order(node=node.left):
  346:             yield n
  347:         for n in self.post_order(node=node.right):
- 348:             yield n
+ 348:             pass
  349:         yield node.val
  350:     
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
--------------------------------------------------------------------------------
[0.16192 s] survived

   - [# 365] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  349:         yield node.val
  350:     
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
- 353:         q = Queue()
+ 353:         pass
  354:         q.enqueue(self.root)
  355:         while q.peek():
  356:             node = q.dequeue()
  357:             yield node.val
--------------------------------------------------------------------------------
[0.13302 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       double_linked_list_0 = module_0.DoubleLinkedList(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15139b70>

>   ???
E   NameError: name 'q' is not defined

binarySearchTree3:354: NameError

   - [# 366] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  350:     
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
  353:         q = Queue()
- 354:         q.enqueue(self.root)
+ 354:         pass
  355:         while q.peek():
  356:             node = q.dequeue()
  357:             yield node.val
  358:             if node.left:
--------------------------------------------------------------------------------
[0.10182 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        double_linked_list_0 = module_0.DoubleLinkedList(var_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:16: AssertionError

   - [# 367] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  352:         '''Breadth first traversal of tree.'''
  353:         q = Queue()
  354:         q.enqueue(self.root)
  355:         while q.peek():
- 356:             node = q.dequeue()
+ 356:             pass
  357:             yield node.val
  358:             if node.left:
  359:                 q.enqueue(node.left)
  360:             if node.right:
--------------------------------------------------------------------------------
[0.09966 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       double_linked_list_0 = module_0.DoubleLinkedList(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:35: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd159be2c0>

>   ???
E   NameError: name 'node' is not defined

binarySearchTree3:357: NameError

   - [# 368] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  353:         q = Queue()
  354:         q.enqueue(self.root)
  355:         while q.peek():
  356:             node = q.dequeue()
- 357:             yield node.val
+ 357:             pass
  358:             if node.left:
  359:                 q.enqueue(node.left)
  360:             if node.right:
  361:                 q.enqueue(node.right)
--------------------------------------------------------------------------------
[0.13200 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        double_linked_list_0 = module_0.DoubleLinkedList(var_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:16: AssertionError

   - [# 369] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  355:         while q.peek():
  356:             node = q.dequeue()
  357:             yield node.val
  358:             if node.left:
- 359:                 q.enqueue(node.left)
+ 359:                 pass
  360:             if node.right:
  361:                 q.enqueue(node.right)
  362:     
  363:     def delete(self, val):
--------------------------------------------------------------------------------
[0.15453 s] survived

   - [# 370] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  357:             yield node.val
  358:             if node.left:
  359:                 q.enqueue(node.left)
  360:             if node.right:
- 361:                 q.enqueue(node.right)
+ 361:                 pass
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
  365:         if (self._size < 1 or not (self.contains(val))):
--------------------------------------------------------------------------------
[0.15457 s] survived
