   - [# 371] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
  365:         if (self._size < 1 or not (self.contains(val))):
- 366:             return
+ 366:             pass
  367:         
  368:         node = self.search(val)
  369:         
  370:         if node._is_leaf():
--------------------------------------------------------------------------------
[0.10311 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_8

def test_case_8():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.depth()
        assert var_0 == 0
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_1 = double_linked_list_0.append(bst_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
        var_2 = double_linked_list_0.push(double_linked_list_0)
        var_3 = double_linked_list_0.remove(double_linked_list_0)
        var_4 = bst_0.post_order(var_3)
        var_5 = bst_0.contains(double_linked_list_0)
        assert var_5 is False
>       var_6 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:115: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTre

   - [# 372] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  364:         '''Remove a node from the tree.'''
  365:         if (self._size < 1 or not (self.contains(val))):
  366:             return
  367:         
- 368:         node = self.search(val)
+ 368:         pass
  369:         
  370:         if node._is_leaf():
  371:             if node.parent:
  372:                 setattr(node.parent, node._side(), None)
--------------------------------------------------------------------------------
[0.12661 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_1 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15571900>
val = <binarySearchTree3.Bst object at 0x7fbd15571900>

>   ???
E   NameError: name 'node' is not defined

binarySearchTree3:370: NameError

   - [# 373] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  368:         node = self.search(val)
  369:         
  370:         if node._is_leaf():
  371:             if node.parent:
- 372:                 setattr(node.parent, node._side(), None)
+ 372:                 pass
  373:             else:
  374:                 self.root = None
  375:         
  376:         elif node._is_interior():
--------------------------------------------------------------------------------
[0.18457 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_35

def test_case_35():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
        var_1 = bst_0.delete(str_0)
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_2 = bst_0.delete(str_0)
        queue_1 = module_0.Queue()
        var_3 = bst_0.size()
>       assert var_3 == 16
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:418: AssertionError

   - [# 374] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  370:         if node._is_leaf():
  371:             if node.parent:
  372:                 setattr(node.parent, node._side(), None)
  373:             else:
- 374:                 self.root = None
+ 374:                 pass
  375:         
  376:         elif node._is_interior():
  377:             next_node = self._find_replacement(node)
  378:             self._size += 1
--------------------------------------------------------------------------------
[0.11199 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.delete(bst_0)
>       assert bst_0.root is None
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:177: AssertionError

   - [# 375] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  373:             else:
  374:                 self.root = None
  375:         
  376:         elif node._is_interior():
- 377:             next_node = self._find_replacement(node)
+ 377:             pass
  378:             self._size += 1
  379:             self.delete(next_node.val)
  380:             node.val = next_node.val
  381:         else:
--------------------------------------------------------------------------------
[0.15551 s] survived

   - [# 376] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  375:         
  376:         elif node._is_interior():
  377:             next_node = self._find_replacement(node)
  378:             self._size += 1
- 379:             self.delete(next_node.val)
+ 379:             pass
  380:             node.val = next_node.val
  381:         else:
  382:             
  383:             child = getattr(node, node._onlychild())
--------------------------------------------------------------------------------
[0.18628 s] survived

   - [# 377] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  376:         elif node._is_interior():
  377:             next_node = self._find_replacement(node)
  378:             self._size += 1
  379:             self.delete(next_node.val)
- 380:             node.val = next_node.val
+ 380:             pass
  381:         else:
  382:             
  383:             child = getattr(node, node._onlychild())
  384:             if node.parent:
--------------------------------------------------------------------------------
[0.16207 s] survived

   - [# 378] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  379:             self.delete(next_node.val)
  380:             node.val = next_node.val
  381:         else:
  382:             
- 383:             child = getattr(node, node._onlychild())
+ 383:             pass
  384:             if node.parent:
  385:                 child.parent = node.parent
  386:                 setattr(node.parent, node._side(), child)
  387:             else:
--------------------------------------------------------------------------------
[0.20252 s] survived

   - [# 379] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  381:         else:
  382:             
  383:             child = getattr(node, node._onlychild())
  384:             if node.parent:
- 385:                 child.parent = node.parent
+ 385:                 pass
  386:                 setattr(node.parent, node._side(), child)
  387:             else:
  388:                 self.root = child
  389:         
--------------------------------------------------------------------------------
[0.15799 s] survived

   - [# 380] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  382:             
  383:             child = getattr(node, node._onlychild())
  384:             if node.parent:
  385:                 child.parent = node.parent
- 386:                 setattr(node.parent, node._side(), child)
+ 386:                 pass
  387:             else:
  388:                 self.root = child
  389:         
  390:         self._size -= 1
--------------------------------------------------------------------------------
[0.15428 s] survived

   - [# 381] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  384:             if node.parent:
  385:                 child.parent = node.parent
  386:                 setattr(node.parent, node._side(), child)
  387:             else:
- 388:                 self.root = child
+ 388:                 pass
  389:         
  390:         self._size -= 1
  391:     
  392:     def _find_replacement(self, node):
--------------------------------------------------------------------------------
[0.16560 s] survived

   - [# 382] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  391:     
  392:     def _find_replacement(self, node):
  393:         '''Find left most node of right subtree.'''
  394:         if node.right:
- 395:             return self._findmin(node.right)
+ 395:             pass
  396:         
  397:         elif node.parent:
  398:             if node._side() == 'left':
  399:                 return self.parent
--------------------------------------------------------------------------------
[0.16024 s] survived

   - [# 383] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  395:             return self._findmin(node.right)
  396:         
  397:         elif node.parent:
  398:             if node._side() == 'left':
- 399:                 return self.parent
+ 399:                 pass
  400:             else:
  401:                 node.parent.right = None
  402:                 tmp = self._find_replacement(node.parent)
  403:                 node.parent.right = node
--------------------------------------------------------------------------------
[0.16221 s] survived

   - [# 384] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  397:         elif node.parent:
  398:             if node._side() == 'left':
  399:                 return self.parent
  400:             else:
- 401:                 node.parent.right = None
+ 401:                 pass
  402:                 tmp = self._find_replacement(node.parent)
  403:                 node.parent.right = node
  404:                 return tmp
  405:     
--------------------------------------------------------------------------------
[0.17847 s] survived

   - [# 385] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  398:             if node._side() == 'left':
  399:                 return self.parent
  400:             else:
  401:                 node.parent.right = None
- 402:                 tmp = self._find_replacement(node.parent)
+ 402:                 pass
  403:                 node.parent.right = node
  404:                 return tmp
  405:     
  406:     def _findmin(self, node):
--------------------------------------------------------------------------------
[0.22299 s] survived

   - [# 386] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  399:                 return self.parent
  400:             else:
  401:                 node.parent.right = None
  402:                 tmp = self._find_replacement(node.parent)
- 403:                 node.parent.right = node
+ 403:                 pass
  404:                 return tmp
  405:     
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
--------------------------------------------------------------------------------
[0.20358 s] survived

   - [# 387] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  400:             else:
  401:                 node.parent.right = None
  402:                 tmp = self._find_replacement(node.parent)
  403:                 node.parent.right = node
- 404:                 return tmp
+ 404:                 pass
  405:     
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
  408:         while node.left:
--------------------------------------------------------------------------------
[0.29799 s] survived

   - [# 388] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  405:     
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
  408:         while node.left:
- 409:             node = node.left
+ 409:             pass
  410:         return node
--------------------------------------------------------------------------------
[0.17409 s] survived

   - [# 389] SDL binarySearchTree3: 
--------------------------------------------------------------------------------
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
  408:         while node.left:
  409:             node = node.left
- 410:         return node
+ 410:         pass
--------------------------------------------------------------------------------
[0.16268 s] survived

   - [# 449] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  165:         self.height = 1
  166:     
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
- 169:         return not ((self.right or self.left))
+ 169:         return not ((right or self.left))
  170:     
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
  173:         return (self.right and self.left)
--------------------------------------------------------------------------------
[0.14131 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_1 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:370: in delete
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Node object at 0x7fbd152472b0>

>   ???
E   NameError: name 'right' is not defined

binarySearchTree3:169: NameError

   - [# 450] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  165:         self.height = 1
  166:     
  167:     def _is_leaf(self):
  168:         '''Return true if a leaf.'''
- 169:         return not ((self.right or self.left))
+ 169:         return not ((self.right or left))
  170:     
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
  173:         return (self.right and self.left)
--------------------------------------------------------------------------------
[0.11582 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_1 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:370: in delete
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Node object at 0x7fbd15519720>

>   ???
E   NameError: name 'left' is not defined

binarySearchTree3:169: NameError

   - [# 451] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  169:         return not ((self.right or self.left))
  170:     
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
- 173:         return (self.right and self.left)
+ 173:         return (right and self.left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.16379 s] survived

   - [# 452] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  169:         return not ((self.right or self.left))
  170:     
  171:     def _is_interior(self):
  172:         '''Return true if a interior node.'''
- 173:         return (self.right and self.left)
+ 173:         return (self.right and left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.17548 s] survived

   - [# 453] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  173:         return (self.right and self.left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
- 177:         if (self.left and not (self.right)):
+ 177:         if (left and not (self.right)):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
--------------------------------------------------------------------------------
[0.19626 s] survived

   - [# 454] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  173:         return (self.right and self.left)
  174:     
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
- 177:         if (self.left and not (self.right)):
+ 177:         if (self.left and not right):
  178:             return 'left'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
--------------------------------------------------------------------------------
[0.17620 s] survived

   - [# 455] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
- 179:         if (self.right and not (self.left)):
+ 179:         if (right and not (self.left)):
  180:             return 'right'
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
--------------------------------------------------------------------------------
[0.16825 s] survived

   - [# 456] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  175:     def _onlychild(self):
  176:         '''Return string depending on children.'''
  177:         if (self.left and not (self.right)):
  178:             return 'left'
- 179:         if (self.right and not (self.left)):
+ 179:         if (self.right and not left):
  180:             return 'right'
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
--------------------------------------------------------------------------------
[0.16636 s] survived

   - [# 457] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  180:             return 'right'
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
- 184:         if self.parent:
+ 184:         if parent:
  185:             return 'left' if self.parent.left == self else 'right'
  186: 
  187: 
  188: class Bst(object):
--------------------------------------------------------------------------------
[0.19696 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_27

def test_case_27():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
>       var_1 = bst_0.delete(str_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:286: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:372: in delete
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Node object at 0x7fbd14ff0400>

>   ???
E   NameError: name 'parent' is not defined

binarySearchTree3:184: NameError

   - [# 458] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  181:     
  182:     def _side(self):
  183:         '''Return if left or right child of parent.'''
  184:         if self.parent:
- 185:             return 'left' if self.parent.left == self else 'right'
+ 185:             return 'left' if parent.left == self else 'right'
  186: 
  187: 
  188: class Bst(object):
  189:     '''Binary Search Tree.
--------------------------------------------------------------------------------
[0.16371 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_27

def test_case_27():
        str_0 = 'LpnzcVxEf~\x0b6\x0b3IV]t'
        bst_0 = module_0.Bst(str_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_0 = bst_0.insert(str_0)
>       var_1 = bst_0.delete(str_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:286: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:372: in delete
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Node object at 0x7fbd15408850>

>   ???
E   NameError: name 'parent' is not defined

binarySearchTree3:185: NameError

   - [# 461] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  231:         self.root = None
  232:         
  233:         if data:
  234:             for i in data:
- 235:                 self.insert(i)
+ 235:                 insert(i)
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
  239:         if not (self.root):
--------------------------------------------------------------------------------
[0.12639 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15519450>
data = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'

>   ???
E   NameError: name 'insert' is not defined

binarySearchTree3:235: NameError

   - [# 462] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  235:                 self.insert(i)
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
- 239:         if not (self.root):
+ 239:         if not root:
  240:             self.root = Node(val)
  241:             self._size += 1
  242:         else:
  243:             self._step(val, self.root)
--------------------------------------------------------------------------------
[0.15306 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
>       var_2 = bst_0.insert(var_1)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd15c3f580>, val = 0

>   ???
E   NameError: name 'root' is not defined

binarySearchTree3:239: NameError

   - [# 465] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  239:         if not (self.root):
  240:             self.root = Node(val)
  241:             self._size += 1
  242:         else:
- 243:             self._step(val, self.root)
+ 243:             _step(val, self.root)
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
--------------------------------------------------------------------------------
[0.14831 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:235: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd155eb6d0>, val = 57

>   ???
E   NameError: name '_step' is not defined

binarySearchTree3:243: NameError

   - [# 466] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  239:         if not (self.root):
  240:             self.root = Node(val)
  241:             self._size += 1
  242:         else:
- 243:             self._step(val, self.root)
+ 243:             self._step(val, root)
  244:     
  245:     def _step(self, val, curr):
  246:         '''Decide left or right and returns height.'''
  247:         if val < curr.val:
--------------------------------------------------------------------------------
[0.12039 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
>       bst_0 = module_0.Bst(bytes_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:159: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3:235: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd1502f9d0>, val = 57

>   ???
E   NameError: name 'root' is not defined

binarySearchTree3:243: NameError
