   - [# 489] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  364:         '''Remove a node from the tree.'''
  365:         if (self._size < 1 or not (self.contains(val))):
  366:             return
  367:         
- 368:         node = self.search(val)
+ 368:         node = search(val)
  369:         
  370:         if node._is_leaf():
  371:             if node.parent:
  372:                 setattr(node.parent, node._side(), None)
--------------------------------------------------------------------------------
[0.14910 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
>       var_1 = bst_0.delete(bst_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:176: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree3.Bst object at 0x7fbd151d4400>
val = <binarySearchTree3.Bst object at 0x7fbd151d4400>

>   ???
E   NameError: name 'search' is not defined

binarySearchTree3:368: NameError

   - [# 491] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  373:             else:
  374:                 self.root = None
  375:         
  376:         elif node._is_interior():
- 377:             next_node = self._find_replacement(node)
+ 377:             next_node = _find_replacement(node)
  378:             self._size += 1
  379:             self.delete(next_node.val)
  380:             node.val = next_node.val
  381:         else:
--------------------------------------------------------------------------------
[0.16434 s] survived

   - [# 493] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  375:         
  376:         elif node._is_interior():
  377:             next_node = self._find_replacement(node)
  378:             self._size += 1
- 379:             self.delete(next_node.val)
+ 379:             delete(next_node.val)
  380:             node.val = next_node.val
  381:         else:
  382:             
  383:             child = getattr(node, node._onlychild())
--------------------------------------------------------------------------------
[0.16252 s] survived

   - [# 496] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  391:     
  392:     def _find_replacement(self, node):
  393:         '''Find left most node of right subtree.'''
  394:         if node.right:
- 395:             return self._findmin(node.right)
+ 395:             return _findmin(node.right)
  396:         
  397:         elif node.parent:
  398:             if node._side() == 'left':
  399:                 return self.parent
--------------------------------------------------------------------------------
[0.15957 s] survived

   - [# 497] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  395:             return self._findmin(node.right)
  396:         
  397:         elif node.parent:
  398:             if node._side() == 'left':
- 399:                 return self.parent
+ 399:                 return parent
  400:             else:
  401:                 node.parent.right = None
  402:                 tmp = self._find_replacement(node.parent)
  403:                 node.parent.right = node
--------------------------------------------------------------------------------
[0.16219 s] survived

   - [# 498] SVD binarySearchTree3: 
--------------------------------------------------------------------------------
  398:             if node._side() == 'left':
  399:                 return self.parent
  400:             else:
  401:                 node.parent.right = None
- 402:                 tmp = self._find_replacement(node.parent)
+ 402:                 tmp = _find_replacement(node.parent)
  403:                 node.parent.right = node
  404:                 return tmp
  405:     
  406:     def _findmin(self, node):
--------------------------------------------------------------------------------
[0.16163 s] survived

   - [# 502] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  231:         self.root = None
  232:         
  233:         if data:
  234:             for i in data:
- 235:                 self.insert(i)
+ 235:                 break
  236:     
  237:     def insert(self, val):
  238:         '''Insert val into BST. If val is already present will be ignored.'''
  239:         if not (self.root):
--------------------------------------------------------------------------------
[0.11119 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_13

def test_case_13():
        bytes_0 = b';9q\xd5\xe4\\!+v\xc3\xb2\x97\xf0'
        none_type_0 = None
        bst_0 = module_0.Bst(bytes_0)
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
>       assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:161: AssertionError

   - [# 503] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  267:     def search(self, val):
  268:         '''Return the node containing val.'''
  269:         curr = self.root
  270:         while curr:
- 271:             if curr.val == val:
- 272:                 return curr
- 273:             elif val < curr.val:
- 274:                 curr = curr.left
- 275:             else:
- 276:                 curr = curr.right
+ 271:             break
+ 272:     
+ 273:     
+ 274:     
+ 275:     
+ 276:     
  277:     
  278:     def size(self):
  279:         '''Return the size of the BST.'''
  280:         return self._size
--------------------------------------------------------------------------------
[0.11564 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_15

def test_case_15():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.delete(bst_0)
>       assert bst_0.root is None
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:177: AssertionError

   - [# 504] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  315:         
  316:         yield node.val
  317:         
  318:         for n in self.pre_order(node=node.left):
- 319:             yield n
+ 319:             break
  320:         for n in self.pre_order(node=node.right):
  321:             yield n
  322:     
  323:     def in_order(self, node='root'):
--------------------------------------------------------------------------------
[0.18318 s] survived

   - [# 505] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  317:         
  318:         for n in self.pre_order(node=node.left):
  319:             yield n
  320:         for n in self.pre_order(node=node.right):
- 321:             yield n
+ 321:             break
  322:     
  323:     def in_order(self, node='root'):
  324:         '''Depth first in-order traversal of tree.'''
  325:         if node == 'root':
--------------------------------------------------------------------------------
[0.16644 s] survived

   - [# 506] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  328:         if not node:
  329:             return
  330:         
  331:         for n in self.in_order(node=node.left):
- 332:             yield n
+ 332:             break
  333:         yield node.val
  334:         for n in self.in_order(node=node.right):
  335:             yield n
  336:     
--------------------------------------------------------------------------------
[0.16887 s] survived

   - [# 507] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  331:         for n in self.in_order(node=node.left):
  332:             yield n
  333:         yield node.val
  334:         for n in self.in_order(node=node.right):
- 335:             yield n
+ 335:             break
  336:     
  337:     def post_order(self, node='root'):
  338:         '''Depth frist post_order traversal of tree.'''
  339:         if node == 'root':
--------------------------------------------------------------------------------
[0.18115 s] survived

   - [# 508] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  342:         if not node:
  343:             return
  344:         
  345:         for n in self.post_order(node=node.left):
- 346:             yield n
+ 346:             break
  347:         for n in self.post_order(node=node.right):
  348:             yield n
  349:         yield node.val
  350:     
--------------------------------------------------------------------------------
[0.20277 s] survived

   - [# 509] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  344:         
  345:         for n in self.post_order(node=node.left):
  346:             yield n
  347:         for n in self.post_order(node=node.right):
- 348:             yield n
+ 348:             break
  349:         yield node.val
  350:     
  351:     def breadth_first(self):
  352:         '''Breadth first traversal of tree.'''
--------------------------------------------------------------------------------
[0.16364 s] survived

   - [# 510] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  352:         '''Breadth first traversal of tree.'''
  353:         q = Queue()
  354:         q.enqueue(self.root)
  355:         while q.peek():
- 356:             node = q.dequeue()
- 357:             yield node.val
- 358:             if node.left:
- 359:                 q.enqueue(node.left)
- 360:             if node.right:
- 361:                 q.enqueue(node.right)
+ 356:             break
+ 357:     
+ 358:     
+ 359:     
+ 360:     
+ 361:     
  362:     
  363:     def delete(self, val):
  364:         '''Remove a node from the tree.'''
  365:         if (self._size < 1 or not (self.contains(val))):
--------------------------------------------------------------------------------
[0.10507 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
        var_1 = bst_0.size()
        assert var_1 == 0
        var_2 = bst_0.insert(var_1)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        double_linked_list_0 = module_0.DoubleLinkedList(var_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'binarySearchTree3.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'binarySearchTree3.NodeDLL'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py:16: AssertionError

   - [# 511] ZIL binarySearchTree3: 
--------------------------------------------------------------------------------
  405:     
  406:     def _findmin(self, node):
  407:         '''Find min of subtree, Min is always left most node.'''
  408:         while node.left:
- 409:             node = node.left
+ 409:             break
  410:         return node
--------------------------------------------------------------------------------
[0.19227 s] survived
