   - [# 240] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
   62:         if self._length < 1:
   63:             self.tail = None
   64:         return to_return.data
   65:     
-  66:     def append(self, val):
-  67:         '''Add val to the tail of the list.'''
-  68:         old_tail = self.tail
-  69:         self.tail = NodeDLL(val, prev=old_tail)
-  70:         if old_tail:
-  71:             old_tail.next = self.tail
-  72:         if self._length < 1:
-  73:             self.head = self.tail
-  74:         self._length += 1
-  75:     
+  66:     @staticmethod
+  67:     def append(self, val):
+  68:         '''Add val to the tail of the list.'''
+  69:         old_tail = self.tail
+  70:         self.tail = NodeDLL(val, prev=old_tail)
+  71:         if old_tail:
+  72:             old_tail.next = self.tail
+  73:         if self._length < 1:
+  74:             self.head = self.tail
+  75:         self._length += 1
   76:     def shift(self):
   77:         '''Remove the val from the tail of the list.'''
   78:         to_return = self.tail
   79:         if self._length < 1:
--------------------------------------------------------------------------------
[0.11888 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_5

def test_case_5():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.balance()
        assert var_1 == 0
        var_2 = bst_0.breadth_first()
        queue_0 = module_0.Queue(var_2

   - [# 247] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  141:     def dequeue(self):
  142:         '''Remove a value from the front of the queue.'''
  143:         return self._container.pop()
  144:     
- 145:     def peek(self):
- 146:         '''Return the next value in the queue without dequing it.'''
- 147:         try:
- 148:             return self._container.head.data
- 149:         except AttributeError:
- 150:             return None
- 151:     
+ 145:     @staticmethod
+ 146:     def peek(self):
+ 147:         '''Return the next value in the queue without dequing it.'''
+ 148:         try:
+ 149:             return self._container.head.data
+ 150:         except AttributeError:
+ 151:             return None
  152:     def size(self):
  153:         '''Return the size of the queue.'''
  154:         return self._container._length
  155: 
--------------------------------------------------------------------------------
[0.25402 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py::test_case_5

def test_case_5():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.balance()
        assert var_1 == 0
        var_2 = bst_0.breadth_first()
        queue_0 = module_0.Queue(var_2)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_3 = queue_0.dequeue()
>       assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'binarySearchTree3.Bst'
E
