   - [# 253] SDI binarySearchTree3: 
--------------------------------------------------------------------------------
  178:             return 'left'
  179:         if (self.right and not (self.left)):
  180:             return 'right'
  181:     
- 182:     def _side(self):
- 183:         '''Return if left or right child of parent.'''
- 184:         if self.parent:
- 185:             return 'left' if self.parent.left == self else 'right'
- 186: 
+ 182:     @staticmethod
+ 183:     def _side(self):
+ 184:         '''Return if left or right child of parent.'''
+ 185:         if self.parent:
+ 186:             return 'left' if self.parent.left == self else 'right'
  187: 
  188: class Bst(object):
  189:     '''Binary Search Tree.
  190: 
--------------------------------------------------------------------------------
[0.12216 s] survived
