54 : Job ID be1fb60048dd4774824bedddf63be078
SURVIVED
test outcome: survived
binarySearchTree3.py, start pos: (310, 16), end pos: (310, 18)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -307,7 +307,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node is 'root':
             node = self.root
         if not node:
RANDOM/test_binarySearchTree3_RANDOM.py ................................ [  1%]
........................................................................ [  5%]
........................................................................ [  8%]
........................................................................ [ 12%]
........................................................................ [ 15%]
........................................................................ [ 19%]
........................................................................ [ 22%]
........................................................................ [ 26%]
........................................................................ [ 29%]
........................................................................ [ 33%]
........................................................................ [ 36%]
........................................................................ [ 40%]
.........................................

55 : Job ID 64061d8e46e045218b535484f38002ca
SURVIVED
test outcome: survived
binarySearchTree3.py, start pos: (325, 16), end pos: (325, 18)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 3
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -322,7 +322,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node is 'root':
             node = self.root
         if not node:
RANDOM/test_binarySearchTree3_RANDOM.py ................................ [  1%]
........................................................................ [  5%]
........................................................................ [  8%]
........................................................................ [ 12%]
........................................................................ [ 15%]
........................................................................ [ 19%]
........................................................................ [ 22%]
........................................................................ [ 26%]
........................................................................ [ 29%]
........................................................................ [ 33%]
........................................................................ [ 36%]
........................................................................ [ 40%]
...........................................

56 : Job ID f4411b2f88ad4a559a40619117d4c0fc
SURVIVED
test outcome: survived
binarySearchTree3.py, start pos: (339, 16), end pos: (339, 18)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 4
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -336,7 +336,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node is 'root':
             node = self.root
         if not node:
RANDOM/test_binarySearchTree3_RANDOM.py ................................ [  1%]
........................................................................ [  5%]
........................................................................ [  8%]
........................................................................ [ 12%]
........................................................................ [ 15%]
........................................................................ [ 19%]
........................................................................ [ 22%]
........................................................................ [ 26%]
........................................................................ [ 29%]
........................................................................ [ 33%]
........................................................................ [ 36%]
........................................................................ [ 40%]
.......................................
