   - [#   2] CDI binarySearchTree4: 
--------------------------------------------------------------------------------
   5:         self.left = None
   6:         self.right = None
   7:         self.parent = None
   8:     
-  9:     def __repr__(self):
- 10:         return str(self.data)
- 11: 
+  9:     @classmethod
+ 10:     def __repr__(self):
+ 11:         return str(self.data)
  12: class Bst(object):
  13:     
  14:     def __init__(self, root=None):
  15:         self.root = root
--------------------------------------------------------------------------------
[0.07454 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
>       var_2 = node_1.__repr__()

   - [#   3] CDI binarySearchTree4: 
--------------------------------------------------------------------------------
  10:         return str(self.data)
  11: 
  12: class Bst(object):
  13:     
- 14:     def __init__(self, root=None):
- 15:         self.root = root
- 16:     
+ 14:     @classmethod
+ 15:     def __init__(self, root=None):
+ 16:         self.root = root
  17:     def insert(self, data):
  18:         if data is None:
  19:             raise TypeError('data cannot be None')
  20:         if self.root is None:
--------------------------------------------------------------------------------
[0.08570 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py::test_case_6

def test_case_6():
        bool_0 = False
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst(bst_0)
>       var_0 = bst_0.insert(bool_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py:61: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree4:24: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree4.Bst object at 0x7fbedcb1c400>
node = <binarySearchTree4.Bst object at 0x7fbedcb1c400>, data = False

>   ???
E   AttributeError: 'Bst' object has no attribute 'data'

binarySearchTree4:29: AttributeError

   - [#   4] CDI binarySearchTree4: 
--------------------------------------------------------------------------------
  13:     
  14:     def __init__(self, root=None):
  15:         self.root = root
  16:     
- 17:     def insert(self, data):
- 18:         if data is None:
- 19:             raise TypeError('data cannot be None')
- 20:         if self.root is None:
- 21:             self.root = Node(data)
- 22:             return self.root
- 23:         else:
- 24:             return self._insert(self.root, data)
- 25:     
+ 17:     @classmethod
+ 18:     def insert(self, data):
+ 19:         if data is None:
+ 20:             raise TypeError('data cannot be None')
+ 21:         if self.root is None:
+ 22:             self.root = Node(data)
+ 23:             return self.root
+ 24:         else:
+ 25:             return self._insert(self.root, data)
  26:     def _insert(self, node, data):
  27:         if node is None:
  28:             return Node(data)
  29:         if data <= node.data:
--------------------------------------------------------------------------------
[0.07465 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
>       var_0 = bst_0.insert(list_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [#   5] CDI binarySearchTree4: 
--------------------------------------------------------------------------------
  22:             return self.root
  23:         else:
  24:             return self._insert(self.root, data)
  25:     
- 26:     def _insert(self, node, data):
- 27:         if node is None:
- 28:             return Node(data)
- 29:         if data <= node.data:
- 30:             if node.left is None:
- 31:                 node.left = self._insert(node.left, data)
- 32:                 node.left.parent = node
- 33:                 return node.left
- 34:             else:
- 35:                 return self._insert(node.left, data)
- 36:         
- 37:         elif node.right is None:
- 38:             node.right = self._insert(node.right, data)
- 39:             node.right.parent = node
- 40:             return node.right
- 41:         else:
- 42:             return self._insert(node.right, data)
+ 26:     @classmethod
+ 27:     def _insert(self, node, data):
+ 28:         if node is None:
+ 29:             return Node(data)
+ 30:         if data <= node.data:
+ 31:             if node.left is None:
+ 32:                 node.left = self._insert(node.left, data)
+ 33:                 node.left.parent = node
+ 34:                 return node.left
+ 35:             else:
+ 36:                 return self._insert(node.left, data)
+ 37:         
+ 38:         elif node.right is None:
+ 39:             node.right = self._insert(node.right, data)
+ 40:             node.right.parent = node
+ 41:             return node.right
+ 42:         else:
+ 43:             return self._insert(node.right, data)
--------------------------------------------------------------------------------
[0.06141 s] survived

   - [#   7] COI binarySearchTree4: 
--------------------------------------------------------------------------------
  16:     
  17:     def insert(self, data):
  18:         if data is None:
  19:             raise TypeError('data cannot be None')
- 20:         if self.root is None:
+ 20:         if not (self.root is None):
  21:             self.root = Node(data)
  22:             return self.root
  23:         else:
  24:             return self._insert(self.root, data)
--------------------------------------------------------------------------------
[0.07859 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
>       assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
E       AssertionError

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:15: AssertionError

   - [#   8] COI binarySearchTree4: 
--------------------------------------------------------------------------------
  23:         else:
  24:             return self._insert(self.root, data)
  25:     
  26:     def _insert(self, node, data):
- 27:         if node is None:
+ 27:         if not (node is None):
  28:             return Node(data)
  29:         if data <= node.data:
  30:             if node.left is None:
  31:                 node.left = self._insert(node.left, data)
--------------------------------------------------------------------------------
[0.08631 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
>       assert f'{type(var_1.right).__module__}.{type(var_1.right

   - [#   9] COI binarySearchTree4: 
--------------------------------------------------------------------------------
  25:     
  26:     def _insert(self, node, data):
  27:         if node is None:
  28:             return Node(data)
- 29:         if data <= node.data:
+ 29:         if not (data <= node.data):
  30:             if node.left is None:
  31:                 node.left = self._insert(node.left, data)
  32:                 node.left.parent = node
  33:                 return node.left
--------------------------------------------------------------------------------
[0.07748 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
>       assert f'{type(var_1.right).__module__}.{t

   - [#  10] COI binarySearchTree4: 
--------------------------------------------------------------------------------
  26:     def _insert(self, node, data):
  27:         if node is None:
  28:             return Node(data)
  29:         if data <= node.data:
- 30:             if node.left is None:
+ 30:             if not (node.left is None):
  31:                 node.left = self._insert(node.left, data)
  32:                 node.left.parent = node
  33:                 return node.left
  34:             else:
--------------------------------------------------------------------------------
[0.07781 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.righ

   - [#  11] COI binarySearchTree4: 
--------------------------------------------------------------------------------
  33:                 return node.left
  34:             else:
  35:                 return self._insert(node.left, data)
  36:         
- 37:         elif node.right is None:
+ 37:         elif not (node.right is None):
  38:             node.right = self._insert(node.right, data)
  39:             node.right.parent = node
  40:             return node.right
  41:         else:
--------------------------------------------------------------------------------
[0.07465 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
>       assert f'{type(var_1.right).__module__}.{type(

   - [#  12] CRP binarySearchTree4: 
--------------------------------------------------------------------------------
  15:         self.root = root
  16:     
  17:     def insert(self, data):
  18:         if data is None:
- 19:             raise TypeError('data cannot be None')
+ 19:             raise TypeError('mutpy')
  20:         if self.root is None:
  21:             self.root = Node(data)
  22:             return self.root
  23:         else:
--------------------------------------------------------------------------------
[0.06295 s] survived

   - [#  13] CRP binarySearchTree4: 
--------------------------------------------------------------------------------
  15:         self.root = root
  16:     
  17:     def insert(self, data):
  18:         if data is None:
- 19:             raise TypeError('data cannot be None')
+ 19:             raise TypeError('')
  20:         if self.root is None:
  21:             self.root = Node(data)
  22:             return self.root
  23:         else:
--------------------------------------------------------------------------------
[0.06353 s] survived

   - [#  22] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
   1: class Node(object):
   2:     
   3:     def __init__(self, data):
   4:         self.data = data
-  5:         self.left = None
+  5:         pass
   6:         self.right = None
   7:         self.parent = None
   8:     
   9:     def __repr__(self):
--------------------------------------------------------------------------------
[0.09133 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
>       assert var_0.left is None
E       AttributeError: 'Node' object has no attribute 'left'

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:18: AttributeError

   - [#  24] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
   3:     def __init__(self, data):
   4:         self.data = data
   5:         self.left = None
   6:         self.right = None
-  7:         self.parent = None
+  7:         pass
   8:     
   9:     def __repr__(self):
  10:         return str(self.data)
  11: 
--------------------------------------------------------------------------------
[0.07790 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
>       assert var_0.parent is None
E       AttributeError: 'Node' object has no attribute 'parent'

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:20: AttributeError

   - [#  25] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
   6:         self.right = None
   7:         self.parent = None
   8:     
   9:     def __repr__(self):
- 10:         return str(self.data)
+ 10:         pass
  11: 
  12: class Bst(object):
  13:     
  14:     def __init__(self, root=None):
--------------------------------------------------------------------------------
[0.07054 s] survived

   - [#  26] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  11: 
  12: class Bst(object):
  13:     
  14:     def __init__(self, root=None):
- 15:         self.root = root
+ 15:         pass
  16:     
  17:     def insert(self, data):
  18:         if data is None:
  19:             raise TypeError('data cannot be None')
--------------------------------------------------------------------------------
[0.07756 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
>       var_0 = bst_0.insert(list_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree4.Bst object at 0x7fbedcc7f610>, data = [1568]

>   ???
E   AttributeError: 'Bst' object has no attribute 'root'

binarySearchTree4:20: AttributeError

   - [#  27] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  17:     def insert(self, data):
  18:         if data is None:
  19:             raise TypeError('data cannot be None')
  20:         if self.root is None:
- 21:             self.root = Node(data)
+ 21:             pass
  22:             return self.root
  23:         else:
  24:             return self._insert(self.root, data)
  25:     
--------------------------------------------------------------------------------
[0.07612 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
>       assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
E       AssertionError

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:15: AssertionError

   - [#  28] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  18:         if data is None:
  19:             raise TypeError('data cannot be None')
  20:         if self.root is None:
  21:             self.root = Node(data)
- 22:             return self.root
+ 22:             pass
  23:         else:
  24:             return self._insert(self.root, data)
  25:     
  26:     def _insert(self, node, data):
--------------------------------------------------------------------------------
[0.07471 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
E       AssertionError

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:16: AssertionError

   - [#  29] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  20:         if self.root is None:
  21:             self.root = Node(data)
  22:             return self.root
  23:         else:
- 24:             return self._insert(self.root, data)
+ 24:             pass
  25:     
  26:     def _insert(self, node, data):
  27:         if node is None:
  28:             return Node(data)
--------------------------------------------------------------------------------
[0.07636 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
>       assert f'{type(var_1.right).__module__}.{type(var_1.right).__qualname__}' == 'binarySearchTree4.Nod

   - [#  30] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  24:             return self._insert(self.root, data)
  25:     
  26:     def _insert(self, node, data):
  27:         if node is None:
- 28:             return Node(data)
+ 28:             pass
  29:         if data <= node.data:
  30:             if node.left is None:
  31:                 node.left = self._insert(node.left, data)
  32:                 node.left.parent = node
--------------------------------------------------------------------------------
[0.07505 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
>       var_3 = bst_3.insert(float_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SU

   - [#  31] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  27:         if node is None:
  28:             return Node(data)
  29:         if data <= node.data:
  30:             if node.left is None:
- 31:                 node.left = self._insert(node.left, data)
+ 31:                 pass
  32:                 node.left.parent = node
  33:                 return node.left
  34:             else:
  35:                 return self._insert(node.left, data)
--------------------------------------------------------------------------------
[0.07633 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.right

   - [#  32] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  28:             return Node(data)
  29:         if data <= node.data:
  30:             if node.left is None:
  31:                 node.left = self._insert(node.left, data)
- 32:                 node.left.parent = node
+ 32:                 pass
  33:                 return node.left
  34:             else:
  35:                 return self._insert(node.left, data)
  36:         
--------------------------------------------------------------------------------
[0.07654 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.right).__module__}.{t
