   - [#  33] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  29:         if data <= node.data:
  30:             if node.left is None:
  31:                 node.left = self._insert(node.left, data)
  32:                 node.left.parent = node
- 33:                 return node.left
+ 33:                 pass
  34:             else:
  35:                 return self._insert(node.left, data)
  36:         
  37:         elif node.right is None:
--------------------------------------------------------------------------------
[0.07776 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.right).__module__}

   - [#  34] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  31:                 node.left = self._insert(node.left, data)
  32:                 node.left.parent = node
  33:                 return node.left
  34:             else:
- 35:                 return self._insert(node.left, data)
+ 35:                 pass
  36:         
  37:         elif node.right is None:
  38:             node.right = self._insert(node.right, data)
  39:             node.right.parent = node
--------------------------------------------------------------------------------
[0.08187 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        bool_0 = True
        bst_0 = module_0.Bst()
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is True
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        var_1 = bst_0.insert(bool_0)
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_1.parent).__module__}.{type(var_1.parent).__qualname__}' == 'binarySearchTree4.Node'
        var_2 = bst_0.insert(bool_0)
>       assert f'{type(var_1.left).__module__}.{type(var_1.left).__qualname__}' == 'binarySearchTree4.Node'
E       AssertionError

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:108: AssertionError

   - [#  35] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  34:             else:
  35:                 return self._insert(node.left, data)
  36:         
  37:         elif node.right is None:
- 38:             node.right = self._insert(node.right, data)
+ 38:             pass
  39:             node.right.parent = node
  40:             return node.right
  41:         else:
  42:             return self._insert(node.right, data)
--------------------------------------------------------------------------------
[0.07521 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
>       var_3 = bst_3.insert(float_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py

   - [#  36] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  35:                 return self._insert(node.left, data)
  36:         
  37:         elif node.right is None:
  38:             node.right = self._insert(node.right, data)
- 39:             node.right.parent = node
+ 39:             pass
  40:             return node.right
  41:         else:
  42:             return self._insert(node.right, data)
--------------------------------------------------------------------------------
[0.07870 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.right).__module__}.{type(var_1.right).__qualname__}' =

   - [#  37] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  36:         
  37:         elif node.right is None:
  38:             node.right = self._insert(node.right, data)
  39:             node.right.parent = node
- 40:             return node.right
+ 40:             pass
  41:         else:
  42:             return self._insert(node.right, data)
--------------------------------------------------------------------------------
[0.07757 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.right).__module__}.{type(var_1.right).__qualname__}' == 'binarySearchTree4.Node'
>       assert f'{type(var_3.par

   - [#  38] SDL binarySearchTree4: 
--------------------------------------------------------------------------------
  38:             node.right = self._insert(node.right, data)
  39:             node.right.parent = node
  40:             return node.right
  41:         else:
- 42:             return self._insert(node.right, data)
+ 42:             pass
--------------------------------------------------------------------------------
[0.07787 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.right).__module__}.{type(var_1.right).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_3.parent).__module__}.{type(var_3.parent).__qualname__}' ==

   - [#  43] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
   6:         self.right = None
   7:         self.parent = None
   8:     
   9:     def __repr__(self):
- 10:         return str(self.data)
+ 10:         return str(data)
  11: 
  12: class Bst(object):
  13:     
  14:     def __init__(self, root=None):
--------------------------------------------------------------------------------
[0.07682 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
>       var_2 = node_1.__repr__()

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'data' is not defined") raised in repr()] Nod

   - [#  45] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  16:     
  17:     def insert(self, data):
  18:         if data is None:
  19:             raise TypeError('data cannot be None')
- 20:         if self.root is None:
+ 20:         if root is None:
  21:             self.root = Node(data)
  22:             return self.root
  23:         else:
  24:             return self._insert(self.root, data)
--------------------------------------------------------------------------------
[0.07636 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
>       var_0 = bst_0.insert(list_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree4.Bst object at 0x7fbedcb1f490>, data = [1568]

>   ???
E   NameError: name 'root' is not defined

binarySearchTree4:20: NameError

   - [#  47] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  18:         if data is None:
  19:             raise TypeError('data cannot be None')
  20:         if self.root is None:
  21:             self.root = Node(data)
- 22:             return self.root
+ 22:             return root
  23:         else:
  24:             return self._insert(self.root, data)
  25:     
  26:     def _insert(self, node, data):
--------------------------------------------------------------------------------
[0.08960 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
>       var_0 = bst_0.insert(list_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree4.Bst object at 0x7fbedca25930>, data = [1568]

>   ???
E   NameError: name 'root' is not defined

binarySearchTree4:22: NameError

   - [#  48] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  20:         if self.root is None:
  21:             self.root = Node(data)
  22:             return self.root
  23:         else:
- 24:             return self._insert(self.root, data)
+ 24:             return _insert(self.root, data)
  25:     
  26:     def _insert(self, node, data):
  27:         if node is None:
  28:             return Node(data)
--------------------------------------------------------------------------------
[0.08888 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
>       var_3 = bst_3.insert(float_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:30: 
_ _ _ _ _ _ _ _

   - [#  49] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  20:         if self.root is None:
  21:             self.root = Node(data)
  22:             return self.root
  23:         else:
- 24:             return self._insert(self.root, data)
+ 24:             return self._insert(root, data)
  25:     
  26:     def _insert(self, node, data):
  27:         if node is None:
  28:             return Node(data)
--------------------------------------------------------------------------------
[0.07491 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
>       var_3 = bst_3.insert(float_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:30: 
_ _ _ _ _ _ _ _

   - [#  50] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  27:         if node is None:
  28:             return Node(data)
  29:         if data <= node.data:
  30:             if node.left is None:
- 31:                 node.left = self._insert(node.left, data)
+ 31:                 node.left = _insert(node.left, data)
  32:                 node.left.parent = node
  33:                 return node.left
  34:             else:
  35:                 return self._insert(node.left, data)
--------------------------------------------------------------------------------
[0.07612 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)

   - [#  51] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  31:                 node.left = self._insert(node.left, data)
  32:                 node.left.parent = node
  33:                 return node.left
  34:             else:
- 35:                 return self._insert(node.left, data)
+ 35:                 return _insert(node.left, data)
  36:         
  37:         elif node.right is None:
  38:             node.right = self._insert(node.right, data)
  39:             node.right.parent = node
--------------------------------------------------------------------------------
[0.07987 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        bool_0 = True
        bst_0 = module_0.Bst()
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is True
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        var_1 = bst_0.insert(bool_0)
        assert f'{type(var_0.left).__module__}.{type(var_0.left).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_1.parent).__module__}.{type(var_1.parent).__qualname__}' == 'binarySearchTree4.Node'
>       var_2 = bst_0.insert(bool_0)

DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py:107: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree4:24: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binarySearchTree4.Bst object at 0x7f

   - [#  52] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  34:             else:
  35:                 return self._insert(node.left, data)
  36:         
  37:         elif node.right is None:
- 38:             node.right = self._insert(node.right, data)
+ 38:             node.right = _insert(node.right, data)
  39:             node.right.parent = node
  40:             return node.right
  41:         else:
  42:             return self._insert(node.right, data)
--------------------------------------------------------------------------------
[0.07366 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
>       var_3 = bst_3.insert(float_0)

DYNAMOSA-WHOLE_SUITE/tes

   - [#  53] SVD binarySearchTree4: 
--------------------------------------------------------------------------------
  38:             node.right = self._insert(node.right, data)
  39:             node.right.parent = node
  40:             return node.right
  41:         else:
- 42:             return self._insert(node.right, data)
+ 42:             return _insert(node.right, data)
--------------------------------------------------------------------------------
[0.08746 s] killed by DYNAMOSA-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst()
        bst_2 = module_0.Bst()
        bst_3 = module_0.Bst()
        bool_0 = False
        int_0 = 1568
        list_0 = [int_0]
        complex_0 = -46.48 + 1184.7075j
        var_0 = bst_0.insert(list_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == [1568]
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(complex_0)
        complex_1 = 982.226 + 1493.681249j
        var_1 = bst_3.insert(bool_0)
        assert f'{type(bst_3.root).__module__}.{type(bst_3.root).__qualname__}' == 'binarySearchTree4.Node'
        float_0 = 1099.91
        tuple_0 = (complex_1, float_0)
        none_type_0 = None
        node_1 = module_0.Node(tuple_0)
        var_2 = node_1.__repr__()
        var_3 = bst_3.insert(float_0)
        assert f'{type(var_1.right).__module__}.{type(var_1.right).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_3.parent).__module__}.{type(var
