   - [#   1] CDI binarySearchTree4: 
--------------------------------------------------------------------------------
   1: class Node(object):
   2:     
-  3:     def __init__(self, data):
-  4:         self.data = data
-  5:         self.left = None
-  6:         self.right = None
-  7:         self.parent = None
-  8:     
+  3:     @classmethod
+  4:     def __init__(self, data):
+  5:         self.data = data
+  6:         self.left = None
+  7:         self.right = None
+  8:         self.parent = None
   9:     def __repr__(self):
  10:         return str(self.data)
  11: 
  12: class Bst(object):
--------------------------------------------------------------------------------
[0.07792 s] killed by MIO-MOSA-WHOLE_SUITE/test_binarySearchTree4_MOSA.py::test_case_6

def test_case_6():
        bool_0 = False
        bst_0 = module_0.Bst()
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is False
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        int_0 = -1820
        node_0 = module_0.Node(int_0)
        var_1 = var_0.__repr__()
        node_1 = module_0.Node(node_0)
>       var_2 = node_1.__repr__()

MIO-MOSA-WHOLE_SUITE/test_binarySearchTree4_MOSA.py:64: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree4:10: in __repr__
    ???
binarySearchTree4:10: in __repr__
    ???
