   - [#   1] ASR identifier1: 
--------------------------------------------------------------------------------
  29:                 while i < len(s):
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
- 33:                     i += 1
+ 33:                     i -= 1
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
  35:                 return True
  36:             else:
  37:                 return False
--------------------------------------------------------------------------------
[0.07075 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
>       var_0 = identifier_0.validateIdentifier(str_0)

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <identifier1.Identifier object at 0x7f36d99d2290>, s = 'i8'

>   ???
E   IndexError: string index out of range

identifier1:30: IndexError

   - [#   2] CDI identifier1: 
--------------------------------------------------------------------------------
   1: 
   2: class Identifier(object):
   3:     ''' generated source for class Identifier '''
   4:     
-  5:     def valid_s(self, ch):
-  6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
-  8:             return True
-  9:         else:
- 10:             return False
- 11:     
+  5:     @classmethod
+  6:     def valid_s(self, ch):
+  7:         ''' generated source for method valid_s '''
+  8:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  9:             return True
+ 10:         else:
+ 11:             return False
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
  14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
--------------------------------------------------------------------------------
[0.06886 s] survived

   - [#   3] CDI identifier1: 
--------------------------------------------------------------------------------
   8:             return True
   9:         else:
  10:             return False
  11:     
- 12:     def valid_f(self, ch):
- 13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
- 15:             return True
- 16:         else:
- 17:             return False
- 18:     
+ 12:     @classmethod
+ 13:     def valid_f(self, ch):
+ 14:         ''' generated source for method valid_f '''
+ 15:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 16:             return True
+ 17:         else:
+ 18:             return False
  19:     def validateIdentifier(self, s):
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
  22:         valid_id = False
--------------------------------------------------------------------------------
[0.06768 s] survived

   - [#   5] COD identifier1: 
--------------------------------------------------------------------------------
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
  30:                     achar = s[i]
- 31:                     if not (self.valid_f(achar)):
+ 31:                     if self.valid_f(achar):
  32:                         valid_id = False
  33:                     i += 1
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
  35:                 return True
--------------------------------------------------------------------------------
[0.07623 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#   6] COI identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if not (((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z'))):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07553 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#   7] COI identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if not (((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9'))):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07513 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#   8] COI identifier1: 
--------------------------------------------------------------------------------
  19:     def validateIdentifier(self, s):
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
  22:         valid_id = False
- 23:         if len(s) > 0:
+ 23:         if not (len(s) > 0):
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
--------------------------------------------------------------------------------
[0.07675 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#   9] COI identifier1: 
--------------------------------------------------------------------------------
  22:         valid_id = False
  23:         if len(s) > 0:
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
- 26:             if len(s) > 1:
+ 26:             if not (len(s) > 1):
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
  30:                     achar = s[i]
--------------------------------------------------------------------------------
[0.07811 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  10] COI identifier1: 
--------------------------------------------------------------------------------
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
  28:                 i = 1
- 29:                 while i < len(s):
+ 29:                 while not (i < len(s)):
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
--------------------------------------------------------------------------------
[0.07879 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  11] COI identifier1: 
--------------------------------------------------------------------------------
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
  30:                     achar = s[i]
- 31:                     if not (self.valid_f(achar)):
+ 31:                     if not ((not (self.valid_f(achar)))):
  32:                         valid_id = False
  33:                     i += 1
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
  35:                 return True
--------------------------------------------------------------------------------
[0.07634 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  12] COI identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if not ((valid_id and len(s) >= 1 and len(s) <= 6)):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.07751 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  13] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'mutpy' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07700 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_8

def test_case_8():
        str_0 = 'Y'
        list_0 = []
        identifier_0 = module_0.Identifier(*list_0)
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:59: AssertionError

   - [#  14] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= '' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07753 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_4

def test_case_4():
        str_0 = '!W'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:30: AssertionError

   - [#  15] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'mutpy') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.06840 s] survived

   - [#  16] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= '') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07761 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_8

def test_case_8():
        str_0 = 'Y'
        list_0 = []
        identifier_0 = module_0.Identifier(*list_0)
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:59: AssertionError

   - [#  17] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'mutpy' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07682 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  18] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= '' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07898 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_4

def test_case_4():
        str_0 = '!W'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:30: AssertionError

   - [#  19] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'mutpy')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07984 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_5

def test_case_5():
        str_0 = 't'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:36: AssertionError

   - [#  20] CRP identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= '')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07526 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  21] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'mutpy' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.08728 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py::test_case_6

def test_case_6():
        identifier_0 = module_0.Identifier()
        str_0 = 'HI8ft5A\x0bj%%;.q.1@'
        var_0 = identifier_0.valid_f(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py:44: AssertionError

   - [#  22] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= '' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.08067 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_6

def test_case_6():
        str_0 = "w'"
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:42: AssertionError

   - [#  23] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'mutpy') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.09072 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  24] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= '') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.10059 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py::test_case_6

def test_case_6():
        identifier_0 = module_0.Identifier()
        str_0 = 'HI8ft5A\x0bj%%;.q.1@'
        var_0 = identifier_0.valid_f(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py:44: AssertionError

   - [#  25] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'mutpy' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07454 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_1

def test_case_1():
        str_0 = 'ij'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:15: AssertionError

   - [#  26] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= '' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07714 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  27] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'mutpy') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.08584 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py::test_case_4

def test_case_4():
        str_0 = 'y'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_f(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py:32: AssertionError

   - [#  28] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= '') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07756 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_1

def test_case_1():
        str_0 = 'ij'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:15: AssertionError

   - [#  29] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= 'mutpy' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07667 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  30] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.08099 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_6

def test_case_6():
        str_0 = "w'"
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:42: AssertionError

   - [#  31] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= 'mutpy')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07824 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  32] CRP identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07546 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError
