   - [#  33] CRP identifier1: 
--------------------------------------------------------------------------------
  19:     def validateIdentifier(self, s):
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
  22:         valid_id = False
- 23:         if len(s) > 0:
+ 23:         if len(s) > 1:
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
--------------------------------------------------------------------------------
[0.07922 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_5

def test_case_5():
        str_0 = 't'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:36: AssertionError

   - [#  34] CRP identifier1: 
--------------------------------------------------------------------------------
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
  22:         valid_id = False
  23:         if len(s) > 0:
- 24:             achar = s[0]
+ 24:             achar = s[1]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
  28:                 i = 1
--------------------------------------------------------------------------------
[0.07710 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  39] CRP identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if (valid_id and len(s) >= 2 and len(s) <= 6):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.08052 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_5

def test_case_5():
        str_0 = 't'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:36: AssertionError

   - [#  40] CRP identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if (valid_id and len(s) >= 1 and len(s) <= 7):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.09337 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_MOSA.py::test_case_10

def test_case_10():
        str_0 = 'e6iczLE'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_MOSA.py:73: AssertionError

   - [#  41] LCR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') and (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07649 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  42] LCR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' or ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.08023 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_4

def test_case_4():
        str_0 = '!W'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:30: AssertionError

   - [#  43] LCR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' or ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07945 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_4

def test_case_4():
        str_0 = '!W'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:30: AssertionError

   - [#  44] LCR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') and (ch >= 'a' and ch <= 'z') and (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07640 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  45] LCR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' or ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07870 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  46] LCR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' or ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07752 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  47] LCR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' or ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07844 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  48] LCR identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if (valid_id or len(s) >= 1 or len(s) <= 6):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.08053 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  49] OIL identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
- 35:                 return True
- 36:             else:
- 37:                 return False
+ 34:                     break
+ 35:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 36:                 return True
+ 37:             else:return False
  38:         else:
  39:             return False
--------------------------------------------------------------------------------
[0.09245 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_7

def test_case_7():
        str_0 = 'i8='
        str_1 = 'j'
        dict_0 = {}
        identifier_0 = module_0.Identifier(**dict_0)
        var_0 = identifier_0.validateIdentifier(str_1)
        assert var_0 is True
        var_1 = identifier_0.validateIdentifier(str_0)
>       assert var_1 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:52: AssertionError

   - [#  50] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch <= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.08865 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_4

def test_case_4():
        str_0 = '!W'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:30: AssertionError

   - [#  51] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch > 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.06768 s] survived

   - [#  52] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch >= 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07758 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_8

def test_case_8():
        str_0 = 'Y'
        list_0 = []
        identifier_0 = module_0.Identifier(*list_0)
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:59: AssertionError

   - [#  53] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch < 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.06888 s] survived

   - [#  54] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch <= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07675 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  55] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch > 'a' and ch <= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07043 s] survived

   - [#  56] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch >= 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07655 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  57] ROR identifier1: 
--------------------------------------------------------------------------------
   3:     ''' generated source for class Identifier '''
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
-  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
+  7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch < 'z')):
   8:             return True
   9:         else:
  10:             return False
  11:     
--------------------------------------------------------------------------------
[0.07012 s] survived

   - [#  58] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch <= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07940 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_6

def test_case_6():
        str_0 = "w'"
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:42: AssertionError

   - [#  59] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch > 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.06993 s] survived

   - [#  60] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch >= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07950 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  61] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch < 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.06877 s] survived

   - [#  62] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch <= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07706 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_1

def test_case_1():
        str_0 = 'ij'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:15: AssertionError

   - [#  63] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch > 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.06826 s] survived

   - [#  64] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch >= 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07717 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_1

def test_case_1():
        str_0 = 'ij'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:15: AssertionError

   - [#  65] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch < 'z') or (ch >= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.09269 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_MOSA.py::test_case_8

def test_case_8():
        str_0 = 'e6zLE'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_MOSA.py:55: AssertionError

   - [#  66] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch <= '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07365 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  67] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch > '0' and ch <= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.06945 s] survived

   - [#  68] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch >= '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.07608 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  69] ROR identifier1: 
--------------------------------------------------------------------------------
  10:             return False
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
- 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
+ 14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch < '9')):
  15:             return True
  16:         else:
  17:             return False
  18:     
--------------------------------------------------------------------------------
[0.09006 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_MOSA.py::test_case_0

def test_case_0():
        identifier_0 = module_0.Identifier()
        str_0 = 'H9'
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_MOSA.py:9: AssertionError
