   - [#  70] ROR identifier1: 
--------------------------------------------------------------------------------
  19:     def validateIdentifier(self, s):
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
  22:         valid_id = False
- 23:         if len(s) > 0:
+ 23:         if len(s) < 0:
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
--------------------------------------------------------------------------------
[0.07556 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  71] ROR identifier1: 
--------------------------------------------------------------------------------
  19:     def validateIdentifier(self, s):
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
  22:         valid_id = False
- 23:         if len(s) > 0:
+ 23:         if len(s) >= 0:
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
--------------------------------------------------------------------------------
[0.07966 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_8

def test_case_8():
        str_0 = 'Y'
        list_0 = []
        identifier_0 = module_0.Identifier(*list_0)
        var_0 = identifier_0.validateIdentifier(str_0)
        assert var_0 is True
>       var_1 = identifier_0.validateIdentifier(list_0)

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <identifier1.Identifier object at 0x7f36d99d23e0>, s = []

>   ???
E   IndexError: list index out of range

identifier1:24: IndexError

   - [#  76] ROR identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if (valid_id and len(s) <= 1 and len(s) <= 6):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.08863 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  77] ROR identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if (valid_id and len(s) > 1 and len(s) <= 6):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.09273 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_5

def test_case_5():
        str_0 = 't'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:36: AssertionError

   - [#  78] ROR identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if (valid_id and len(s) >= 1 and len(s) >= 6):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.07573 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  79] ROR identifier1: 
--------------------------------------------------------------------------------
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
- 34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
+ 34:             if (valid_id and len(s) >= 1 and len(s) < 6):
  35:                 return True
  36:             else:
  37:                 return False
  38:         else:
--------------------------------------------------------------------------------
[0.06925 s] survived

   - [#  83] SDL identifier1: 
--------------------------------------------------------------------------------
   4:     
   5:     def valid_s(self, ch):
   6:         ''' generated source for method valid_s '''
   7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
-  8:             return True
+  8:             pass
   9:         else:
  10:             return False
  11:     
  12:     def valid_f(self, ch):
--------------------------------------------------------------------------------
[0.07643 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  84] SDL identifier1: 
--------------------------------------------------------------------------------
   6:         ''' generated source for method valid_s '''
   7:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z')):
   8:             return True
   9:         else:
- 10:             return False
+ 10:             pass
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
  14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
--------------------------------------------------------------------------------
[0.08374 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py::test_case_1

def test_case_1():
        str_0 = ''
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_s(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_MIO.py:14: AssertionError

   - [#  85] SDL identifier1: 
--------------------------------------------------------------------------------
  11:     
  12:     def valid_f(self, ch):
  13:         ''' generated source for method valid_f '''
  14:         if ((ch >= 'A' and ch <= 'Z') or (ch >= 'a' and ch <= 'z') or (ch >= '0' and ch <= '9')):
- 15:             return True
+ 15:             pass
  16:         else:
  17:             return False
  18:     
  19:     def validateIdentifier(self, s):
--------------------------------------------------------------------------------
[0.07752 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  87] SDL identifier1: 
--------------------------------------------------------------------------------
  17:             return False
  18:     
  19:     def validateIdentifier(self, s):
  20:         ''' generated source for method validateIdentifier '''
- 21:         achar = str()
+ 21:         pass
  22:         valid_id = False
  23:         if len(s) > 0:
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
--------------------------------------------------------------------------------
[0.06921 s] survived

   - [#  88] SDL identifier1: 
--------------------------------------------------------------------------------
  18:     
  19:     def validateIdentifier(self, s):
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
- 22:         valid_id = False
+ 22:         pass
  23:         if len(s) > 0:
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
--------------------------------------------------------------------------------
[0.06776 s] survived

   - [#  89] SDL identifier1: 
--------------------------------------------------------------------------------
  20:         ''' generated source for method validateIdentifier '''
  21:         achar = str()
  22:         valid_id = False
  23:         if len(s) > 0:
- 24:             achar = s[0]
+ 24:             pass
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
  28:                 i = 1
--------------------------------------------------------------------------------
[0.07287 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  90] SDL identifier1: 
--------------------------------------------------------------------------------
  21:         achar = str()
  22:         valid_id = False
  23:         if len(s) > 0:
  24:             achar = s[0]
- 25:             valid_id = self.valid_s(achar)
+ 25:             pass
  26:             if len(s) > 1:
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
--------------------------------------------------------------------------------
[0.07564 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  91] SDL identifier1: 
--------------------------------------------------------------------------------
  23:         if len(s) > 0:
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
- 27:                 achar = s[1]
+ 27:                 pass
  28:                 i = 1
  29:                 while i < len(s):
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
--------------------------------------------------------------------------------
[0.06856 s] survived

   - [#  92] SDL identifier1: 
--------------------------------------------------------------------------------
  24:             achar = s[0]
  25:             valid_id = self.valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
- 28:                 i = 1
+ 28:                 pass
  29:                 while i < len(s):
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
--------------------------------------------------------------------------------
[0.07453 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
>       var_0 = identifier_0.validateIdentifier(str_0)

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <identifier1.Identifier object at 0x7f36d9b22110>, s = 'i8'

>   ???
E   UnboundLocalError: local variable 'i' referenced before assignment

identifier1:29: UnboundLocalError

   - [#  93] SDL identifier1: 
--------------------------------------------------------------------------------
  26:             if len(s) > 1:
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
- 30:                     achar = s[i]
+ 30:                     pass
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
--------------------------------------------------------------------------------
[0.08006 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_7

def test_case_7():
        str_0 = 'i8='
        str_1 = 'j'
        dict_0 = {}
        identifier_0 = module_0.Identifier(**dict_0)
        var_0 = identifier_0.validateIdentifier(str_1)
        assert var_0 is True
        var_1 = identifier_0.validateIdentifier(str_0)
>       assert var_1 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:52: AssertionError

   - [#  94] SDL identifier1: 
--------------------------------------------------------------------------------
  28:                 i = 1
  29:                 while i < len(s):
  30:                     achar = s[i]
  31:                     if not (self.valid_f(achar)):
- 32:                         valid_id = False
+ 32:                         pass
  33:                     i += 1
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
  35:                 return True
  36:             else:
--------------------------------------------------------------------------------
[0.07875 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError

   - [#  95] SDL identifier1: 
--------------------------------------------------------------------------------
  31:                     if not (self.valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
- 35:                 return True
+ 35:                 pass
  36:             else:
  37:                 return False
  38:         else:
  39:             return False
--------------------------------------------------------------------------------
[0.07689 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:9: AssertionError

   - [#  98] SVD identifier1: 
--------------------------------------------------------------------------------
  21:         achar = str()
  22:         valid_id = False
  23:         if len(s) > 0:
  24:             achar = s[0]
- 25:             valid_id = self.valid_s(achar)
+ 25:             valid_id = valid_s(achar)
  26:             if len(s) > 1:
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
--------------------------------------------------------------------------------
[0.07378 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
>       var_0 = identifier_0.validateIdentifier(str_0)

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <identifier1.Identifier object at 0x7f36d99bb610>, s = 'i8'

>   ???
E   NameError: name 'valid_s' is not defined

identifier1:25: NameError

   - [#  99] SVD identifier1: 
--------------------------------------------------------------------------------
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
  30:                     achar = s[i]
- 31:                     if not (self.valid_f(achar)):
+ 31:                     if not (valid_f(achar)):
  32:                         valid_id = False
  33:                     i += 1
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
  35:                 return True
--------------------------------------------------------------------------------
[0.07376 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_0

def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
>       var_0 = identifier_0.validateIdentifier(str_0)

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <identifier1.Identifier object at 0x7f36d98c5a50>, s = 'i8'

>   ???
E   NameError: name 'valid_f' is not defined

identifier1:31: NameError

   - [# 100] ZIL identifier1: 
--------------------------------------------------------------------------------
  26:             if len(s) > 1:
  27:                 achar = s[1]
  28:                 i = 1
  29:                 while i < len(s):
- 30:                     achar = s[i]
- 31:                     if not (self.valid_f(achar)):
- 32:                         valid_id = False
- 33:                     i += 1
+ 30:                     break
+ 31:             
+ 32:             
+ 33:             
  34:             if (valid_id and len(s) >= 1 and len(s) <= 6):
  35:                 return True
  36:             else:
  37:                 return False
--------------------------------------------------------------------------------
[0.07680 s] killed by DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_identifier1_DYNAMOSA.py:24: AssertionError
