1 : Job ID 5ba52b9e451047e68ecd942b63cdc7d9
test outcome: killed
identifier1.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while i == len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.04s =========================

2 : Job ID d9f40c923e2c4d4a8648e2500d64c6f3
SURVIVED
test outcome: survived
identifier1.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while i != len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

3 : Job ID e3e29f7a03094dcb83d92ac4a6c90adb
test outcome: killed
identifier1.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while i <= len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF.FF.FF.F.F           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py F..F.F...F..        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_9 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_11 - Inde...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_

4 : Job ID 969aa706b21b4a878a8821e016cfba3e
test outcome: killed
identifier1.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while i > len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.05s =========================

5 : Job ID 7c04a208fadf400fb11ad89a78a3ac72
test outcome: killed
identifier1.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while i >= len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.05s =========================

6 : Job ID f1afce60fecd42e6b9dfeff7de41e2e9
test outcome: killed
identifier1.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while i is len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.04s =========================

7 : Job ID cbbea3ad35ea47478dc4a92fe2a2c81d
SURVIVED
test outcome: survived
identifier1.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while i is not len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

8 : Job ID d406ae82d6bf48009a393174a3af069d
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch == 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

9 : Job ID 3cb096c56f564640a40046885cd26497
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch == 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 5 failed, 19 passed in 0.05s =========================

10 : Job ID a400ac2dc87e4915b04d7a9a0ca7131c
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch == 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

11 : Job ID 0eaae8ad6f5b4e88b1326a3bb61fafc9
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch == 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 2 failed, 22 passed in 0.04s =========================

12 : Job ID df67086c75554e7d80b282dd7f9195fc
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch == '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F...........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

13 : Job ID f0d34a6957574d54a5b65010cc44226f
test outcome: killed
identifier1.py, start pos: (34, 54), end pos: (34, 56)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) and (len(s) == 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

14 : Job ID 0aaa2025041b43f3a26bdd95d2db10c3
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch != 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ..........F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 2 failed, 22 passed in 0.04s =========================

15 : Job ID c4e58caeee0944e8a76c36e85c83fee4
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch != 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ..........F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 2 failed, 22 passed in 0.04s =========================

16 : Job ID 6f1bece3b3c6453188e161d9c2074a74
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch != 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

17 : Job ID ad3be33b91a4403391ac9c917b442caf
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch != 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

18 : Job ID fb98ac850e184018ad2b5e194296a3b1
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch != '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F...F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

19 : Job ID 598d76d26d514ee595655c3f218e548d
test outcome: killed
identifier1.py, start pos: (34, 54), end pos: (34, 56)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) and (len(s) != 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...........F           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 2 failed, 22 passed in 0.04s =========================

20 : Job ID 2975db1ba9774defbdadf015052ca55a
SURVIVED
test outcome: survived
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch < 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

21 : Job ID 736b026d6b394adf9cad08544de7dcc8
SURVIVED
test outcome: survived
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch < 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

22 : Job ID a2937f743e154ef9a3cc1f57fe12dfdc
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch < 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

23 : Job ID 3c338095236b4412b6665ee30fa706d8
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch < 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

24 : Job ID 32deecd350b04a5c93365be20ccb56d8
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch < '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

25 : Job ID fff6b500ad8a4bc387cdd7c7a837fd71
SURVIVED
test outcome: survived
identifier1.py, start pos: (34, 54), end pos: (34, 56)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) and (len(s) < 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.05s ==============================

26 : Job ID 4ec042bc0195402ab9ab0deadd95dacd
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch > 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 3 failed, 21 passed in 0.05s =========================

27 : Job ID 7ebdf8899238449f97a1bfa964cac0f5
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch > 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.F..F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 7 failed, 17 passed in 0.05s =========================

28 : Job ID 7b5c55b268714acdbb23af9c7732d4e2
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch > 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
========================= 1 failed, 23 passed in 0.04s =========================
