29 : Job ID f661d97c28bc49428de38f3eb1fcd155
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch > 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 2 failed, 22 passed in 0.05s =========================

30 : Job ID 70b6a08bacf14c088667b4208da26d58
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch > '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F..F........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
========================= 2 failed, 22 passed in 0.05s =========================

31 : Job ID ebab04aebd6f4369860a399a0af2c1cc
test outcome: killed
identifier1.py, start pos: (34, 54), end pos: (34, 56)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) and (len(s) > 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF..F           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....FF.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 8

32 : Job ID 4c3f5416d4214746920d66a47b9840be
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch >= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 3 failed, 21 passed in 0.04s =========================

33 : Job ID db33aabdd3254be79a446d7cfb2a6c27
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch >= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.F..F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 7 failed, 17 passed in 0.05s =========================

34 : Job ID ce2fae495bfb4fa7ae682fc405091fcf
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch >= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

35 : Job ID de80ab4763a34c988f9381b15e80c50d
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch >= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 2 failed, 22 passed in 0.04s =========================

36 : Job ID 47e1db76e37b497c81212c3d2fc41c33
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch >= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F..F........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

37 : Job ID 79765f935b9449e4a19eea3df61aecdd
test outcome: killed
identifier1.py, start pos: (34, 54), end pos: (34, 56)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) and (len(s) >= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF..F           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....FF.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
=========================

38 : Job ID a10f5b94d360447fa0dd976719c1b8f2
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.04s ====================

39 : Job ID c945cd2af208475391507f25db2a2a02
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED

40 : Job ID 0a832906f48847b6bd7fcb9767cf7e17
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 24 passed, 1 warning in 0.04s =========================

41 : Job ID 2c9c8359d2d946cca7400a949448a106
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
=================== 2 failed, 22 passed, 1 warning in 0.07s ====

42 : Job ID a2599e9a1dd943e5a4e531bb78a26010
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F...........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.05s ====================

43 : Job ID aec0207f7dfc4ec798433379502d5bcd
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ..........F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
=================== 2 failed, 22 passed, 1 warning in 0.05s ====================

44 : Job ID dd248d270dc8487ca8071d4a4033bf66
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ..........F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
=================== 2 failed, 22 passed, 1 warning in 0.04s ====================

45 : Job ID f4c0993338134f309336dcc44857870f
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.05s ====================

46 : Job ID 1d7a8b66e3ef46c1be185ab56fe08f8c
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 24 passed, 1 warning in 0.05s =========================

47 : Job ID 628cbf8cfa29432b8e95f2b8146daeef
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is not '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F...F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is not '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
=================== 2 failed, 22 passed, 1 warni

48 : Job ID bb7de1e8b8244a95a632d8153172caa3
test outcome: killed
identifier1.py, start pos: (23, 19), end pos: (23, 20)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if (len(s) == 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ..F...F...F.        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_2 - In...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_10 - K...
========================= 8 failed, 16 passed in 0.05s =========================

49 : Job ID 3b8c64da79e1471b97ca566b83128879
test outcome: killed
identifier1.py, start pos: (26, 22), end pos: (26, 23)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if len(s) == 1:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F.FFFF.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - Inde...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - In...
========================= 7 failed, 17 passed in 0.05s =========================

50 : Job ID e3ce64014f9c4495a9b9d25059938f36
SURVIVED
test outcome: survived
identifier1.py, start pos: (23, 19), end pos: (23, 20)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if (len(s) != 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

51 : Job ID 8d5380abfde84597a482b28a91d7f1c5
SURVIVED
test outcome: survived
identifier1.py, start pos: (26, 22), end pos: (26, 23)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if len(s) != 1:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================
