52 : Job ID ddd413dac6654a359b01925eaadd544d
test outcome: killed
identifier1.py, start pos: (23, 19), end pos: (23, 20)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if (len(s) < 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

53 : Job ID 83122b6b1d694970b5c81beab6ec8c3e
test outcome: killed
identifier1.py, start pos: (26, 22), end pos: (26, 23)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if len(s) < 1:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.05s =========================

54 : Job ID 886f77560ba2424aa6e918081ac787c8
test outcome: killed
identifier1.py, start pos: (23, 19), end pos: (23, 20)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if (len(s) <= 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ..F...F...F.        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_2 - In...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_10 - K...
========================= 8 failed, 16 passed in 0.05s =========================

55 : Job ID d4d2b85761804bdba972c0103d78091b
test outcome: killed
identifier1.py, start pos: (26, 22), end pos: (26, 23)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if len(s) <= 1:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F.FFFF.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - Inde...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - In...
========================= 7 failed, 17 passed in 0.05s =========================

56 : Job ID 3e05e466968c4b6a9b83b7308c950d1c
test outcome: killed
identifier1.py, start pos: (23, 19), end pos: (23, 20)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if (len(s) >= 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ..F.......F.        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_2 - In...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_10 - K...
========================= 3 failed, 21 passed in 0.04s =========================

57 : Job ID a5187cd0368d4177bbec9493a5a6fdcf
test outcome: killed
identifier1.py, start pos: (26, 22), end pos: (26, 23)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if len(s) >= 1:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .....F.FF.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - Inde...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - In...
========================= 5 failed, 19 passed in 0.05s =========================

58 : Job ID 3113432950074ec5a3a4eb30d617fab5
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch == 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

59 : Job ID fe2bc5ec45814da7be9db532ab94ec1b
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch == 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 5 failed, 19 passed in 0.05s =========================

60 : Job ID 9ca7321221ff4c5892c0628643ef5e60
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch == 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

61 : Job ID 1f512fda349848e88f1340a154312eaf
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch == 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 2 failed, 22 passed in 0.05s =========================

62 : Job ID 245cfd8976624702b9cd60da26bcb2f4
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch == '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F...........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
========================= 1 failed, 23 passed in 0.05s =========================

63 : Job ID bd98c5fb4970406492c43446c2f4c089
test outcome: killed
identifier1.py, start pos: (34, 36), end pos: (34, 38)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) == 1) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
========================= 2 failed, 22 passed in 0.05s =========================

64 : Job ID 003bb884f9304bd5b2113a84f4902a6d
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch != 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.......           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

65 : Job ID 56117408441d4115a6caf09a1a493559
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch != 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.......           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

66 : Job ID f84bfe1d2c644aeaa838be93af9bfe3d
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch != 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ......FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

67 : Job ID 965c15d96e9444849536094f324850f9
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch != 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.04s =========================

68 : Job ID 256e5416adfe44a2b29c407ac012bc09
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch != '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ......F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

69 : Job ID 6a4ea1e1d0b44ec89c55114e5744f529
test outcome: killed
identifier1.py, start pos: (34, 36), end pos: (34, 38)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) != 1) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .....F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 4 failed, 20 passed in 0.05s =========================

70 : Job ID 2d87093172da4d1a917b9ed001cd87a6
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch < 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F...F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

71 : Job ID 1864ffc7c1404320bb7faf26265b6ab1
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch < 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF..FF.F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

72 : Job ID e532e48266ff41db93a2a1361666b57b
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch < 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ......FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

73 : Job ID 2fbef67878e7467f939fc02853164066
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch < 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F.F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 5 failed, 19 passed in 0.05s =========================

74 : Job ID de0096f0bf634018aa91914c53fc5187
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch < '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F.....F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

75 : Job ID 46c730188af44c8cb8aa4d78d9d747b5
test outcome: killed
identifier1.py, start pos: (34, 36), end pos: (34, 38)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) < 1) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

76 : Job ID 55b750b3ce7642b9ade15aa7d8636364
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch <= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F...F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
========================= 2 failed, 22 passed in 0.05s =========================
