77 : Job ID 97b3b83d49084eb1a9f5d3d921124792
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch <= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF..FF.F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

78 : Job ID 93a3932791f4400d9cf1bce34cdaf57d
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch <= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ......FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 2 failed, 22 passed in 0.05s =========================

79 : Job ID 6d25aa477c45490695caec5874b532a0
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch <= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F.F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 5 failed, 19 passed in 0.05s =========================

80 : Job ID a3c692ee505040ce9a3d0a6c77227e49
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch <= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F.....F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

81 : Job ID d895cb3d8c74437db89089df1941cbe0
test outcome: killed
identifier1.py, start pos: (34, 36), end pos: (34, 38)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) <= 1) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
========================= 2 failed, 22 passed in 0.05s =========================

82 : Job ID 6794261e86414e419ef2d869cb28c143
SURVIVED
test outcome: survived
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch > 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

83 : Job ID fe9c27418e874b708354bcd9d6f9fff1
SURVIVED
test outcome: survived
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch > 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

84 : Job ID eb18e278131d4d6cae77cd6b1d6947fe
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch > 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

85 : Job ID 3530aba95d194bb6b7c254f4f0aa20ae
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch > 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

86 : Job ID e46f66c183cb410e96928a29fcabf701
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch > '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

87 : Job ID 56fc313c83df45198bde0e982ae133a1
test outcome: killed
identifier1.py, start pos: (34, 36), end pos: (34, 38)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) > 1) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .....F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 4 failed, 20 passed in 0.05s =========================

88 : Job ID ca702431ce674883984716a9febaf3d0
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.04s ====================

89 : Job ID 9060a7b6cfe843279365f9cde736c98f
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED

90 : Job ID 077315df083242259e765425021c9fc5
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 24 passed, 1 warning in 0.04s =========================

91 : Job ID f63b093760d74461b4f12e43bd6e61a7
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
=================== 2 failed, 22 passed, 1 warning in 0.05s ====

92 : Job ID c38a0f1971d94af484f77bdd0d94a001
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F...........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.04s ====================

93 : Job ID 92a9d687f11c44029a2a593e2c266b1b
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.......           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.05s ====================

94 : Job ID e78b14a1d5ee4fc0807f595a9b8e9522
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.......           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.04s ====================

95 : Job ID e81597ce109f482492019ff64e57a6eb
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ......FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
=================== 2 failed, 22 passed, 1 warnin

96 : Job ID fa14374c2f5f4cac80b55351d47b5d77
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNA

97 : Job ID 780324e15cc14d418f811f66f8e997cb
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ......F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
=================== 1 failed, 23 passed, 1 warning in 0.04s ====================

98 : Job ID b9c152427a094ece88ef304967842796
test outcome: killed
identifier1.py, start pos: (31, 23), end pos: (31, 26)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -28,7 +28,7 @@
                 i = 1
                 while i < len(s):
                     achar = s[i]
-                    if not self.valid_f(achar):
+                    if  self.valid_f(achar):
                         valid_id = False
                     i += 1
             if valid_id and (len(s) >= 1) and (len(s) <= 6):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF.F..F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
========================= 4 failed, 20 passed in 0.05s =========================

99 : Job ID c1c7a0ac402c47348c6944f2197f52e5
test outcome: killed
identifier1.py, start pos: (7, 11), end pos: (7, 73)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if not ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F...F.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 4 failed, 20 passed in 0.05s =========================

100 : Job ID 27d49829def342dbb10520fea6cac7dd
test outcome: killed
identifier1.py, start pos: (14, 11), end pos: (14, 106)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if not ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.04s =========================
