101 : Job ID ba29785d2b1c494b89a0f38b09cc5ef1
test outcome: killed
identifier1.py, start pos: (23, 11), end pos: (23, 23)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if not (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ..F...F...F.        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_2 - In...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_10 - K...
========================= 8 failed, 16 passed in 0.05s =========================

102 : Job ID 33a7211fc37b4aa580a8bba4d27bd4fa
test outcome: killed
identifier1.py, start pos: (26, 15), end pos: (26, 25)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if not len(s) > 1:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F.FFFF.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - Inde...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - In...
========================= 7 failed, 17 passed in 0.05s =========================

103 : Job ID 1b4203ee43ec42939de9f4eee82f4eca
test outcome: killed
identifier1.py, start pos: (29, 22), end pos: (29, 32)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -26,7 +26,7 @@
             if len(s) > 1:
                 achar = s[1]
                 i = 1
-                while i < len(s):
+                while not i < len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.05s =========================

104 : Job ID c6e0e3d9fd6a4ce2956e2b70aa2ac88b
test outcome: killed
identifier1.py, start pos: (31, 23), end pos: (31, 46)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -28,7 +28,7 @@
                 i = 1
                 while i < len(s):
                     achar = s[i]
-                    if not self.valid_f(achar):
+                    if not not self.valid_f(achar):
                         valid_id = False
                     i += 1
             if valid_id and (len(s) >= 1) and (len(s) <= 6):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF.F..F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
========================= 4 failed, 20 passed in 0.05s =========================

105 : Job ID 6fce2195027b46a5854149f12c3f8300
test outcome: killed
identifier1.py, start pos: (34, 15), end pos: (34, 59)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if not valid_id and (len(s) >= 1) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF.FFFFFFFF.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F..F..        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DY

106 : Job ID d2d38bf7ddb54f7b9d4b4ff8fb8134ab
test outcome: killed
identifier1.py, start pos: (8, 19), end pos: (8, 23)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -5,7 +5,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
         if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-            return True
+            return False
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

107 : Job ID 41a0782124b543928d08373d0ba8a8e8
test outcome: killed
identifier1.py, start pos: (15, 19), end pos: (15, 23)
operator: core/ReplaceTrueWithFalse, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -12,7 +12,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
         if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-            return True
+            return False
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 3 failed, 21 passed in 0.04s =========================

108 : Job ID 411b4b2932e84e5395c6fe9b7803885e
test outcome: killed
identifier1.py, start pos: (35, 23), end pos: (35, 27)
operator: core/ReplaceTrueWithFalse, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -32,7 +32,7 @@
                         valid_id = False
                     i += 1
             if valid_id and (len(s) >= 1) and (len(s) <= 6):
-                return True
+                return False
             else:
                 return False
         else:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

109 : Job ID 74e61911120741a9a02478792a6208e0
test outcome: killed
identifier1.py, start pos: (10, 19), end pos: (10, 24)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -7,7 +7,7 @@
         if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
-            return False
+            return True
     def valid_f(self, ch):
         """ generated source for method valid_f """
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.....F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 3 failed, 21 passed in 0.05s =========================

111 : Job ID f0c1c14bc8944810a7df3987a11d3eb4
SURVIVED
test outcome: survived
identifier1.py, start pos: (22, 19), end pos: (22, 24)
operator: core/ReplaceFalseWithTrue, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -19,7 +19,7 @@
     def validateIdentifier(self, s):
         """ generated source for method validateIdentifier """
         achar = str()
-        valid_id = False
+        valid_id = True
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

112 : Job ID 9577690946e74219a5fce2f4232cc47f
test outcome: killed
identifier1.py, start pos: (32, 35), end pos: (32, 40)
operator: core/ReplaceFalseWithTrue, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -29,7 +29,7 @@
                 while i < len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
-                        valid_id = False
+                        valid_id = True
                     i += 1
             if valid_id and (len(s) >= 1) and (len(s) <= 6):
                 return True
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF.F..           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .........F..        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_9 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_9 - as...
========================= 5 failed, 19 passed in 0.05s =========================

115 : Job ID d84bb0f722ad4cf8983562f70875939e
test outcome: killed
identifier1.py, start pos: (7, 24), end pos: (7, 27)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') or (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.....F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 3 failed, 21 passed in 0.04s =========================

116 : Job ID b5fbe17cc28145bcb2ad4d68d2e33703
test outcome: killed
identifier1.py, start pos: (7, 57), end pos: (7, 60)
operator: core/ReplaceAndWithOr, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') or (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.....F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_8 - as...
========================= 3 failed, 21 passed in 0.05s =========================

117 : Job ID fe1452e4175a4baaa29c6a50264d217e
test outcome: killed
identifier1.py, start pos: (14, 24), end pos: (14, 27)
operator: core/ReplaceAndWithOr, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') or (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.05s =========================

118 : Job ID 6f3069de088e4f38be416ca5b9fc360b
test outcome: killed
identifier1.py, start pos: (14, 57), end pos: (14, 60)
operator: core/ReplaceAndWithOr, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') or (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.06s =========================

119 : Job ID 519825d3521e4bc28335404bb45d1c8a
test outcome: killed
identifier1.py, start pos: (14, 90), end pos: (14, 93)
operator: core/ReplaceAndWithOr, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') or (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..FF....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 3 failed, 21 passed in 0.04s =========================

120 : Job ID cbf4df70083b4e0188f3fe192281eaae
test outcome: killed
identifier1.py, start pos: (34, 24), end pos: (34, 27)
operator: core/ReplaceAndWithOr, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id or (len(s) >= 1) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...FF.FF.FFF           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F...F..        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_9 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifie

121 : Job ID 61432da7dbcc448d9d33b23f0da440d5
test outcome: killed
identifier1.py, start pos: (34, 42), end pos: (34, 45)
operator: core/ReplaceAndWithOr, occurrence: 6
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) or (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...FF.FF.FFF           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F...F..        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_9 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifie

122 : Job ID 23ebf1c9611742b18bf061f6d19672c0
test outcome: killed
identifier1.py, start pos: (7, 41), end pos: (7, 43)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) and ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF...F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 6 failed, 18 passed in 0.05s =========================

123 : Job ID b72e8df0ae9543ee9f9dd040c7a581bb
test outcome: killed
identifier1.py, start pos: (14, 41), end pos: (14, 43)
operator: core/ReplaceOrWithAnd, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) and ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .F..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 2 failed, 22 passed in 0.05s =========================

124 : Job ID 0f0b043d1c6e4da18ecdd3b481d59357
test outcome: killed
identifier1.py, start pos: (14, 74), end pos: (14, 76)
operator: core/ReplaceOrWithAnd, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) and ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF..........           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 3 failed, 21 passed in 0.05s =========================

125 : Job ID 80eebdaea62d446ab801705f1c03230b
test outcome: killed
identifier1.py, start pos: (23, 21), end pos: (23, 22)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if (len(s) > 1):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .....F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 4 failed, 20 passed in 0.05s =========================

126 : Job ID 1f966d1b7a12426ca15dd11665b639bb
test outcome: killed
identifier1.py, start pos: (23, 21), end pos: (23, 22)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -20,7 +20,7 @@
         """ generated source for method validateIdentifier """
         achar = str()
         valid_id = False
-        if (len(s) > 0):
+        if (len(s) > -1):
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ..F.......F.        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_2 - In...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_10 - K...
========================= 3 failed, 21 passed in 0.05s =========================

127 : Job ID be6a7e9e2122421592c3af9080a35cc1
test outcome: killed
identifier1.py, start pos: (24, 22), end pos: (24, 23)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -21,7 +21,7 @@
         achar = str()
         valid_id = False
         if (len(s) > 0):
-            achar = s[0]
+            achar = s[ 1]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
                 achar = s[1]
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F...FF.FF.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - Inde...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - In...
========================= 7 failed, 17 passed in 0.05s =========================
