128 : Job ID 6b1252da2f9b41d7b2835554575a6fcb
test outcome: killed
identifier1.py, start pos: (24, 22), end pos: (24, 23)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -21,7 +21,7 @@
         achar = str()
         valid_id = False
         if (len(s) > 0):
-            achar = s[0]
+            achar = s[ -1]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
                 achar = s[1]
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py F...F.......           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - asser...
========================= 2 failed, 22 passed in 0.04s =========================

129 : Job ID 515fd2f2fdd3424fb1282ab90ed33ecd
test outcome: killed
identifier1.py, start pos: (26, 24), end pos: (26, 25)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if len(s) > 2:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
========================= 2 failed, 22 passed in 0.05s =========================

130 : Job ID dba300949ae942c288cafd5b52bbc9c3
test outcome: killed
identifier1.py, start pos: (26, 24), end pos: (26, 25)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -23,7 +23,7 @@
         if (len(s) > 0):
             achar = s[0]
             valid_id = self.valid_s(achar)
-            if len(s) > 1:
+            if len(s) > 0:
                 achar = s[1]
                 i = 1
                 while i < len(s):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .....F.FF.F.           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_10 - Inde...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - In...
========================= 5 failed, 19 passed in 0.05s =========================

131 : Job ID 0019f2a20be64234a1b9e6be45825448
test outcome: killed
identifier1.py, start pos: (27, 26), end pos: (27, 27)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -24,7 +24,7 @@
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
-                achar = s[1]
+                achar = s[ 2]
                 i = 1
                 while i < len(s):
                     achar = s[i]
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py FF.FF.F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .........F..        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_0 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_1 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_4 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - Index...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_9 - In...
========================= 6 failed, 18 passed in 0.05s =========================

132 : Job ID 9e45f81a3e69411c8ff515a37e3b6b1a
SURVIVED
test outcome: survived
identifier1.py, start pos: (27, 26), end pos: (27, 27)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -24,7 +24,7 @@
             achar = s[0]
             valid_id = self.valid_s(achar)
             if len(s) > 1:
-                achar = s[1]
+                achar = s[ 0]
                 i = 1
                 while i < len(s):
                     achar = s[i]
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

133 : Job ID c88b904ef46a46189e224d2968f56a84
test outcome: killed
identifier1.py, start pos: (28, 20), end pos: (28, 21)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -25,7 +25,7 @@
             valid_id = self.valid_s(achar)
             if len(s) > 1:
                 achar = s[1]
-                i = 1
+                i = 2
                 while i < len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ...F..F.....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_3 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_6 - asser...
========================= 2 failed, 22 passed in 0.05s =========================

134 : Job ID 5a0515fdf48b4895afe4b76cffc38353
SURVIVED
test outcome: survived
identifier1.py, start pos: (28, 20), end pos: (28, 21)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -25,7 +25,7 @@
             valid_id = self.valid_s(achar)
             if len(s) > 1:
                 achar = s[1]
-                i = 1
+                i = 0
                 while i < len(s):
                     achar = s[i]
                     if not self.valid_f(achar):
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.04s ==============================

135 : Job ID de78b9832e634d7299ddca242d7cd89f
test outcome: killed
identifier1.py, start pos: (33, 25), end pos: (33, 26)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -30,7 +30,7 @@
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
-                    i += 1
+                    i += 2
             if valid_id and (len(s) >= 1) and (len(s) <= 6):
                 return True
             else:
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .......F....           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
========================= 1 failed, 23 passed in 0.04s =========================

136 : Job ID 6e2d0d2a3881458099548ed32cbb9b68
test outcome: killed
identifier1.py, start pos: (33, 25), end pos: (33, 26)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -30,7 +30,7 @@
                     achar = s[i]
                     if not self.valid_f(achar):
                         valid_id = False
-                    i += 1
+                    i += 0
             if valid_id and (len(s) >= 1) and (len(s) <= 6):
                 return True
             else:
timeout

137 : Job ID a92c9b921cb94d28bdf4c121adb1d972
test outcome: killed
identifier1.py, start pos: (34, 39), end pos: (34, 40)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 2) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py .....F.FF...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_7 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_6 - as...
========================= 4 failed, 20 passed in 0.05s =========================

138 : Job ID c59e3589170b47e1ac9ace678e371366
SURVIVED
test outcome: survived
identifier1.py, start pos: (34, 39), end pos: (34, 40)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 0) and (len(s) <= 6):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.05s ==============================

139 : Job ID dd42c2f08d8a4031baa67f3d71419ad6
test outcome: killed
identifier1.py, start pos: (34, 57), end pos: (34, 58)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) and (len(s) <= 7):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py .....F......        [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py::test_case_5 - as...
========================= 1 failed, 23 passed in 0.05s =========================

140 : Job ID d50589c5d92f4004a919950dc69b8878
SURVIVED
test outcome: survived
identifier1.py, start pos: (34, 57), end pos: (34, 58)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -31,7 +31,7 @@
                     if not self.valid_f(achar):
                         valid_id = False
                     i += 1
-            if valid_id and (len(s) >= 1) and (len(s) <= 6):
+            if valid_id and (len(s) >= 1) and (len(s) <= 5):
                 return True
             else:
                 return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ............           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
============================== 24 passed in 0.05s ==============================
