   - [#  16] CDI linkedList1: 
--------------------------------------------------------------------------------
   80:         self.size += 1
   81: 
   82: 
   83: class SinglyLinkedNode(object):
-  84:     def __init__(self, data):
-  85:         self.data = data
-  86:         self.next = None
-  87: 
+  84:     @classmethod
+  85:     def __init__(self, data):
+  86:         self.data = data
+  87:         self.next = None
   88: 
   89: class DoublyLinkedList(SinglyLinkedList):
   90:     def __init__(self):
   91:         
--------------------------------------------------------------------------------
[0.09415 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList1_WHOLE_SUITE.py::test_case_7

def test_case_7():
        int_0 = -440
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.insert(int_0, int_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 2
        var_2 = doubly_linked_list_0.insert(var_0, int_0)
        assert len(doubly_linked_list_0) == 3
        var_3 = doubly_linked_list_0.__len__()
        assert var_3 == 3
        var_4 = doubly_linked_list_0.__iter__()
        assert len(var_4) == 3
        var_5 = var_4.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 4
        assert len(var_4) == 4
        var_6 = var_4.append(var_5)
        assert len(doubly_linked_list_0) == 5
        assert len(var_4) == 5
        object_0 = module_1.object()
        var_7 = doubly_linked_list_0.__getitem__(var_3)
>       assert f'{type(var_7).__module__}.{type(var_7).__qualname__}' == 'linkedList1.DoublyLinkedList'
E       AssertionError

   - [#  34] COI linkedList1: 
--------------------------------------------------------------------------------
  121:     
  122:     def insert(self, data, index):
  123:         if index >= self.size:
  124:             raise IndexError()
- 125:         if self.head is None:
+ 125:         if not (self.head is None):
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
  128:         
  129:         
--------------------------------------------------------------------------------
[0.13955 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList1_WHOLE_SUITE.py::test_case_4

def test_case_4():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.append(var_0)
        assert len(doubly_linked_list_0) == 2
        var_2 = doubly_linked_list_0.__len__()
        assert var_2 == 2
        var_3 = doubly_linked_list_0.__len__()
        assert var_3 == 2
        var_4 = doubly_linked_list_1.append(var_2)
        assert len(doubly_linked_list_1) == 1
        var_5 = doubly_linked_list_1.append(var_4)
        assert len(doubly_linked_list_1) == 2
        var_6 = doubly_linked_list_1.append(var_4)
        assert len(doubly_linked_list_1) == 3
        var_7 = doubly_linked_list_1.insert(doubly_linked_list_1, var_2)
>       assert len(doubly_linked_list_1) == 5
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList1_WHOLE_SUITE.py:75: AssertionError
