41 : Job ID b7ad9a7390674dd3886505678483f98b
test outcome: killed
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ is not '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
=============================== warnings summary ===============================
linkedList1.py:180
linkedList1.py:180
linkedList1.py:180
  /home/auri/temp/lucca/python_experiments/linkedList1/linkedList1.py:180: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if __name__ is not '__main__':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
ERROR DYNAMOSA-MIO-WHOLE_SUITE/test_linkedList1_DYNAMOSA.py - IndexError
ERROR DYNAMOSA-MIO-WHOLE_SUITE/test_linkedList1_MIO.py - IndexError
ERROR DYNAMOSA-MIO-WHOLE_SUITE/test_linkedList1_WHOLE_SUITE.py - IndexError
!!!!!!!!!!!!!!!!!!! Interrupted: 3 errors during collection !!!!!!!!!!!!!!!!!!!!
======================== 3 warnings, 3 errors in 0.10s =========================
