   - [#   2] AOR linkedList1: 
--------------------------------------------------------------------------------
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
  128:         
  129:         
- 130:         elif index == self.size - 1:
+ 130:         elif index == self.size + 1:
  131:             
  132:             self.append(data)
  133:         
  134:         elif index == 0:
--------------------------------------------------------------------------------
[6.99742 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_556

def test_case_556():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__con

   - [#   5] ASR linkedList1: 
--------------------------------------------------------------------------------
   76:             
   77:             
   78:             node.next = new_node
   79:         
-  80:         self.size += 1
+  80:         self.size -= 1
   81: 
   82: 
   83: class SinglyLinkedNode(object):
   84:     def __init__(self, data):
--------------------------------------------------------------------------------
[6.45590 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_32

def test_case_32():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.append(none_type_0)
>       assert len(singly_linked_list_0) == 1
E       ValueError: __len__() should return >= 0

RANDOM/test_linkedList1_RANDOM.py:897: ValueError

   - [#   6] ASR linkedList1: 
--------------------------------------------------------------------------------
  116:             
  117:             new_node = DoublyLinkedNode(data)
  118:             node.next = new_node
  119:             new_node.prev = node
- 120:         self.size += 1
+ 120:         self.size -= 1
  121:     
  122:     def insert(self, data, index):
  123:         if index >= self.size:
  124:             raise IndexError()
--------------------------------------------------------------------------------
[6.17280 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_16

def test_case_16():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_l

   - [#   8] CDI linkedList1: 
--------------------------------------------------------------------------------
    5: 
    6: class SinglyLinkedList(object):
    7:     __next__ = next
    8:     
-   9:     def __init__(self):
-  10:         self.head = None
-  11:         self.size = 0
-  12:         self.cursor = None
-  13:     
+   9:     @classmethod
+  10:     def __init__(self):
+  11:         self.head = None
+  12:         self.size = 0
+  13:         self.cursor = None
   14:     def __len__(self):
   15:         return self.size
   16:     
   17:     def __iter__(self):
--------------------------------------------------------------------------------
[2.94519 s] survived

   - [#   9] CDI linkedList1: 
--------------------------------------------------------------------------------
   10:         self.head = None
   11:         self.size = 0
   12:         self.cursor = None
   13:     
-  14:     def __len__(self):
-  15:         return self.size
-  16:     
+  14:     @classmethod
+  15:     def __len__(self):
+  16:         return self.size
   17:     def __iter__(self):
   18:         return self
   19:     
   20:     def __contains__(self, item):
--------------------------------------------------------------------------------
[6.50437 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_2

def test_case_2():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0

RANDOM/test_linkedList1_RANDOM.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList1.DoublyLinkedList'>

>   ???
E   AttributeError: type object 'DoublyLinkedList' has no attribute 'size'

linkedList1:16: AttributeError

   - [#  11] CDI linkedList1: 
--------------------------------------------------------------------------------
   16:     
   17:     def __iter__(self):
   18:         return self
   19:     
-  20:     def __contains__(self, item):
-  21:         if self.head is not None:
-  22:             cur = self.head
-  23:             while cur is not None:
-  24:                 if cur.data is item:
-  25:                     return True
-  26:                 cur = cur.next
-  27:         return False
-  28:     
+  20:     @classmethod
+  21:     def __contains__(self, item):
+  22:         if self.head is not None:
+  23:             cur = self.head
+  24:             while cur is not None:
+  25:                 if cur.data is item:
+  26:                     return True
+  27:                 cur = cur.next
+  28:         return False
   29:     ''' Both getitem and setitem represent the magic methods
   30:         for the object[index] and object[index] = other operations
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
--------------------------------------------------------------------------------
[6.32850 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_15

def test_case_15():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
>       var_0 = doubly

   - [#  12] CDI linkedList1: 
--------------------------------------------------------------------------------
   30:         for the object[index] and object[index] = other operations
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
-  34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
-  36:             raise IndexError()
-  37:         else:
-  38:             cur = self.head
-  39:             for x in range(index):
-  40:                 cur = cur.next
-  41:             return cur.data
-  42:     
+  34:     @classmethod
+  35:     def __getitem__(self, index):
+  36:         if (index >= self.size or index < 0):
+  37:             raise IndexError()
+  38:         else:
+  39:             cur = self.head
+  40:             for x in range(index):
+  41:                 cur = cur.next
+  42:             return cur.data
   43:     def __setitem__(self, index, value):
   44:         if (index >= self.size or index < 0):
   45:             raise IndexError()
   46:         else:
--------------------------------------------------------------------------------
[7.03521 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        sing

   - [#  13] CDI linkedList1: 
--------------------------------------------------------------------------------
   39:             for x in range(index):
   40:                 cur = cur.next
   41:             return cur.data
   42:     
-  43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
-  45:             raise IndexError()
-  46:         else:
-  47:             cur = self.head
-  48:             for x in range(index):
-  49:                 cur = cur.next
-  50:             cur.data = value
-  51:     
+  43:     @classmethod
+  44:     def __setitem__(self, index, value):
+  45:         if (index >= self.size or index < 0):
+  46:             raise IndexError()
+  47:         else:
+  48:             cur = self.head
+  49:             for x in range(index):
+  50:                 cur = cur.next
+  51:             cur.data = value
   52:     def next(self):
   53:         if self.cursor is None:
   54:             raise StopIteration()
   55:         else:
--------------------------------------------------------------------------------
[6.63504 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_458

def test_case_458():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_li

   - [#  14] CDI linkedList1: 
--------------------------------------------------------------------------------
   48:             for x in range(index):
   49:                 cur = cur.next
   50:             cur.data = value
   51:     
-  52:     def next(self):
-  53:         if self.cursor is None:
-  54:             raise StopIteration()
-  55:         else:
-  56:             node = self.cursor.data
-  57:             self.cursor = self.cursor.next
-  58:             return node
-  59:     
+  52:     @classmethod
+  53:     def next(self):
+  54:         if self.cursor is None:
+  55:             raise StopIteration()
+  56:         else:
+  57:             node = self.cursor.data
+  58:             self.cursor = self.cursor.next
+  59:             return node
   60:     def append(self, data):
   61:         ''' Note: The average time for append is O(n)
   62:             however, insertion is O(1), giving it an
   63:             advantage over arrays.
--------------------------------------------------------------------------------
[6.14244 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'l

   - [#  15] CDI linkedList1: 
--------------------------------------------------------------------------------
   56:             node = self.cursor.data
   57:             self.cursor = self.cursor.next
   58:             return node
   59:     
-  60:     def append(self, data):
-  61:         ''' Note: The average time for append is O(n)
-  62:             however, insertion is O(1), giving it an
-  63:             advantage over arrays.
-  64:         '''
-  65:         if self.head is None:
-  66:             self.head = SinglyLinkedNode(data)
-  67:             self.cursor = self.head
-  68:         else:
-  69:             node = self.head
-  70:             
-  71:             while node.next is not None:
-  72:                 node = node.next
-  73:             
+  60:     @classmethod
+  61:     def append(self, data):
+  62:         ''' Note: The average time for append is O(n)
+  63:             however, insertion is O(1), giving it an
+  64:             advantage over arrays.
+  65:         '''
+  66:         if self.head is None:
+  67:             self.head = SinglyLinkedNode(data)
+  68:             self.cursor = self.head
+  69:         else:
+  70:             node = self.head
+  71:             
+  72:             while node.next is not None:
+  73:                 node = node.next
   74:             
-  75:             new_node = SinglyLinkedNode(data)
-  76:             
+  75:             
+  76:             new_node = SinglyLinkedNode(data)
   77:             
-  78:             node.next = new_node
-  79:         
-  80:         self.size += 1
-  81: 
+  78:

   - [#  18] CDI linkedList1: 
--------------------------------------------------------------------------------
   90:     def __init__(self):
   91:         
   92:         super(DoublyLinkedList, self).__init__()
   93:     
-  94:     def previous(self):
-  95:         if self.cursor.prev is None:
-  96:             raise StopIteration()
-  97:         else:
-  98:             self.cursor.prev
-  99:             self.cursor = self.cursor.prev
- 100:             return self.cursor.data
- 101:     
+  94:     @classmethod
+  95:     def previous(self):
+  96:         if self.cursor.prev is None:
+  97:             raise StopIteration()
+  98:         else:
+  99:             self.cursor.prev
+ 100:             self.cursor = self.cursor.prev
+ 101:             return self.cursor.data
  102:     def append(self, data):
  103:         ''' Note: The average time for append is O(n)
  104:             however, insertion is O(1), giving it an
  105:             advantage over arrays.
--------------------------------------------------------------------------------
[7.33651 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1206

def test_case_1206():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        va

   - [#  19] CDI linkedList1: 
--------------------------------------------------------------------------------
   98:             self.cursor.prev
   99:             self.cursor = self.cursor.prev
  100:             return self.cursor.data
  101:     
- 102:     def append(self, data):
- 103:         ''' Note: The average time for append is O(n)
- 104:             however, insertion is O(1), giving it an
- 105:             advantage over arrays.
- 106:         '''
- 107:         if self.head is None:
- 108:             self.head = DoublyLinkedNode(data)
- 109:             self.cursor = self.head
- 110:         else:
- 111:             node = self.head
- 112:             
- 113:             while node.next is not None:
- 114:                 node = node.next
- 115:             
+ 102:     @classmethod
+ 103:     def append(self, data):
+ 104:         ''' Note: The average time for append is O(n)
+ 105:             however, insertion is O(1), giving it an
+ 106:             advantage over arrays.
+ 107:         '''
+ 108:         if self.head is None:
+ 109:             self.head = DoublyLinkedNode(data)
+ 110:             self.cursor = self.head
+ 111:         else:
+ 112:             node = self.head
+ 113:             
+ 114:             while node.next is not None:
+ 115:                 node = node.next
  116:             
- 117:             new_node = DoublyLinkedNode(data)
- 118:             node.next = new_node
- 119:             new_node.prev = node
- 120:         self.size += 1
- 121:     
+ 117:             
+ 118:             new_node = DoublyLinkedNode(data)
+ 119:             node.next = new_node
+ 120:             new_node.prev = node
+ 121:         self.size += 1

   - [#  20] CDI linkedList1: 
--------------------------------------------------------------------------------
  118:             node.next = new_node
  119:             new_node.prev = node
  120:         self.size += 1
  121:     
- 122:     def insert(self, data, index):
- 123:         if index >= self.size:
- 124:             raise IndexError()
- 125:         if self.head is None:
- 126:             self.head = DoublyLinkedNode(data)
- 127:             self.cursor = self.head
- 128:         
+ 122:     @classmethod
+ 123:     def insert(self, data, index):
+ 124:         if index >= self.size:
+ 125:             raise IndexError()
+ 126:         if self.head is None:
+ 127:             self.head = DoublyLinkedNode(data)
+ 128:             self.cursor = self.head
  129:         
- 130:         elif index == self.size - 1:
- 131:             
- 132:             self.append(data)
- 133:         
- 134:         elif index == 0:
- 135:             
+ 130:         
+ 131:         elif index == self.size - 1:
+ 132:             
+ 133:             self.append(data)
+ 134:         
+ 135:         elif index == 0:
  136:             
  137:             
- 138:             a = self.head
- 139:             c = DoublyLinkedNode(data)
- 140:             
+ 138:             
+ 139:             a = self.head
+ 140:             c = DoublyLinkedNode(data)
  141:             
  142:             
  143:             
- 144:             self.head = c

   - [#  22] COI linkedList1: 
--------------------------------------------------------------------------------
   17:     def __iter__(self):
   18:         return self
   19:     
   20:     def __contains__(self, item):
-  21:         if self.head is not None:
+  21:         if not (self.head is not None):
   22:             cur = self.head
   23:             while cur is not None:
   24:                 if cur.data is item:
   25:                     return True
--------------------------------------------------------------------------------
[6.47849 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_257

def test_case_257():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_3 = True
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        singly_linked_n

   - [#  23] COI linkedList1: 
--------------------------------------------------------------------------------
   19:     
   20:     def __contains__(self, item):
   21:         if self.head is not None:
   22:             cur = self.head
-  23:             while cur is not None:
+  23:             while not (cur is not None):
   24:                 if cur.data is item:
   25:                     return True
   26:                 cur = cur.next
   27:         return False
--------------------------------------------------------------------------------
[6.37341 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_257

def test_case_257():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_3 = True
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        singly

   - [#  24] COI linkedList1: 
--------------------------------------------------------------------------------
   20:     def __contains__(self, item):
   21:         if self.head is not None:
   22:             cur = self.head
   23:             while cur is not None:
-  24:                 if cur.data is item:
+  24:                 if not (cur.data is item):
   25:                     return True
   26:                 cur = cur.next
   27:         return False
   28:     
--------------------------------------------------------------------------------
[6.30298 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_116

def test_case_116():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinked

   - [#  25] COI linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if not ((index >= self.size or index < 0)):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.05973 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.Sin

   - [#  26] COI linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if not ((index >= self.size or index < 0)):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[6.58479 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_458

def test_case_458():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        bool_3 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_3)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_3)
        assert doubly_linked_node_0.
