   - [#  27] COI linkedList1: 
--------------------------------------------------------------------------------
   49:                 cur = cur.next
   50:             cur.data = value
   51:     
   52:     def next(self):
-  53:         if self.cursor is None:
+  53:         if not (self.cursor is None):
   54:             raise StopIteration()
   55:         else:
   56:             node = self.cursor.data
   57:             self.cursor = self.cursor.next
--------------------------------------------------------------------------------
[6.55468 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) ==

   - [#  28] COI linkedList1: 
--------------------------------------------------------------------------------
   61:         ''' Note: The average time for append is O(n)
   62:             however, insertion is O(1), giving it an
   63:             advantage over arrays.
   64:         '''
-  65:         if self.head is None:
+  65:         if not (self.head is None):
   66:             self.head = SinglyLinkedNode(data)
   67:             self.cursor = self.head
   68:         else:
   69:             node = self.head
--------------------------------------------------------------------------------
[6.42350 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_32

def test_case_32():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
>       var_0 = singly_linked_list_0.append(none_type_0)

RANDOM/test_linkedList1_RANDOM.py:896: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.SinglyLinkedList object at 0x7fd0ec787040>, data = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList1:71: AttributeError

   - [#  29] COI linkedList1: 
--------------------------------------------------------------------------------
   67:             self.cursor = self.head
   68:         else:
   69:             node = self.head
   70:             
-  71:             while node.next is not None:
+  71:             while not (node.next is not None):
   72:                 node = node.next
   73:             
   74:             
   75:             new_node = SinglyLinkedNode(data)
--------------------------------------------------------------------------------
[6.35076 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_41

def test_case_41():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__contains__(singly_linked_node_0)
        assert var_0 is False
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_3 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_3) == 0
        var_1 = doubly_linked_list_3.append(doubly_linked_list_3)
        assert len(doubly_linked_list_3) == 1
        bool_2 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)

   - [#  30] COI linkedList1: 
--------------------------------------------------------------------------------
   91:         
   92:         super(DoublyLinkedList, self).__init__()
   93:     
   94:     def previous(self):
-  95:         if self.cursor.prev is None:
+  95:         if not (self.cursor.prev is None):
   96:             raise StopIteration()
   97:         else:
   98:             self.cursor.prev
   99:             self.cursor = self.cursor.prev
--------------------------------------------------------------------------------
[7.38010 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1206

def test_case_1206():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.append(none_type_0)
        assert len(singly_linked_list_0) == 1
        bool_1 = False
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.append(doubly_linked_list_1)
        assert len(d

   - [#  33] COI linkedList1: 
--------------------------------------------------------------------------------
  119:             new_node.prev = node
  120:         self.size += 1
  121:     
  122:     def insert(self, data, index):
- 123:         if index >= self.size:
+ 123:         if not (index >= self.size):
  124:             raise IndexError()
  125:         if self.head is None:
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
--------------------------------------------------------------------------------
[6.23053 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_220

def test_case_220():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.__len__()
        assert var_0 == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__iter__()
        assert len(var_1) == 0
        bool_2 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_l

   - [#  35] COI linkedList1: 
--------------------------------------------------------------------------------
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
  128:         
  129:         
- 130:         elif index == self.size - 1:
+ 130:         elif not (index == self.size - 1):
  131:             
  132:             self.append(data)
  133:         
  134:         elif index == 0:
--------------------------------------------------------------------------------
[6.73085 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_556

def test_case_556():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1

   - [#  36] COI linkedList1: 
--------------------------------------------------------------------------------
  130:         elif index == self.size - 1:
  131:             
  132:             self.append(data)
  133:         
- 134:         elif index == 0:
+ 134:         elif not (index == 0):
  135:             
  136:             
  137:             
  138:             a = self.head
--------------------------------------------------------------------------------
[2.82746 s] survived

   - [#  39] CRP linkedList1: 
--------------------------------------------------------------------------------
   25:                     return True
   26:                 cur = cur.next
   27:         return False
   28:     
-  29:     ''' Both getitem and setitem represent the magic methods
-  30:         for the object[index] and object[index] = other operations
-  31:         for linked lists they run in O(n) time making them less
-  32:         efficient than a list() for lookups
-  33:     '''
+  29:     '''mutpy'''
+  30:     
+  31:     
+  32:     
+  33:     
   34:     def __getitem__(self, index):
   35:         if (index >= self.size or index < 0):
   36:             raise IndexError()
   37:         else:
--------------------------------------------------------------------------------
[2.79083 s] survived

   - [#  40] CRP linkedList1: 
--------------------------------------------------------------------------------
   25:                     return True
   26:                 cur = cur.next
   27:         return False
   28:     
-  29:     ''' Both getitem and setitem represent the magic methods
-  30:         for the object[index] and object[index] = other operations
-  31:         for linked lists they run in O(n) time making them less
-  32:         efficient than a list() for lookups
-  33:     '''
+  29:     ''''''
+  30:     
+  31:     
+  32:     
+  33:     
   34:     def __getitem__(self, index):
   35:         if (index >= self.size or index < 0):
   36:             raise IndexError()
   37:         else:
--------------------------------------------------------------------------------
[2.77848 s] survived

   - [#  41] CRP linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if (index >= self.size or index < 1):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.19516 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.SinglyLin

   - [#  42] CRP linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if (index >= self.size or index < 1):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[6.65957 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_458

def test_case_458():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        bool_3 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_3)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_3)
        assert doubly_linked_node_0.data i

   - [#  43] CRP linkedList1: 
--------------------------------------------------------------------------------
   76:             
   77:             
   78:             node.next = new_node
   79:         
-  80:         self.size += 1
+  80:         self.size += 2
   81: 
   82: 
   83: class SinglyLinkedNode(object):
   84:     def __init__(self, data):
--------------------------------------------------------------------------------
[6.18977 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_32

def test_case_32():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.append(none_type_0)
>       assert len(singly_linked_list_0) == 1
E       AssertionError

RANDOM/test_linkedList1_RANDOM.py:897: AssertionError

   - [#  45] CRP linkedList1: 
--------------------------------------------------------------------------------
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
  128:         
  129:         
- 130:         elif index == self.size - 1:
+ 130:         elif index == self.size - 2:
  131:             
  132:             self.append(data)
  133:         
  134:         elif index == 0:
--------------------------------------------------------------------------------
[6.66880 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_556

def test_case_556():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__con

   - [#  46] CRP linkedList1: 
--------------------------------------------------------------------------------
  130:         elif index == self.size - 1:
  131:             
  132:             self.append(data)
  133:         
- 134:         elif index == 0:
+ 134:         elif index == 1:
  135:             
  136:             
  137:             
  138:             a = self.head
--------------------------------------------------------------------------------
[2.75838 s] survived

   - [#  49] CRP linkedList1: 
--------------------------------------------------------------------------------
  176:         
  177:         super(DoublyLinkedNode, self).__init__(data)
  178:         self.prev = None
  179: 
- 180: if __name__ == '__main__':
+ 180: if __name__ == 'mutpy':
  181:     test = SinglyLinkedList()
  182:     test.append(2)
  183:     test.append(3)
  184:     test.append(4)
--------------------------------------------------------------------------------
[2.76370 s] survived

   - [#  50] CRP linkedList1: 
--------------------------------------------------------------------------------
  176:         
  177:         super(DoublyLinkedNode, self).__init__(data)
  178:         self.prev = None
  179: 
- 180: if __name__ == '__main__':
+ 180: if __name__ == '':
  181:     test = SinglyLinkedList()
  182:     test.append(2)
  183:     test.append(3)
  184:     test.append(4)
--------------------------------------------------------------------------------
[2.71571 s] survived

   - [#  54] CRP linkedList1: 
--------------------------------------------------------------------------------
  182:     test.append(2)
  183:     test.append(3)
  184:     test.append(4)
  185:     
- 186:     print(test[0])
+ 186:     print(test[1])
  187:     print(test[1])
  188:     print(test[2])
  189:     print(test[-1])
--------------------------------------------------------------------------------
[2.78776 s] survived

   - [#  58] IOD linkedList1: 
--------------------------------------------------------------------------------
   86:         self.next = None
   87: 
   88: 
   89: class DoublyLinkedList(SinglyLinkedList):
-  90:     def __init__(self):
-  91:         
-  92:         super(DoublyLinkedList, self).__init__()
+  90:     pass
+  91:     
+  92:     
   93:     
   94:     def previous(self):
   95:         if self.cursor.prev is None:
   96:             raise StopIteration()
--------------------------------------------------------------------------------
[2.74817 s] survived

   - [#  59] IOD linkedList1: 
--------------------------------------------------------------------------------
   98:             self.cursor.prev
   99:             self.cursor = self.cursor.prev
  100:             return self.cursor.data
  101:     
- 102:     def append(self, data):
- 103:         ''' Note: The average time for append is O(n)
- 104:             however, insertion is O(1), giving it an
- 105:             advantage over arrays.
- 106:         '''
- 107:         if self.head is None:
- 108:             self.head = DoublyLinkedNode(data)
- 109:             self.cursor = self.head
- 110:         else:
- 111:             node = self.head
- 112:             
- 113:             while node.next is not None:
- 114:                 node = node.next
- 115:             
- 116:             
- 117:             new_node = DoublyLinkedNode(data)
- 118:             node.next = new_node
- 119:             new_node.prev = node
- 120:         self.size += 1
+ 102:     pass
+ 103:     
+ 104:     
+ 105:     
+ 106:     
+ 107:     
+ 108:     
+ 109:     
+ 110:     
+ 111:     
+ 112:     
+ 113:     
+ 114:     
+ 115:     
+ 116:     
+ 117:     
+ 118:     
+ 119:     
+ 120:     
  121:

   - [#  60] IOD linkedList1: 
--------------------------------------------------------------------------------
  171:         self.size += 1
  172: 
  173: 
  174: class DoublyLinkedNode(SinglyLinkedNode):
- 175:     def __init__(self, data):
- 176:         
- 177:         super(DoublyLinkedNode, self).__init__(data)
- 178:         self.prev = None
+ 175:     pass
+ 176: 
+ 177: 
+ 178: 
  179: 
  180: if __name__ == '__main__':
  181:     test = SinglyLinkedList()
  182:     test.append(2)
--------------------------------------------------------------------------------
[6.22528 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_4

def test_case_4():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
>       assert doubly_linked_node_0.prev is None
E       AttributeError: 'DoublyLinkedNode' object has no attribute 'prev'

RANDOM/test_linkedList1_RANDOM.py:57: AttributeError

   - [#  61] IOP linkedList1: 
--------------------------------------------------------------------------------
  173: 
  174: class DoublyLinkedNode(SinglyLinkedNode):
  175:     def __init__(self, data):
  176:         
- 177:         super(DoublyLinkedNode, self).__init__(data)
- 178:         self.prev = None
+ 177:         self.prev = None
+ 178:         super(DoublyLinkedNode, self).__init__(data)
  179: 
  180: if __name__ == '__main__':
  181:     test = SinglyLinkedList()
  182:     test.append(2)
--------------------------------------------------------------------------------
[2.79002 s] survived

   - [#  62] LCR linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if (index >= self.size and index < 0):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.65794 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1182

def test_case_1182():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           singly_linked_list_0.__getitem__(bool_0)

RANDOM/test_linkedList1_RANDOM.py:67103: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.SinglyLinkedList object at 0x7fd0e9fc2500>, index = True

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList1:40: AttributeError

   - [#  63] LCR linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if (index >= self.size and index < 0):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[7.53482 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1213

def test_case_1213():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        none_type_0 = None
        with pytest.raises(IndexError):
>           doubly_linked_list_1.__setitem__(bool_1, none_type_0)

RANDOM/test_linkedList1_RANDOM.py:67994: 
_

   - [#  64] OIL linkedList1: 
--------------------------------------------------------------------------------
   23:             while cur is not None:
   24:                 if cur.data is item:
   25:                     return True
   26:                 cur = cur.next
-  27:         return False
-  28:     
+  27:                 break
+  28:         return False
   29:     ''' Both getitem and setitem represent the magic methods
   30:         for the object[index] and object[index] = other operations
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
--------------------------------------------------------------------------------
[2.77609 s] survived
