   - [#  65] OIL linkedList1: 
--------------------------------------------------------------------------------
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
   40:                 cur = cur.next
-  41:             return cur.data
+  41:                 breakreturn cur.data
   42:     
   43:     def __setitem__(self, index, value):
   44:         if (index >= self.size or index < 0):
   45:             raise IndexError()
--------------------------------------------------------------------------------
[2.79737 s] survived

   - [#  66] OIL linkedList1: 
--------------------------------------------------------------------------------
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
   49:                 cur = cur.next
-  50:             cur.data = value
+  50:                 breakcur.data = value
   51:     
   52:     def next(self):
   53:         if self.cursor is None:
   54:             raise StopIteration()
--------------------------------------------------------------------------------
[2.90145 s] survived

   - [#  67] OIL linkedList1: 
--------------------------------------------------------------------------------
   69:             node = self.head
   70:             
   71:             while node.next is not None:
   72:                 node = node.next
-  73:             
+  73:                 break
   74:             
   75:             new_node = SinglyLinkedNode(data)
   76:             
   77:             
--------------------------------------------------------------------------------
[2.90274 s] survived

   - [#  69] OIL linkedList1: 
--------------------------------------------------------------------------------
  149:             
  150:             a = self.head
  151:             for x in range(index - 1):
  152:                 a = a.next
- 153:             
+ 153:                 break
  154:             
  155:             
  156:             b = a.next
  157:             c = DoublyLinkedNode(data)
--------------------------------------------------------------------------------
[2.89194 s] survived

   - [#  70] RIL linkedList1: 
--------------------------------------------------------------------------------
   35:         if (index >= self.size or index < 0):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
-  39:             for x in range(index):
+  39:             for x in reversed(range(index)):
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
--------------------------------------------------------------------------------
[2.87202 s] survived

   - [#  72] RIL linkedList1: 
--------------------------------------------------------------------------------
  147:             self.cursor = self.head
  148:         else:
  149:             
  150:             a = self.head
- 151:             for x in range(index - 1):
+ 151:             for x in reversed(range(index - 1)):
  152:                 a = a.next
  153:             
  154:             
  155:             
--------------------------------------------------------------------------------
[2.92044 s] survived

   - [#  73] ROR linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if (index <= self.size or index < 0):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.53560 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.SinglyLin

   - [#  74] ROR linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if (index > self.size or index < 0):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.82716 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1232

def test_case_1232():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        var_0 = doubly_linked_list_0.__len__()
        assert var_0 == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__iter__()
        assert len(var_1) == 0
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        doubly_linked_list_3 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_3) == 0
        doubly_lin

   - [#  75] ROR linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if (index >= self.size or index > 0):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.88647 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1453

def test_case_1453():
        int_0 = -1743
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__getitem__(int_0)

RANDOM/test_linkedList1_RANDOM.py:79487: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.DoublyLinkedList object at 0x7fd0ec1e8490>, index = -1743

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

linkedList1:41: AttributeError

   - [#  76] ROR linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if (index >= self.size or index <= 0):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.33687 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.SinglyLi

   - [#  77] ROR linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if (index <= self.size or index < 0):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[6.79861 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_458

def test_case_458():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        bool_3 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_3)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_3)
        assert doubly_linked_node_0.data i

   - [#  78] ROR linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if (index > self.size or index < 0):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[7.62104 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1222

def test_case_1222():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_1.__len__()
        assert var_0 == 0
        int_0 = -704
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__setitem__(var_0, int_0)

RANDOM/test_linkedList1_RANDOM.py:68259: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <l

   - [#  79] ROR linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if (index >= self.size or index > 0):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[2.87981 s] survived

   - [#  80] ROR linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if (index >= self.size or index <= 0):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[7.09999 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_458

def test_case_458():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        bool_3 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_3)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_3)
        assert doubly_linked_node_0.data

   - [#  83] ROR linkedList1: 
--------------------------------------------------------------------------------
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
  128:         
  129:         
- 130:         elif index == self.size - 1:
+ 130:         elif index != self.size - 1:
  131:             
  132:             self.append(data)
  133:         
  134:         elif index == 0:
--------------------------------------------------------------------------------
[7.39127 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_556

def test_case_556():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__con

   - [#  84] ROR linkedList1: 
--------------------------------------------------------------------------------
  130:         elif index == self.size - 1:
  131:             
  132:             self.append(data)
  133:         
- 134:         elif index == 0:
+ 134:         elif index != 0:
  135:             
  136:             
  137:             
  138:             a = self.head
--------------------------------------------------------------------------------
[2.80351 s] survived

   - [#  86] SCD linkedList1: 
--------------------------------------------------------------------------------
   88: 
   89: class DoublyLinkedList(SinglyLinkedList):
   90:     def __init__(self):
   91:         
-  92:         super(DoublyLinkedList, self).__init__()
+  92:         pass
   93:     
   94:     def previous(self):
   95:         if self.cursor.prev is None:
   96:             raise StopIteration()
--------------------------------------------------------------------------------
[6.57081 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_2

def test_case_2():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0

RANDOM/test_linkedList1_RANDOM.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.DoublyLinkedList object at 0x7fd0ebd74550>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute 'size'

linkedList1:15: AttributeError

   - [#  87] SCD linkedList1: 
--------------------------------------------------------------------------------
  173: 
  174: class DoublyLinkedNode(SinglyLinkedNode):
  175:     def __init__(self, data):
  176:         
- 177:         super(DoublyLinkedNode, self).__init__(data)
+ 177:         pass
  178:         self.prev = None
  179: 
  180: if __name__ == '__main__':
  181:     test = SinglyLinkedList()
--------------------------------------------------------------------------------
[6.67187 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_4

def test_case_4():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
>       assert doubly_linked_node_0.data is True
E       AttributeError: 'DoublyLinkedNode' object has no attribute 'data'

RANDOM/test_linkedList1_RANDOM.py:55: AttributeError

   - [#  88] SCI linkedList1: 
--------------------------------------------------------------------------------
   99:             self.cursor = self.cursor.prev
  100:             return self.cursor.data
  101:     
  102:     def append(self, data):
- 103:         ''' Note: The average time for append is O(n)
- 104:             however, insertion is O(1), giving it an
- 105:             advantage over arrays.
- 106:         '''
- 107:         if self.head is None:
- 108:             self.head = DoublyLinkedNode(data)
- 109:             self.cursor = self.head
- 110:         else:
- 111:             node = self.head
- 112:             
- 113:             while node.next is not None:
- 114:                 node = node.next
- 115:             
+ 103:         super().append(data)
+ 104:         ''' Note: The average time for append is O(n)
+ 105:             however, insertion is O(1), giving it an
+ 106:             advantage over arrays.
+ 107:         '''
+ 108:         if self.head is None:
+ 109:             self.head = DoublyLinkedNode(data)
+ 110:             self.cursor = self.head
+ 111:         else:
+ 112:             node = self.head
+ 113:             
+ 114:             while node.next is not None:
+ 115:                 node = node.next
  116:             
- 117:             new_node = DoublyLinkedNode(data)
- 118:             node.next = new_node
- 119:             new_node.prev = node
- 120:         self.size += 1
- 121:     
+ 117:             
+ 118:             new_node = DoublyLinkedNode(data)
+ 119:             node.next = new_node
+ 120:             new_node.prev = node
+ 121:         self.size += 1
  122:     def insert(self, data, index):
  123:         if index >= self.size:

   - [# 103] SDL linkedList1: 
--------------------------------------------------------------------------------
    3:     thomas moll 2015
    4: '''
    5: 
    6: class SinglyLinkedList(object):
-   7:     __next__ = next
+   7:     pass
    8:     
    9:     def __init__(self):
   10:         self.head = None
   11:         self.size = 0
--------------------------------------------------------------------------------
[2.75684 s] survived

   - [# 104] SDL linkedList1: 
--------------------------------------------------------------------------------
    6: class SinglyLinkedList(object):
    7:     __next__ = next
    8:     
    9:     def __init__(self):
-  10:         self.head = None
+  10:         pass
   11:         self.size = 0
   12:         self.cursor = None
   13:     
   14:     def __len__(self):
--------------------------------------------------------------------------------
[6.53312 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_15

def test_case_15():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
>       var_0 = doubly_linked_list_0.__contains__(singly_linked_node_0)

RANDOM/test_linkedList1_RANDOM.py:317: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.DoublyLinkedList object at 0x7fd0e9fc2290>
item = <linkedList1.SinglyLinkedNode object at 0x7fd0e9fc2fe0>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute 'head'

linkedList1:21: AttributeError

   - [# 105] SDL linkedList1: 
--------------------------------------------------------------------------------
    7:     __next__ = next
    8:     
    9:     def __init__(self):
   10:         self.head = None
-  11:         self.size = 0
+  11:         pass
   12:         self.cursor = None
   13:     
   14:     def __len__(self):
   15:         return self.size
--------------------------------------------------------------------------------
[6.98805 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_2

def test_case_2():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0

RANDOM/test_linkedList1_RANDOM.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.DoublyLinkedList object at 0x7fd0ec9e5ed0>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute 'size'

linkedList1:15: AttributeError

   - [# 106] SDL linkedList1: 
--------------------------------------------------------------------------------
    8:     
    9:     def __init__(self):
   10:         self.head = None
   11:         self.size = 0
-  12:         self.cursor = None
+  12:         pass
   13:     
   14:     def __len__(self):
   15:         return self.size
   16:     
--------------------------------------------------------------------------------
[7.79907 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1183

def test_case_1183():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        bool_2 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        with pytest.raises(StopIteration):
>           doubly_linked_list_0.next()

RANDOM/test_linkedList1_RANDOM.py:67123: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.DoublyLinkedList object at 0x7fd0ede14d90>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute 'cursor'

linkedList1:53: AttributeError

   - [# 109] SDL linkedList1: 
--------------------------------------------------------------------------------
   18:         return self
   19:     
   20:     def __contains__(self, item):
   21:         if self.head is not None:
-  22:             cur = self.head
+  22:             pass
   23:             while cur is not None:
   24:                 if cur.data is item:
   25:                     return True
   26:                 cur = cur.next
--------------------------------------------------------------------------------
[6.74815 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_116

def test_case_116():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly
