   - [# 110] SDL linkedList1: 
--------------------------------------------------------------------------------
   21:         if self.head is not None:
   22:             cur = self.head
   23:             while cur is not None:
   24:                 if cur.data is item:
-  25:                     return True
+  25:                     pass
   26:                 cur = cur.next
   27:         return False
   28:     
   29:     ''' Both getitem and setitem represent the magic methods
--------------------------------------------------------------------------------
[6.68531 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_257

def test_case_257():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_3 = True
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)

   - [# 111] SDL linkedList1: 
--------------------------------------------------------------------------------
   22:             cur = self.head
   23:             while cur is not None:
   24:                 if cur.data is item:
   25:                     return True
-  26:                 cur = cur.next
+  26:                 pass
   27:         return False
   28:     
   29:     ''' Both getitem and setitem represent the magic methods
   30:         for the object[index] and object[index] = other operations
--------------------------------------------------------------------------------
[14.70631 s] timeout

   - [# 112] SDL linkedList1: 
--------------------------------------------------------------------------------
   23:             while cur is not None:
   24:                 if cur.data is item:
   25:                     return True
   26:                 cur = cur.next
-  27:         return False
+  27:         pass
   28:     
   29:     ''' Both getitem and setitem represent the magic methods
   30:         for the object[index] and object[index] = other operations
   31:         for linked lists they run in O(n) time making them less
--------------------------------------------------------------------------------
[6.64927 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_15

def test_case_15():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_0 = doubly_linked_list_0.__contains__(singly_linked_node_0)
>       assert var_0 is False
E       AssertionError

RANDOM/test_linkedList1_RANDOM.py:318: AssertionError

   - [# 113] SDL linkedList1: 
--------------------------------------------------------------------------------
   25:                     return True
   26:                 cur = cur.next
   27:         return False
   28:     
-  29:     ''' Both getitem and setitem represent the magic methods
-  30:         for the object[index] and object[index] = other operations
-  31:         for linked lists they run in O(n) time making them less
-  32:         efficient than a list() for lookups
-  33:     '''
+  29:     pass
+  30:     
+  31:     
+  32:     
+  33:     
   34:     def __getitem__(self, index):
   35:         if (index >= self.size or index < 0):
   36:             raise IndexError()
   37:         else:
--------------------------------------------------------------------------------
[2.95846 s] survived

   - [# 114] SDL linkedList1: 
--------------------------------------------------------------------------------
   34:     def __getitem__(self, index):
   35:         if (index >= self.size or index < 0):
   36:             raise IndexError()
   37:         else:
-  38:             cur = self.head
+  38:             pass
   39:             for x in range(index):
   40:                 cur = cur.next
   41:             return cur.data
   42:     
--------------------------------------------------------------------------------
[7.45353 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.SinglyLinkedNode(doubly_linked_list_1)
        assert len(singly_linked_node_3.data) == 0

   - [# 115] SDL linkedList1: 
--------------------------------------------------------------------------------
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
-  40:                 cur = cur.next
+  40:                 pass
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
   44:         if (index >= self.size or index < 0):
--------------------------------------------------------------------------------
[2.93641 s] survived

   - [# 116] SDL linkedList1: 
--------------------------------------------------------------------------------
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
   40:                 cur = cur.next
-  41:             return cur.data
+  41:             pass
   42:     
   43:     def __setitem__(self, index, value):
   44:         if (index >= self.size or index < 0):
   45:             raise IndexError()
--------------------------------------------------------------------------------
[7.60933 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.SinglyLinkedNode(doubly_linked_list_1)
        assert len(singly_linked_node_3.data

   - [# 119] SDL linkedList1: 
--------------------------------------------------------------------------------
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
   49:                 cur = cur.next
-  50:             cur.data = value
+  50:             pass
   51:     
   52:     def next(self):
   53:         if self.cursor is None:
   54:             raise StopIteration()
--------------------------------------------------------------------------------
[2.86587 s] survived

   - [# 120] SDL linkedList1: 
--------------------------------------------------------------------------------
   52:     def next(self):
   53:         if self.cursor is None:
   54:             raise StopIteration()
   55:         else:
-  56:             node = self.cursor.data
+  56:             pass
   57:             self.cursor = self.cursor.next
   58:             return node
   59:     
   60:     def append(self, data):
--------------------------------------------------------------------------------
[6.42378 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_link

   - [# 121] SDL linkedList1: 
--------------------------------------------------------------------------------
   53:         if self.cursor is None:
   54:             raise StopIteration()
   55:         else:
   56:             node = self.cursor.data
-  57:             self.cursor = self.cursor.next
+  57:             pass
   58:             return node
   59:     
   60:     def append(self, data):
   61:         ''' Note: The average time for append is O(n)
--------------------------------------------------------------------------------
[2.73127 s] survived

   - [# 122] SDL linkedList1: 
--------------------------------------------------------------------------------
   54:             raise StopIteration()
   55:         else:
   56:             node = self.cursor.data
   57:             self.cursor = self.cursor.next
-  58:             return node
+  58:             pass
   59:     
   60:     def append(self, data):
   61:         ''' Note: The average time for append is O(n)
   62:             however, insertion is O(1), giving it an
--------------------------------------------------------------------------------
[6.47261 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len

   - [# 123] SDL linkedList1: 
--------------------------------------------------------------------------------
   62:             however, insertion is O(1), giving it an
   63:             advantage over arrays.
   64:         '''
   65:         if self.head is None:
-  66:             self.head = SinglyLinkedNode(data)
+  66:             pass
   67:             self.cursor = self.head
   68:         else:
   69:             node = self.head
   70:             
--------------------------------------------------------------------------------
[6.47271 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_257

def test_case_257():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_3 = True
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        singly_linked_node

   - [# 124] SDL linkedList1: 
--------------------------------------------------------------------------------
   63:             advantage over arrays.
   64:         '''
   65:         if self.head is None:
   66:             self.head = SinglyLinkedNode(data)
-  67:             self.cursor = self.head
+  67:             pass
   68:         else:
   69:             node = self.head
   70:             
   71:             while node.next is not None:
--------------------------------------------------------------------------------
[6.40685 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_277

def test_case_277():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_0 = module_0.SinglyLinkedNode(doubly_linked_list_0)
        assert len(singly_linked_node_0.data) == 0
        bool_0 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_2)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        asse

   - [# 125] SDL linkedList1: 
--------------------------------------------------------------------------------
   65:         if self.head is None:
   66:             self.head = SinglyLinkedNode(data)
   67:             self.cursor = self.head
   68:         else:
-  69:             node = self.head
+  69:             pass
   70:             
   71:             while node.next is not None:
   72:                 node = node.next
   73:             
--------------------------------------------------------------------------------
[6.48926 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_41

def test_case_41():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__contains__(singly_linked_node_0)
        assert var_0 is False
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_3 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_3) == 0
        var_1 = doubly_linked_list_3.append(doubly_linked_list_3)
        assert len(doubly_linked_list_3) == 1
        bool_2 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        singly

   - [# 126] SDL linkedList1: 
--------------------------------------------------------------------------------
   68:         else:
   69:             node = self.head
   70:             
   71:             while node.next is not None:
-  72:                 node = node.next
+  72:                 pass
   73:             
   74:             
   75:             new_node = SinglyLinkedNode(data)
   76:             
--------------------------------------------------------------------------------
[2.79640 s] survived

   - [# 127] SDL linkedList1: 
--------------------------------------------------------------------------------
   71:             while node.next is not None:
   72:                 node = node.next
   73:             
   74:             
-  75:             new_node = SinglyLinkedNode(data)
+  75:             pass
   76:             
   77:             
   78:             node.next = new_node
   79:         
--------------------------------------------------------------------------------
[6.35346 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_41

def test_case_41():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__contains__(singly_linked_node_0)
        assert var_0 is False
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_3 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_3) == 0
        var_1 = doubly_linked_list_3.append(doubly_linked_list_3)
        assert len(doubly_linked_list_3) == 1
        bool_2 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_5 = module_0.SinglyLinkedNode

   - [# 128] SDL linkedList1: 
--------------------------------------------------------------------------------
   74:             
   75:             new_node = SinglyLinkedNode(data)
   76:             
   77:             
-  78:             node.next = new_node
+  78:             pass
   79:         
   80:         self.size += 1
   81: 
   82: 
--------------------------------------------------------------------------------
[2.84592 s] survived

   - [# 129] SDL linkedList1: 
--------------------------------------------------------------------------------
   81: 
   82: 
   83: class SinglyLinkedNode(object):
   84:     def __init__(self, data):
-  85:         self.data = data
+  85:         pass
   86:         self.next = None
   87: 
   88: 
   89: class DoublyLinkedList(SinglyLinkedList):
--------------------------------------------------------------------------------
[6.21534 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_0

def test_case_0():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
>       assert singly_linked_node_0.data is True
E       AttributeError: 'SinglyLinkedNode' object has no attribute 'data'

RANDOM/test_linkedList1_RANDOM.py:10: AttributeError

   - [# 130] SDL linkedList1: 
--------------------------------------------------------------------------------
   82: 
   83: class SinglyLinkedNode(object):
   84:     def __init__(self, data):
   85:         self.data = data
-  86:         self.next = None
+  86:         pass
   87: 
   88: 
   89: class DoublyLinkedList(SinglyLinkedList):
   90:     def __init__(self):
--------------------------------------------------------------------------------
[6.13459 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_0

def test_case_0():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
>       assert singly_linked_node_0.next is None
E       AttributeError: 'SinglyLinkedNode' object has no attribute 'next'

RANDOM/test_linkedList1_RANDOM.py:11: AttributeError

   - [# 132] SDL linkedList1: 
--------------------------------------------------------------------------------
   94:     def previous(self):
   95:         if self.cursor.prev is None:
   96:             raise StopIteration()
   97:         else:
-  98:             self.cursor.prev
+  98:             pass
   99:             self.cursor = self.cursor.prev
  100:             return self.cursor.data
  101:     
  102:     def append(self, data):
--------------------------------------------------------------------------------
[2.78315 s] survived

   - [# 133] SDL linkedList1: 
--------------------------------------------------------------------------------
   95:         if self.cursor.prev is None:
   96:             raise StopIteration()
   97:         else:
   98:             self.cursor.prev
-  99:             self.cursor = self.cursor.prev
+  99:             pass
  100:             return self.cursor.data
  101:     
  102:     def append(self, data):
  103:         ''' Note: The average time for append is O(n)
--------------------------------------------------------------------------------
[2.91096 s] survived

   - [# 134] SDL linkedList1: 
--------------------------------------------------------------------------------
   96:             raise StopIteration()
   97:         else:
   98:             self.cursor.prev
   99:             self.cursor = self.cursor.prev
- 100:             return self.cursor.data
+ 100:             pass
  101:     
  102:     def append(self, data):
  103:         ''' Note: The average time for append is O(n)
  104:             however, insertion is O(1), giving it an
--------------------------------------------------------------------------------
[2.90856 s] survived

   - [# 135] SDL linkedList1: 
--------------------------------------------------------------------------------
  104:             however, insertion is O(1), giving it an
  105:             advantage over arrays.
  106:         '''
  107:         if self.head is None:
- 108:             self.head = DoublyLinkedNode(data)
+ 108:             pass
  109:             self.cursor = self.head
  110:         else:
  111:             node = self.head
  112:             
--------------------------------------------------------------------------------
[6.45511 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0)

   - [# 136] SDL linkedList1: 
--------------------------------------------------------------------------------
  105:             advantage over arrays.
  106:         '''
  107:         if self.head is None:
  108:             self.head = DoublyLinkedNode(data)
- 109:             self.cursor = self.head
+ 109:             pass
  110:         else:
  111:             node = self.head
  112:             
  113:             while node.next is not None:
--------------------------------------------------------------------------------
[6.60564 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
