   - [# 139] SDL linkedList1: 
--------------------------------------------------------------------------------
  113:             while node.next is not None:
  114:                 node = node.next
  115:             
  116:             
- 117:             new_node = DoublyLinkedNode(data)
+ 117:             pass
  118:             node.next = new_node
  119:             new_node.prev = node
  120:         self.size += 1
  121:     
--------------------------------------------------------------------------------
[6.96773 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_64

def test_case_64():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.append(none_type_0)
        assert len(singly_linked_list_0) == 1
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_1 = doubly_linked_list_1.__contains__(singly_linked_node_2)
        assert var_1 is False

   - [# 140] SDL linkedList1: 
--------------------------------------------------------------------------------
  114:                 node = node.next
  115:             
  116:             
  117:             new_node = DoublyLinkedNode(data)
- 118:             node.next = new_node
+ 118:             pass
  119:             new_node.prev = node
  120:         self.size += 1
  121:     
  122:     def insert(self, data, index):
--------------------------------------------------------------------------------
[3.00263 s] survived

   - [# 141] SDL linkedList1: 
--------------------------------------------------------------------------------
  115:             
  116:             
  117:             new_node = DoublyLinkedNode(data)
  118:             node.next = new_node
- 119:             new_node.prev = node
+ 119:             pass
  120:         self.size += 1
  121:     
  122:     def insert(self, data, index):
  123:         if index >= self.size:
--------------------------------------------------------------------------------
[2.95864 s] survived

   - [# 144] SDL linkedList1: 
--------------------------------------------------------------------------------
  128:         
  129:         
  130:         elif index == self.size - 1:
  131:             
- 132:             self.append(data)
+ 132:             pass
  133:         
  134:         elif index == 0:
  135:             
  136:             
--------------------------------------------------------------------------------
[7.11453 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_556

def test_case_556():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__contains__(singly_linked_node_3)
        assert var_0 is False
        bytes_0 =

   - [# 145] SDL linkedList1: 
--------------------------------------------------------------------------------
  134:         elif index == 0:
  135:             
  136:             
  137:             
- 138:             a = self.head
+ 138:             pass
  139:             c = DoublyLinkedNode(data)
  140:             
  141:             
  142:             
--------------------------------------------------------------------------------
[2.84422 s] survived

   - [# 146] SDL linkedList1: 
--------------------------------------------------------------------------------
  135:             
  136:             
  137:             
  138:             a = self.head
- 139:             c = DoublyLinkedNode(data)
+ 139:             pass
  140:             
  141:             
  142:             
  143:             
--------------------------------------------------------------------------------
[2.90614 s] survived

   - [# 147] SDL linkedList1: 
--------------------------------------------------------------------------------
  140:             
  141:             
  142:             
  143:             
- 144:             self.head = c
+ 144:             pass
  145:             c.next = a
  146:             a.prev = c
  147:             self.cursor = self.head
  148:         else:
--------------------------------------------------------------------------------
[2.95727 s] survived

   - [# 148] SDL linkedList1: 
--------------------------------------------------------------------------------
  141:             
  142:             
  143:             
  144:             self.head = c
- 145:             c.next = a
+ 145:             pass
  146:             a.prev = c
  147:             self.cursor = self.head
  148:         else:
  149:             
--------------------------------------------------------------------------------
[2.93871 s] survived

   - [# 149] SDL linkedList1: 
--------------------------------------------------------------------------------
  142:             
  143:             
  144:             self.head = c
  145:             c.next = a
- 146:             a.prev = c
+ 146:             pass
  147:             self.cursor = self.head
  148:         else:
  149:             
  150:             a = self.head
--------------------------------------------------------------------------------
[2.83246 s] survived

   - [# 150] SDL linkedList1: 
--------------------------------------------------------------------------------
  143:             
  144:             self.head = c
  145:             c.next = a
  146:             a.prev = c
- 147:             self.cursor = self.head
+ 147:             pass
  148:         else:
  149:             
  150:             a = self.head
  151:             for x in range(index - 1):
--------------------------------------------------------------------------------
[2.92904 s] survived

   - [# 152] SDL linkedList1: 
--------------------------------------------------------------------------------
  148:         else:
  149:             
  150:             a = self.head
  151:             for x in range(index - 1):
- 152:                 a = a.next
+ 152:                 pass
  153:             
  154:             
  155:             
  156:             b = a.next
--------------------------------------------------------------------------------
[2.95904 s] survived

   - [# 153] SDL linkedList1: 
--------------------------------------------------------------------------------
  152:                 a = a.next
  153:             
  154:             
  155:             
- 156:             b = a.next
+ 156:             pass
  157:             c = DoublyLinkedNode(data)
  158:             
  159:             
  160:             
--------------------------------------------------------------------------------
[2.99727 s] survived

   - [# 154] SDL linkedList1: 
--------------------------------------------------------------------------------
  153:             
  154:             
  155:             
  156:             b = a.next
- 157:             c = DoublyLinkedNode(data)
+ 157:             pass
  158:             
  159:             
  160:             
  161:             
--------------------------------------------------------------------------------
[3.00099 s] survived

   - [# 155] SDL linkedList1: 
--------------------------------------------------------------------------------
  158:             
  159:             
  160:             
  161:             
- 162:             b.prev = c
+ 162:             pass
  163:             c.next = b
  164:             
  165:             
  166:             
--------------------------------------------------------------------------------
[3.03014 s] survived

   - [# 156] SDL linkedList1: 
--------------------------------------------------------------------------------
  159:             
  160:             
  161:             
  162:             b.prev = c
- 163:             c.next = b
+ 163:             pass
  164:             
  165:             
  166:             
  167:             
--------------------------------------------------------------------------------
[2.80084 s] survived

   - [# 157] SDL linkedList1: 
--------------------------------------------------------------------------------
  164:             
  165:             
  166:             
  167:             
- 168:             a.next = c
+ 168:             pass
  169:             c.prev = a
  170:         
  171:         self.size += 1
  172: 
--------------------------------------------------------------------------------
[2.85384 s] survived

   - [# 158] SDL linkedList1: 
--------------------------------------------------------------------------------
  165:             
  166:             
  167:             
  168:             a.next = c
- 169:             c.prev = a
+ 169:             pass
  170:         
  171:         self.size += 1
  172: 
  173: 
--------------------------------------------------------------------------------
[2.88676 s] survived

   - [# 160] SDL linkedList1: 
--------------------------------------------------------------------------------
  174: class DoublyLinkedNode(SinglyLinkedNode):
  175:     def __init__(self, data):
  176:         
  177:         super(DoublyLinkedNode, self).__init__(data)
- 178:         self.prev = None
+ 178:         pass
  179: 
  180: if __name__ == '__main__':
  181:     test = SinglyLinkedList()
  182:     test.append(2)
--------------------------------------------------------------------------------
[6.38942 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_4

def test_case_4():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
>       assert doubly_linked_node_0.prev is None
E       AttributeError: 'DoublyLinkedNode' object has no attribute 'prev'

RANDOM/test_linkedList1_RANDOM.py:57: AttributeError

   - [# 161] SDL linkedList1: 
--------------------------------------------------------------------------------
  177:         super(DoublyLinkedNode, self).__init__(data)
  178:         self.prev = None
  179: 
  180: if __name__ == '__main__':
- 181:     test = SinglyLinkedList()
+ 181:     pass
  182:     test.append(2)
  183:     test.append(3)
  184:     test.append(4)
  185:     
--------------------------------------------------------------------------------
[2.94272 s] survived

   - [# 162] SDL linkedList1: 
--------------------------------------------------------------------------------
  178:         self.prev = None
  179: 
  180: if __name__ == '__main__':
  181:     test = SinglyLinkedList()
- 182:     test.append(2)
+ 182:     pass
  183:     test.append(3)
  184:     test.append(4)
  185:     
  186:     print(test[0])
--------------------------------------------------------------------------------
[2.95967 s] survived

   - [# 163] SDL linkedList1: 
--------------------------------------------------------------------------------
  179: 
  180: if __name__ == '__main__':
  181:     test = SinglyLinkedList()
  182:     test.append(2)
- 183:     test.append(3)
+ 183:     pass
  184:     test.append(4)
  185:     
  186:     print(test[0])
  187:     print(test[1])
--------------------------------------------------------------------------------
[2.94057 s] survived

   - [# 164] SDL linkedList1: 
--------------------------------------------------------------------------------
  180: if __name__ == '__main__':
  181:     test = SinglyLinkedList()
  182:     test.append(2)
  183:     test.append(3)
- 184:     test.append(4)
+ 184:     pass
  185:     
  186:     print(test[0])
  187:     print(test[1])
  188:     print(test[2])
--------------------------------------------------------------------------------
[2.94633 s] survived

   - [# 165] SDL linkedList1: 
--------------------------------------------------------------------------------
  182:     test.append(2)
  183:     test.append(3)
  184:     test.append(4)
  185:     
- 186:     print(test[0])
+ 186:     pass
  187:     print(test[1])
  188:     print(test[2])
  189:     print(test[-1])
--------------------------------------------------------------------------------
[2.85119 s] survived

   - [# 166] SDL linkedList1: 
--------------------------------------------------------------------------------
  183:     test.append(3)
  184:     test.append(4)
  185:     
  186:     print(test[0])
- 187:     print(test[1])
+ 187:     pass
  188:     print(test[2])
  189:     print(test[-1])
--------------------------------------------------------------------------------
[2.95287 s] survived

   - [# 167] SDL linkedList1: 
--------------------------------------------------------------------------------
  184:     test.append(4)
  185:     
  186:     print(test[0])
  187:     print(test[1])
- 188:     print(test[2])
+ 188:     pass
  189:     print(test[-1])
--------------------------------------------------------------------------------
[2.90558 s] survived

   - [# 168] SDL linkedList1: 
--------------------------------------------------------------------------------
  185:     
  186:     print(test[0])
  187:     print(test[1])
  188:     print(test[2])
- 189:     print(test[-1])
+ 189:     pass
--------------------------------------------------------------------------------
[2.96792 s] survived

   - [# 172] SVD linkedList1: 
--------------------------------------------------------------------------------
   11:         self.size = 0
   12:         self.cursor = None
   13:     
   14:     def __len__(self):
-  15:         return self.size
+  15:         return size
   16:     
   17:     def __iter__(self):
   18:         return self
   19:     
--------------------------------------------------------------------------------
[6.77949 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_2

def test_case_2():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0

RANDOM/test_linkedList1_RANDOM.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.DoublyLinkedList object at 0x7fd0ebd77be0>

>   ???
E   NameError: name 'size' is not defined

linkedList1:15: NameError

   - [# 173] SVD linkedList1: 
--------------------------------------------------------------------------------
   17:     def __iter__(self):
   18:         return self
   19:     
   20:     def __contains__(self, item):
-  21:         if self.head is not None:
+  21:         if head is not None:
   22:             cur = self.head
   23:             while cur is not None:
   24:                 if cur.data is item:
   25:                     return True
--------------------------------------------------------------------------------
[6.70788 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_15

def test_case_15():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
>       var_0 = doubly_linked_list_0.__contains__(singly_linked_node_0)

RANDOM/test_linkedList1_RANDOM.py:317: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.DoublyLinkedList object at 0x7fd0ed5a8e20>
item = <linkedList1.SinglyLinkedNode object at 0x7fd0ed5a8d90>

>   ???
E   NameError: name 'head' is not defined

linkedList1:21: NameError

   - [# 174] SVD linkedList1: 
--------------------------------------------------------------------------------
   18:         return self
   19:     
   20:     def __contains__(self, item):
   21:         if self.head is not None:
-  22:             cur = self.head
+  22:             cur = head
   23:             while cur is not None:
   24:                 if cur.data is item:
   25:                     return True
   26:                 cur = cur.next
--------------------------------------------------------------------------------
[6.83706 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_116

def test_case_116():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)

   - [# 175] SVD linkedList1: 
--------------------------------------------------------------------------------
   31:         for linked lists they run in O(n) time making them less
   32:         efficient than a list() for lookups
   33:     '''
   34:     def __getitem__(self, index):
-  35:         if (index >= self.size or index < 0):
+  35:         if (index >= size or index < 0):
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
--------------------------------------------------------------------------------
[7.57981 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.SinglyLinkedNo

   - [# 176] SVD linkedList1: 
--------------------------------------------------------------------------------
   34:     def __getitem__(self, index):
   35:         if (index >= self.size or index < 0):
   36:             raise IndexError()
   37:         else:
-  38:             cur = self.head
+  38:             cur = head
   39:             for x in range(index):
   40:                 cur = cur.next
   41:             return cur.data
   42:     
--------------------------------------------------------------------------------
[7.44555 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_901

def test_case_901():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        singly_linked_node_2 = module_0.SinglyLinkedNode(singly_linked_node_1)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_node_0.data) == 0
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        singly_linked_node_3 = module_0.SinglyLinkedNode(doubly_linked_list_1)
        assert len(singly_linked_node_3.data)

   - [# 177] SVD linkedList1: 
--------------------------------------------------------------------------------
   40:                 cur = cur.next
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
-  44:         if (index >= self.size or index < 0):
+  44:         if (index >= size or index < 0):
   45:             raise IndexError()
   46:         else:
   47:             cur = self.head
   48:             for x in range(index):
--------------------------------------------------------------------------------
[6.85061 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_458

def test_case_458():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        bool_3 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_3)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_3)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_3)
        assert doubly_linked_node_0.data is Tru

   - [# 179] SVD linkedList1: 
--------------------------------------------------------------------------------
   49:                 cur = cur.next
   50:             cur.data = value
   51:     
   52:     def next(self):
-  53:         if self.cursor is None:
+  53:         if cursor is None:
   54:             raise StopIteration()
   55:         else:
   56:             node = self.cursor.data
   57:             self.cursor = self.cursor.next
--------------------------------------------------------------------------------
[6.74430 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        v

   - [# 180] SVD linkedList1: 
--------------------------------------------------------------------------------
   52:     def next(self):
   53:         if self.cursor is None:
   54:             raise StopIteration()
   55:         else:
-  56:             node = self.cursor.data
+  56:             node = cursor.data
   57:             self.cursor = self.cursor.next
   58:             return node
   59:     
   60:     def append(self, data):
--------------------------------------------------------------------------------
[6.53523 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0
