   - [# 182] SVD linkedList1: 
--------------------------------------------------------------------------------
   53:         if self.cursor is None:
   54:             raise StopIteration()
   55:         else:
   56:             node = self.cursor.data
-  57:             self.cursor = self.cursor.next
+  57:             self.cursor = cursor.next
   58:             return node
   59:     
   60:     def append(self, data):
   61:         ''' Note: The average time for append is O(n)
--------------------------------------------------------------------------------
[6.66014 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_93

def test_case_93():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(singly_linked_node_1)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        bool_1 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len

   - [# 183] SVD linkedList1: 
--------------------------------------------------------------------------------
   61:         ''' Note: The average time for append is O(n)
   62:             however, insertion is O(1), giving it an
   63:             advantage over arrays.
   64:         '''
-  65:         if self.head is None:
+  65:         if head is None:
   66:             self.head = SinglyLinkedNode(data)
   67:             self.cursor = self.head
   68:         else:
   69:             node = self.head
--------------------------------------------------------------------------------
[6.57970 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_32

def test_case_32():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
>       var_0 = singly_linked_list_0.append(none_type_0)

RANDOM/test_linkedList1_RANDOM.py:896: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.SinglyLinkedList object at 0x7fd0ee8e69b0>, data = None

>   ???
E   NameError: name 'head' is not defined

linkedList1:65: NameError

   - [# 186] SVD linkedList1: 
--------------------------------------------------------------------------------
   63:             advantage over arrays.
   64:         '''
   65:         if self.head is None:
   66:             self.head = SinglyLinkedNode(data)
-  67:             self.cursor = self.head
+  67:             self.cursor = head
   68:         else:
   69:             node = self.head
   70:             
   71:             while node.next is not None:
--------------------------------------------------------------------------------
[6.79688 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_32

def test_case_32():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
>       var_0 = singly_linked_list_0.append(none_type_0)

RANDOM/test_linkedList1_RANDOM.py:896: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList1.SinglyLinkedList object at 0x7fd0ede176d0>, data = None

>   ???
E   NameError: name 'head' is not defined

linkedList1:67: NameError

   - [# 187] SVD linkedList1: 
--------------------------------------------------------------------------------
   65:         if self.head is None:
   66:             self.head = SinglyLinkedNode(data)
   67:             self.cursor = self.head
   68:         else:
-  69:             node = self.head
+  69:             node = head
   70:             
   71:             while node.next is not None:
   72:                 node = node.next
   73:             
--------------------------------------------------------------------------------
[6.67850 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_41

def test_case_41():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert f'{type(doubly_linked_list_0).__module__}.{type(doubly_linked_list_0).__qualname__}' == 'linkedList1.DoublyLinkedList'
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__contains__(singly_linked_node_0)
        assert var_0 is False
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_3 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_3) == 0
        var_1 = doubly_linked_list_3.append(doubly_linked_list_3)
        assert len(doubly_linked_list_3) == 1
        bool_2 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)

   - [# 191] SVD linkedList1: 
--------------------------------------------------------------------------------
   91:         
   92:         super(DoublyLinkedList, self).__init__()
   93:     
   94:     def previous(self):
-  95:         if self.cursor.prev is None:
+  95:         if cursor.prev is None:
   96:             raise StopIteration()
   97:         else:
   98:             self.cursor.prev
   99:             self.cursor = self.cursor.prev
--------------------------------------------------------------------------------
[7.92201 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_1206

def test_case_1206():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = None
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.append(none_type_0)
        assert len(singly_linked_list_0) == 1
        bool_1 = False
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.append(doubly_linked_list_1)
        assert len(doubly_linke

   - [# 192] SVD linkedList1: 
--------------------------------------------------------------------------------
   94:     def previous(self):
   95:         if self.cursor.prev is None:
   96:             raise StopIteration()
   97:         else:
-  98:             self.cursor.prev
+  98:             cursor.prev
   99:             self.cursor = self.cursor.prev
  100:             return self.cursor.data
  101:     
  102:     def append(self, data):
--------------------------------------------------------------------------------
[2.64417 s] survived

   - [# 194] SVD linkedList1: 
--------------------------------------------------------------------------------
   95:         if self.cursor.prev is None:
   96:             raise StopIteration()
   97:         else:
   98:             self.cursor.prev
-  99:             self.cursor = self.cursor.prev
+  99:             self.cursor = cursor.prev
  100:             return self.cursor.data
  101:     
  102:     def append(self, data):
  103:         ''' Note: The average time for append is O(n)
--------------------------------------------------------------------------------
[2.82874 s] survived

   - [# 195] SVD linkedList1: 
--------------------------------------------------------------------------------
   96:             raise StopIteration()
   97:         else:
   98:             self.cursor.prev
   99:             self.cursor = self.cursor.prev
- 100:             return self.cursor.data
+ 100:             return cursor.data
  101:     
  102:     def append(self, data):
  103:         ''' Note: The average time for append is O(n)
  104:             however, insertion is O(1), giving it an
--------------------------------------------------------------------------------
[2.78702 s] survived

   - [# 199] SVD linkedList1: 
--------------------------------------------------------------------------------
  105:             advantage over arrays.
  106:         '''
  107:         if self.head is None:
  108:             self.head = DoublyLinkedNode(data)
- 109:             self.cursor = self.head
+ 109:             self.cursor = head
  110:         else:
  111:             node = self.head
  112:             
  113:             while node.next is not None:
--------------------------------------------------------------------------------
[6.41946 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_16

def test_case_16():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_1 = True
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None

   - [# 202] SVD linkedList1: 
--------------------------------------------------------------------------------
  119:             new_node.prev = node
  120:         self.size += 1
  121:     
  122:     def insert(self, data, index):
- 123:         if index >= self.size:
+ 123:         if index >= size:
  124:             raise IndexError()
  125:         if self.head is None:
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
--------------------------------------------------------------------------------
[6.50069 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_220

def test_case_220():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.__len__()
        assert var_0 == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__iter__()
        assert len(var_1) == 0
        bool_2 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_

   - [# 203] SVD linkedList1: 
--------------------------------------------------------------------------------
  121:     
  122:     def insert(self, data, index):
  123:         if index >= self.size:
  124:             raise IndexError()
- 125:         if self.head is None:
+ 125:         if head is None:
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
  128:         
  129:         
--------------------------------------------------------------------------------
[6.39644 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_220

def test_case_220():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_1)
        var_0 = doubly_linked_list_0.__len__()
        assert var_0 == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__iter__()
        assert len(var_1) == 0
        bool_2 = True
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_5 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_2 = doubly_linked_l

   - [# 207] SVD linkedList1: 
--------------------------------------------------------------------------------
  126:             self.head = DoublyLinkedNode(data)
  127:             self.cursor = self.head
  128:         
  129:         
- 130:         elif index == self.size - 1:
+ 130:         elif index == size - 1:
  131:             
  132:             self.append(data)
  133:         
  134:         elif index == 0:
--------------------------------------------------------------------------------
[6.81888 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_556

def test_case_556():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__contains

   - [# 208] SVD linkedList1: 
--------------------------------------------------------------------------------
  128:         
  129:         
  130:         elif index == self.size - 1:
  131:             
- 132:             self.append(data)
+ 132:             append(data)
  133:         
  134:         elif index == 0:
  135:             
  136:             
--------------------------------------------------------------------------------
[6.91071 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_556

def test_case_556():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_1)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is None
        assert doubly_linked_node_0.prev is None
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_list_2 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_2) == 0
        var_0 = doubly_linked_list_1.__contains__(singly_linked_node_3)
        assert var_0 is False
        b

   - [# 209] SVD linkedList1: 
--------------------------------------------------------------------------------
  134:         elif index == 0:
  135:             
  136:             
  137:             
- 138:             a = self.head
+ 138:             a = head
  139:             c = DoublyLinkedNode(data)
  140:             
  141:             
  142:             
--------------------------------------------------------------------------------
[2.79025 s] survived

   - [# 212] SVD linkedList1: 
--------------------------------------------------------------------------------
  143:             
  144:             self.head = c
  145:             c.next = a
  146:             a.prev = c
- 147:             self.cursor = self.head
+ 147:             self.cursor = head
  148:         else:
  149:             
  150:             a = self.head
  151:             for x in range(index - 1):
--------------------------------------------------------------------------------
[2.77567 s] survived

   - [# 216] ZIL linkedList1: 
--------------------------------------------------------------------------------
   20:     def __contains__(self, item):
   21:         if self.head is not None:
   22:             cur = self.head
   23:             while cur is not None:
-  24:                 if cur.data is item:
-  25:                     return True
-  26:                 cur = cur.next
+  24:                 break
+  25:         
+  26:         
   27:         return False
   28:     
   29:     ''' Both getitem and setitem represent the magic methods
   30:         for the object[index] and object[index] = other operations
--------------------------------------------------------------------------------
[6.66501 s] killed by RANDOM/test_linkedList1_RANDOM.py::test_case_257

def test_case_257():
        bool_0 = True
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        assert f'{type(singly_linked_node_0).__module__}.{type(singly_linked_node_0).__qualname__}' == 'linkedList1.SinglyLinkedNode'
        assert singly_linked_node_0.data is True
        assert singly_linked_node_0.next is None
        bool_1 = True
        singly_linked_node_1 = module_0.SinglyLinkedNode(bool_1)
        singly_linked_node_2 = module_0.SinglyLinkedNode(bool_1)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        bool_2 = True
        singly_linked_node_3 = module_0.SinglyLinkedNode(bool_2)
        singly_linked_node_4 = module_0.SinglyLinkedNode(bool_2)
        doubly_linked_node_0 = module_0.DoublyLinkedNode(bool_2)
        assert doubly_linked_node_0.data is True
        assert doubly_linked_node_0.next is

   - [# 217] ZIL linkedList1: 
--------------------------------------------------------------------------------
   36:             raise IndexError()
   37:         else:
   38:             cur = self.head
   39:             for x in range(index):
-  40:                 cur = cur.next
+  40:                 break
   41:             return cur.data
   42:     
   43:     def __setitem__(self, index, value):
   44:         if (index >= self.size or index < 0):
--------------------------------------------------------------------------------
[2.84210 s] survived

   - [# 219] ZIL linkedList1: 
--------------------------------------------------------------------------------
   68:         else:
   69:             node = self.head
   70:             
   71:             while node.next is not None:
-  72:                 node = node.next
+  72:                 break
   73:             
   74:             
   75:             new_node = SinglyLinkedNode(data)
   76:             
--------------------------------------------------------------------------------
[2.74859 s] survived

   - [# 221] ZIL linkedList1: 
--------------------------------------------------------------------------------
  148:         else:
  149:             
  150:             a = self.head
  151:             for x in range(index - 1):
- 152:                 a = a.next
+ 152:                 break
  153:             
  154:             
  155:             
  156:             b = a.next
--------------------------------------------------------------------------------
[2.71743 s] survived
