   - [#   1] ASR linkedList2: 
--------------------------------------------------------------------------------
  72:         '''Count values in list.'''
  73:         n = self.head
  74:         count = 0
  75:         while n != None:
- 76:             count += 1
+ 76:             count -= 1
  77:             n = n.next
  78:         return count
--------------------------------------------------------------------------------
[0.07977 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       ValueError: __len__() should return >= 0

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: ValueError

   - [#   2] CDI linkedList2: 
--------------------------------------------------------------------------------
   3: 
   4:     Author: George Heineman
   5: '''
   6: class LinkedNode:
-  7:     def __init__(self, value, tail=None):
-  8:         '''Node in a Linked List.'''
-  9:         self.value = value
- 10:         self.next = tail
- 11:     
+  7:     @classmethod
+  8:     def __init__(self, value, tail=None):
+  9:         '''Node in a Linked List.'''
+ 10:         self.value = value
+ 11:         self.next = tail
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
  15:         while (p1 != None and p2 != None):
--------------------------------------------------------------------------------
[0.07749 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_2

def test_case_2():
        complex_0 = 1460.7871768642246 + 580.97j
        linked_node_0 = module_0.LinkedNode(complex_0)
        linked_node_1 = module_0.LinkedNode(linked_node_0, linked_node_0)
        var_0 = linked_node_1.checkInfinite()
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:20: AssertionError

   - [#   3] CDI linkedList2: 
--------------------------------------------------------------------------------
   8:         '''Node in a Linked List.'''
   9:         self.value = value
  10:         self.next = tail
  11:     
- 12:     def checkInfinite(self):
- 13:         '''Check whether infinite loop via next.'''
- 14:         p1 = p2 = self
- 15:         while (p1 != None and p2 != None):
- 16:             if p2.next == None:
- 17:                 return False
- 18:             p1 = p1.next
- 19:             p2 = p2.next.next
- 20:             
- 21:             if p1 == p2:
- 22:                 return True
- 23:         return False
- 24: class LinkedList:
- 25:     def __init__(self, *start):
- 26:         '''Demonstrate linked lists in Python.'''
- 27:         self.head = None
- 28:         for _ in start:
- 29:             self.prepend(_)
- 30:     
+ 12:     @classmethod
+ 13:     def checkInfinite(self):
+ 14:         '''Check whether infinite loop via next.'''
+ 15:         p1 = p2 = self
+ 16:         while (p1 != None and p2 != None):
+ 17:             if p2.next == None:
+ 18:                 return False
+ 19:             p1 = p1.next
+ 20:             p2 = p2.next.next
+ 21:             
+ 22:             if p1 == p2:
+ 23:                 return True
+ 24:         return False
+ 25: class LinkedList:
+ 26:     def __init__(self, *start):
+ 27:         '''Demonstrate linked lists in Python.'''
+ 28:         self.head = None
+ 29:         for _ in start:
+ 30:             self.prepend(_)
  31:     def prepend(self, value):

   - [#   5] CDI linkedList2: 
--------------------------------------------------------------------------------
  27:         self.head = None
  28:         for _ in start:
  29:             self.prepend(_)
  30:     
- 31:     def prepend(self, value):
- 32:         '''Prepend element into list.'''
- 33:         self.head = LinkedNode(value, self.head)
- 34:     
+ 31:     @classmethod
+ 32:     def prepend(self, value):
+ 33:         '''Prepend element into list.'''
+ 34:         self.head = LinkedNode(value, self.head)
  35:     def pop(self):
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
  38:             raise Exception('Linked list is empty.')
--------------------------------------------------------------------------------
[0.07689 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
>       linked_list_0 = module_0.LinkedList(*str_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList2:29: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList2.LinkedList'>, value = 'B'

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

linkedList2:34: AttributeError

   - [#   6] CDI linkedList2: 
--------------------------------------------------------------------------------
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
  33:         self.head = LinkedNode(value, self.head)
  34:     
- 35:     def pop(self):
- 36:         '''Remove first value in list.'''
- 37:         if self.head is None:
- 38:             raise Exception('Linked list is empty.')
- 39:         val = self.head.value
- 40:         self.head = self.head.next
- 41:         return val
- 42:     
+ 35:     @classmethod
+ 36:     def pop(self):
+ 37:         '''Remove first value in list.'''
+ 38:         if self.head is None:
+ 39:             raise Exception('Linked list is empty.')
+ 40:         val = self.head.value
+ 41:         self.head = self.head.next
+ 42:         return val
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
  45:         n = self.head
  46:         last = None
--------------------------------------------------------------------------------
[0.07697 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.pop()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList2.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

linkedList2:38: AttributeError

   - [#   7] CDI linkedList2: 
--------------------------------------------------------------------------------
  39:         val = self.head.value
  40:         self.head = self.head.next
  41:         return val
  42:     
- 43:     def remove(self, value):
- 44:         '''Remove value from list.'''
- 45:         n = self.head
- 46:         last = None
- 47:         while n != None:
- 48:             if n.value == value:
- 49:                 if last == None:
- 50:                     self.head = self.head.next
- 51:                 else:
- 52:                     last.next = n.next
- 53:                 return True
- 54:             n = n.next
- 55:         return False
- 56:     
+ 43:     @classmethod
+ 44:     def remove(self, value):
+ 45:         '''Remove value from list.'''
+ 46:         n = self.head
+ 47:         last = None
+ 48:         while n != None:
+ 49:             if n.value == value:
+ 50:                 if last == None:
+ 51:                     self.head = self.head.next
+ 52:                 else:
+ 53:                     last.next = n.next
+ 54:                 return True
+ 55:             n = n.next
+ 56:         return False
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
  59:         n = self.head
  60:         while n != None:
--------------------------------------------------------------------------------
[0.07798 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)

   - [#   8] CDI linkedList2: 
--------------------------------------------------------------------------------
  53:                 return True
  54:             n = n.next
  55:         return False
  56:     
- 57:     def __iter__(self):
- 58:         '''Iterator of values in the list.'''
- 59:         n = self.head
- 60:         while n != None:
- 61:             yield n.value
- 62:             n = n.next
- 63:     
+ 57:     @classmethod
+ 58:     def __iter__(self):
+ 59:         '''Iterator of values in the list.'''
+ 60:         n = self.head
+ 61:         while n != None:
+ 62:             yield n.value
+ 63:             n = n.next
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
  67:             return 'link:[]'
--------------------------------------------------------------------------------
[0.08103 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
>       var_0 = linked_list_0.__repr__()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList2:69: in __repr__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList2.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

linkedList2:60: AttributeError

   - [#   9] CDI linkedList2: 
--------------------------------------------------------------------------------
  60:         while n != None:
  61:             yield n.value
  62:             n = n.next
  63:     
- 64:     def __repr__(self):
- 65:         '''String representation of linked list.'''
- 66:         if self.head is None:
- 67:             return 'link:[]'
- 68:         
- 69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
- 70:     
+ 64:     @classmethod
+ 65:     def __repr__(self):
+ 66:         '''String representation of linked list.'''
+ 67:         if self.head is None:
+ 68:             return 'link:[]'
+ 69:         
+ 70:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
  74:         count = 0
--------------------------------------------------------------------------------
[0.08191 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
>       var_0 = linked_list_0.__repr__()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList2.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

linkedList2:67: AttributeError

   - [#  10] CDI linkedList2: 
--------------------------------------------------------------------------------
  67:             return 'link:[]'
  68:         
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
- 71:     def __len__(self):
- 72:         '''Count values in list.'''
- 73:         n = self.head
- 74:         count = 0
- 75:         while n != None:
- 76:             count += 1
- 77:             n = n.next
- 78:         return count
+ 71:     @classmethod
+ 72:     def __len__(self):
+ 73:         '''Count values in list.'''
+ 74:         n = self.head
+ 75:         count = 0
+ 76:         while n != None:
+ 77:             count += 1
+ 78:             n = n.next
+ 79:         return count
--------------------------------------------------------------------------------
[0.07983 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList2.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

linkedList2:74: AttributeError

   - [#  11] COI linkedList2: 
--------------------------------------------------------------------------------
  11:     
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
- 15:         while (p1 != None and p2 != None):
+ 15:         while not ((p1 != None and p2 != None)):
  16:             if p2.next == None:
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
--------------------------------------------------------------------------------
[0.07774 s] survived

   - [#  12] COI linkedList2: 
--------------------------------------------------------------------------------
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
  15:         while (p1 != None and p2 != None):
- 16:             if p2.next == None:
+ 16:             if not (p2.next == None):
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
  20:             
--------------------------------------------------------------------------------
[0.07339 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_0

def test_case_0():
        str_0 = '4-?Fk.6R79JM\rhc'
        linked_node_0 = module_0.LinkedNode(str_0)
>       var_0 = linked_node_0.checkInfinite()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList2.LinkedNode object at 0x7fc3b0002530>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList2:19: AttributeError

   - [#  13] COI linkedList2: 
--------------------------------------------------------------------------------
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
  20:             
- 21:             if p1 == p2:
+ 21:             if not (p1 == p2):
  22:                 return True
  23:         return False
  24: class LinkedList:
  25:     def __init__(self, *start):
--------------------------------------------------------------------------------
[0.07777 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_2

def test_case_2():
        complex_0 = 1460.7871768642246 + 580.97j
        linked_node_0 = module_0.LinkedNode(complex_0)
        linked_node_1 = module_0.LinkedNode(linked_node_0, linked_node_0)
        var_0 = linked_node_1.checkInfinite()
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:20: AssertionError

   - [#  14] COI linkedList2: 
--------------------------------------------------------------------------------
  33:         self.head = LinkedNode(value, self.head)
  34:     
  35:     def pop(self):
  36:         '''Remove first value in list.'''
- 37:         if self.head is None:
+ 37:         if not (self.head is None):
  38:             raise Exception('Linked list is empty.')
  39:         val = self.head.value
  40:         self.head = self.head.next
  41:         return val
--------------------------------------------------------------------------------
[0.09239 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.pop()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3afe841c0>

>   ???
E   Exception: Linked list is empty.

linkedList2:38: Exception

   - [#  15] COI linkedList2: 
--------------------------------------------------------------------------------
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
  45:         n = self.head
  46:         last = None
- 47:         while n != None:
+ 47:         while not (n != None):
  48:             if n.value == value:
  49:                 if last == None:
  50:                     self.head = self.head.next
  51:                 else:
--------------------------------------------------------------------------------
[0.07687 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.remove(linked_list_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:58: AssertionError

   - [#  16] COI linkedList2: 
--------------------------------------------------------------------------------
  44:         '''Remove value from list.'''
  45:         n = self.head
  46:         last = None
  47:         while n != None:
- 48:             if n.value == value:
+ 48:             if not (n.value == value):
  49:                 if last == None:
  50:                     self.head = self.head.next
  51:                 else:
  52:                     last.next = n.next
--------------------------------------------------------------------------------
[0.07626 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.remove(linked_list_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:58: AssertionError

   - [#  17] COI linkedList2: 
--------------------------------------------------------------------------------
  45:         n = self.head
  46:         last = None
  47:         while n != None:
  48:             if n.value == value:
- 49:                 if last == None:
+ 49:                 if not (last == None):
  50:                     self.head = self.head.next
  51:                 else:
  52:                     last.next = n.next
  53:                 return True
--------------------------------------------------------------------------------
[0.07858 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.remove(linked_list_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:57: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3affbf7c0>
value = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3affbf7c0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList2:52: AttributeError

   - [#  18] COI linkedList2: 
--------------------------------------------------------------------------------
  56:     
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
  59:         n = self.head
- 60:         while n != None:
+ 60:         while not (n != None):
  61:             yield n.value
  62:             n = n.next
  63:     
  64:     def __repr__(self):
--------------------------------------------------------------------------------
[0.08275 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  19] COI linkedList2: 
--------------------------------------------------------------------------------
  62:             n = n.next
  63:     
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
- 66:         if self.head is None:
+ 66:         if not (self.head is None):
  67:             return 'link:[]'
  68:         
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
--------------------------------------------------------------------------------
[0.08218 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  20] COI linkedList2: 
--------------------------------------------------------------------------------
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
  74:         count = 0
- 75:         while n != None:
+ 75:         while not (n != None):
  76:             count += 1
  77:             n = n.next
  78:         return count
--------------------------------------------------------------------------------
[0.07891 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError

   - [#  21] CRP linkedList2: 
--------------------------------------------------------------------------------
  34:     
  35:     def pop(self):
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
- 38:             raise Exception('Linked list is empty.')
+ 38:             raise Exception('mutpy')
  39:         val = self.head.value
  40:         self.head = self.head.next
  41:         return val
  42:     
--------------------------------------------------------------------------------
[0.07864 s] survived

   - [#  22] CRP linkedList2: 
--------------------------------------------------------------------------------
  34:     
  35:     def pop(self):
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
- 38:             raise Exception('Linked list is empty.')
+ 38:             raise Exception('')
  39:         val = self.head.value
  40:         self.head = self.head.next
  41:         return val
  42:     
--------------------------------------------------------------------------------
[0.07706 s] survived

   - [#  23] CRP linkedList2: 
--------------------------------------------------------------------------------
  63:     
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
- 67:             return 'link:[]'
+ 67:             return 'mutpy'
  68:         
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
  71:     def __len__(self):
--------------------------------------------------------------------------------
[0.08360 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_15

def test_case_15():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:108: AssertionError

   - [#  24] CRP linkedList2: 
--------------------------------------------------------------------------------
  63:     
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
- 67:             return 'link:[]'
+ 67:             return ''
  68:         
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
  71:     def __len__(self):
--------------------------------------------------------------------------------
[0.08544 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_15

def test_case_15():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:108: AssertionError

   - [#  25] CRP linkedList2: 
--------------------------------------------------------------------------------
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
  67:             return 'link:[]'
  68:         
- 69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
+ 69:         return 'mutpy'.format(','.join(map(str, self)))
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
--------------------------------------------------------------------------------
[0.08306 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  26] CRP linkedList2: 
--------------------------------------------------------------------------------
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
  67:             return 'link:[]'
  68:         
- 69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
+ 69:         return ''.format(','.join(map(str, self)))
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
--------------------------------------------------------------------------------
[0.08360 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  27] CRP linkedList2: 
--------------------------------------------------------------------------------
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
  67:             return 'link:[]'
  68:         
- 69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
+ 69:         return 'link:[{0:s}]'.format('mutpy'.join(map(str, self)))
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
--------------------------------------------------------------------------------
[0.08368 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  28] CRP linkedList2: 
--------------------------------------------------------------------------------
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
  67:             return 'link:[]'
  68:         
- 69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
+ 69:         return 'link:[{0:s}]'.format(''.join(map(str, self)))
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
--------------------------------------------------------------------------------
[0.08341 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError
