   - [#  31] LCR linkedList2: 
--------------------------------------------------------------------------------
  11:     
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
- 15:         while (p1 != None and p2 != None):
+ 15:         while (p1 != None or p2 != None):
  16:             if p2.next == None:
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
--------------------------------------------------------------------------------
[0.07409 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_2

def test_case_2():
        complex_0 = 1460.7871768642246 + 580.97j
        linked_node_0 = module_0.LinkedNode(complex_0)
        linked_node_1 = module_0.LinkedNode(linked_node_0, linked_node_0)
>       var_0 = linked_node_1.checkInfinite()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList2.LinkedNode object at 0x7fc3b0025360>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList2:16: AttributeError

   - [#  32] OIL linkedList2: 
--------------------------------------------------------------------------------
  19:             p2 = p2.next.next
  20:             
  21:             if p1 == p2:
  22:                 return True
- 23:         return False
- 24: class LinkedList:
- 25:     def __init__(self, *start):
- 26:         '''Demonstrate linked lists in Python.'''
- 27:         self.head = None
- 28:         for _ in start:
- 29:             self.prepend(_)
- 30:     
+ 23:             break
+ 24:         return False
+ 25: class LinkedList:
+ 26:     def __init__(self, *start):
+ 27:         '''Demonstrate linked lists in Python.'''
+ 28:         self.head = None
+ 29:         for _ in start:
+ 30:             self.prepend(_)
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
  33:         self.head = LinkedNode(value, self.head)
  34:     
--------------------------------------------------------------------------------
[0.07708 s] survived

   - [#  33] OIL linkedList2: 
--------------------------------------------------------------------------------
  26:         '''Demonstrate linked lists in Python.'''
  27:         self.head = None
  28:         for _ in start:
  29:             self.prepend(_)
- 30:     
+ 30:             break
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
  33:         self.head = LinkedNode(value, self.head)
  34:     
--------------------------------------------------------------------------------
[0.07874 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError

   - [#  34] OIL linkedList2: 
--------------------------------------------------------------------------------
  51:                 else:
  52:                     last.next = n.next
  53:                 return True
  54:             n = n.next
- 55:         return False
- 56:     
+ 55:             break
+ 56:         return False
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
  59:         n = self.head
  60:         while n != None:
--------------------------------------------------------------------------------
[0.07923 s] survived

   - [#  35] OIL linkedList2: 
--------------------------------------------------------------------------------
  59:         n = self.head
  60:         while n != None:
  61:             yield n.value
  62:             n = n.next
- 63:     
+ 63:             break
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
  67:             return 'link:[]'
--------------------------------------------------------------------------------
[0.08274 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  36] OIL linkedList2: 
--------------------------------------------------------------------------------
  74:         count = 0
  75:         while n != None:
  76:             count += 1
  77:             n = n.next
- 78:         return count
+ 78:             break
+ 79:         return count
--------------------------------------------------------------------------------
[0.07722 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError

   - [#  37] RIL linkedList2: 
--------------------------------------------------------------------------------
  24: class LinkedList:
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
  27:         self.head = None
- 28:         for _ in start:
+ 28:         for _ in reversed(start):
  29:             self.prepend(_)
  30:     
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
--------------------------------------------------------------------------------
[0.08332 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  38] ROR linkedList2: 
--------------------------------------------------------------------------------
  11:     
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
- 15:         while (p1 != None and p2 != None):
+ 15:         while (p1 == None and p2 != None):
  16:             if p2.next == None:
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
--------------------------------------------------------------------------------
[0.07876 s] survived

   - [#  39] ROR linkedList2: 
--------------------------------------------------------------------------------
  11:     
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
- 15:         while (p1 != None and p2 != None):
+ 15:         while (p1 != None and p2 == None):
  16:             if p2.next == None:
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
--------------------------------------------------------------------------------
[0.07745 s] survived

   - [#  40] ROR linkedList2: 
--------------------------------------------------------------------------------
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
  15:         while (p1 != None and p2 != None):
- 16:             if p2.next == None:
+ 16:             if p2.next != None:
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
  20:             
--------------------------------------------------------------------------------
[0.07473 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_0

def test_case_0():
        str_0 = '4-?Fk.6R79JM\rhc'
        linked_node_0 = module_0.LinkedNode(str_0)
>       var_0 = linked_node_0.checkInfinite()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList2.LinkedNode object at 0x7fc3b01b9510>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList2:19: AttributeError

   - [#  41] ROR linkedList2: 
--------------------------------------------------------------------------------
  17:                 return False
  18:             p1 = p1.next
  19:             p2 = p2.next.next
  20:             
- 21:             if p1 == p2:
+ 21:             if p1 != p2:
  22:                 return True
  23:         return False
  24: class LinkedList:
  25:     def __init__(self, *start):
--------------------------------------------------------------------------------
[0.07835 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_2

def test_case_2():
        complex_0 = 1460.7871768642246 + 580.97j
        linked_node_0 = module_0.LinkedNode(complex_0)
        linked_node_1 = module_0.LinkedNode(linked_node_0, linked_node_0)
        var_0 = linked_node_1.checkInfinite()
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:20: AssertionError

   - [#  42] ROR linkedList2: 
--------------------------------------------------------------------------------
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
  45:         n = self.head
  46:         last = None
- 47:         while n != None:
+ 47:         while n == None:
  48:             if n.value == value:
  49:                 if last == None:
  50:                     self.head = self.head.next
  51:                 else:
--------------------------------------------------------------------------------
[0.07730 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.remove(linked_list_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:58: AssertionError

   - [#  44] ROR linkedList2: 
--------------------------------------------------------------------------------
  45:         n = self.head
  46:         last = None
  47:         while n != None:
  48:             if n.value == value:
- 49:                 if last == None:
+ 49:                 if last != None:
  50:                     self.head = self.head.next
  51:                 else:
  52:                     last.next = n.next
  53:                 return True
--------------------------------------------------------------------------------
[0.08047 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.remove(linked_list_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:57: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3aff45ab0>
value = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3aff45ab0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList2:52: AttributeError

   - [#  45] ROR linkedList2: 
--------------------------------------------------------------------------------
  56:     
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
  59:         n = self.head
- 60:         while n != None:
+ 60:         while n == None:
  61:             yield n.value
  62:             n = n.next
  63:     
  64:     def __repr__(self):
--------------------------------------------------------------------------------
[0.09844 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  46] ROR linkedList2: 
--------------------------------------------------------------------------------
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
  74:         count = 0
- 75:         while n != None:
+ 75:         while n == None:
  76:             count += 1
  77:             n = n.next
  78:         return count
--------------------------------------------------------------------------------
[0.09448 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError

   - [#  49] SDI linkedList2: 
--------------------------------------------------------------------------------
  21:             if p1 == p2:
  22:                 return True
  23:         return False
  24: class LinkedList:
- 25:     def __init__(self, *start):
- 26:         '''Demonstrate linked lists in Python.'''
- 27:         self.head = None
- 28:         for _ in start:
- 29:             self.prepend(_)
- 30:     
+ 25:     @staticmethod
+ 26:     def __init__(self, *start):
+ 27:         '''Demonstrate linked lists in Python.'''
+ 28:         self.head = None
+ 29:         for _ in start:
+ 30:             self.prepend(_)
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
  33:         self.head = LinkedNode(value, self.head)
  34:     
--------------------------------------------------------------------------------
[0.07480 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
>       linked_list_0 = module_0.LinkedList(*str_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = 'B', start = ('/', 'n', "'", 's', '!', 'T', ...)

>   ???
E   AttributeError: 'str' object has no attribute 'head'

linkedList2:28: AttributeError

   - [#  56] SDL linkedList2: 
--------------------------------------------------------------------------------
   5: '''
   6: class LinkedNode:
   7:     def __init__(self, value, tail=None):
   8:         '''Node in a Linked List.'''
-  9:         self.value = value
+  9:         pass
  10:         self.next = tail
  11:     
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
--------------------------------------------------------------------------------
[0.07740 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.pop()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'LinkedNode' object has no attribute 'value'") raised in repr()] LinkedList object at 0x7fc3b0026320>

>   ???
E   AttributeError: 'LinkedNode' object has no attribute 'value'

linkedList2:39: AttributeError

   - [#  57] SDL linkedList2: 
--------------------------------------------------------------------------------
   6: class LinkedNode:
   7:     def __init__(self, value, tail=None):
   8:         '''Node in a Linked List.'''
   9:         self.value = value
- 10:         self.next = tail
+ 10:         pass
  11:     
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
--------------------------------------------------------------------------------
[0.07393 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_0

def test_case_0():
        str_0 = '4-?Fk.6R79JM\rhc'
        linked_node_0 = module_0.LinkedNode(str_0)
>       var_0 = linked_node_0.checkInfinite()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList2.LinkedNode object at 0x7fc3b0292770>

>   ???
E   AttributeError: 'LinkedNode' object has no attribute 'next'

linkedList2:16: AttributeError

   - [#  58] SDL linkedList2: 
--------------------------------------------------------------------------------
  10:         self.next = tail
  11:     
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
- 14:         p1 = p2 = self
+ 14:         pass
  15:         while (p1 != None and p2 != None):
  16:             if p2.next == None:
  17:                 return False
  18:             p1 = p1.next
--------------------------------------------------------------------------------
[0.07484 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_0

def test_case_0():
        str_0 = '4-?Fk.6R79JM\rhc'
        linked_node_0 = module_0.LinkedNode(str_0)
>       var_0 = linked_node_0.checkInfinite()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList2.LinkedNode object at 0x7fc3b0000f70>

>   ???
E   UnboundLocalError: local variable 'p1' referenced before assignment

linkedList2:15: UnboundLocalError

   - [#  59] SDL linkedList2: 
--------------------------------------------------------------------------------
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
  15:         while (p1 != None and p2 != None):
  16:             if p2.next == None:
- 17:                 return False
+ 17:                 pass
  18:             p1 = p1.next
  19:             p2 = p2.next.next
  20:             
  21:             if p1 == p2:
--------------------------------------------------------------------------------
[0.07338 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_0

def test_case_0():
        str_0 = '4-?Fk.6R79JM\rhc'
        linked_node_0 = module_0.LinkedNode(str_0)
>       var_0 = linked_node_0.checkInfinite()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList2.LinkedNode object at 0x7fc3afdb1a20>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList2:19: AttributeError

   - [#  60] SDL linkedList2: 
--------------------------------------------------------------------------------
  14:         p1 = p2 = self
  15:         while (p1 != None and p2 != None):
  16:             if p2.next == None:
  17:                 return False
- 18:             p1 = p1.next
+ 18:             pass
  19:             p2 = p2.next.next
  20:             
  21:             if p1 == p2:
  22:                 return True
--------------------------------------------------------------------------------
[0.07870 s] survived

   - [#  61] SDL linkedList2: 
--------------------------------------------------------------------------------
  15:         while (p1 != None and p2 != None):
  16:             if p2.next == None:
  17:                 return False
  18:             p1 = p1.next
- 19:             p2 = p2.next.next
+ 19:             pass
  20:             
  21:             if p1 == p2:
  22:                 return True
  23:         return False
--------------------------------------------------------------------------------
[0.09718 s] survived

   - [#  62] SDL linkedList2: 
--------------------------------------------------------------------------------
  18:             p1 = p1.next
  19:             p2 = p2.next.next
  20:             
  21:             if p1 == p2:
- 22:                 return True
+ 22:                 pass
  23:         return False
  24: class LinkedList:
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
--------------------------------------------------------------------------------
[0.08041 s] survived

   - [#  63] SDL linkedList2: 
--------------------------------------------------------------------------------
  19:             p2 = p2.next.next
  20:             
  21:             if p1 == p2:
  22:                 return True
- 23:         return False
+ 23:         pass
  24: class LinkedList:
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
  27:         self.head = None
--------------------------------------------------------------------------------
[0.07841 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_2

def test_case_2():
        complex_0 = 1460.7871768642246 + 580.97j
        linked_node_0 = module_0.LinkedNode(complex_0)
        linked_node_1 = module_0.LinkedNode(linked_node_0, linked_node_0)
        var_0 = linked_node_1.checkInfinite()
>       assert var_0 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:20: AssertionError

   - [#  64] SDL linkedList2: 
--------------------------------------------------------------------------------
  23:         return False
  24: class LinkedList:
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
- 27:         self.head = None
+ 27:         pass
  28:         for _ in start:
  29:             self.prepend(_)
  30:     
  31:     def prepend(self, value):
--------------------------------------------------------------------------------
[0.07791 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
>       linked_list_0 = module_0.LinkedList(*str_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList2:29: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'LinkedList' object has no attribute 'head'") raised in repr()] LinkedList object at 0x7fc3affe7f40>
value = 'B'

>   ???
E   AttributeError: 'LinkedList' object has no attribute 'head'

linkedList2:33: AttributeError

   - [#  65] SDL linkedList2: 
--------------------------------------------------------------------------------
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
  27:         self.head = None
  28:         for _ in start:
- 29:             self.prepend(_)
+ 29:             pass
  30:     
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
  33:         self.head = LinkedNode(value, self.head)
--------------------------------------------------------------------------------
[0.08209 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError

   - [#  66] SDL linkedList2: 
--------------------------------------------------------------------------------
  29:             self.prepend(_)
  30:     
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
- 33:         self.head = LinkedNode(value, self.head)
+ 33:         pass
  34:     
  35:     def pop(self):
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
--------------------------------------------------------------------------------
[0.07793 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError

   - [#  67] SDL linkedList2: 
--------------------------------------------------------------------------------
  35:     def pop(self):
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
  38:             raise Exception('Linked list is empty.')
- 39:         val = self.head.value
+ 39:         pass
  40:         self.head = self.head.next
  41:         return val
  42:     
  43:     def remove(self, value):
--------------------------------------------------------------------------------
[0.07910 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.pop()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = link:[]

>   ???
E   NameError: name 'val' is not defined

linkedList2:41: NameError

   - [#  68] SDL linkedList2: 
--------------------------------------------------------------------------------
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
  38:             raise Exception('Linked list is empty.')
  39:         val = self.head.value
- 40:         self.head = self.head.next
+ 40:         pass
  41:         return val
  42:     
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
--------------------------------------------------------------------------------
[0.07785 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.pop()
>       assert len(linked_list_0) == 0
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:48: AssertionError

   - [#  69] SDL linkedList2: 
--------------------------------------------------------------------------------
  37:         if self.head is None:
  38:             raise Exception('Linked list is empty.')
  39:         val = self.head.value
  40:         self.head = self.head.next
- 41:         return val
+ 41:         pass
  42:     
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
  45:         n = self.head
--------------------------------------------------------------------------------
[0.07773 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.pop()
        assert len(linked_list_0) == 0
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList2.LinkedList'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:49: AssertionError

   - [#  70] SDL linkedList2: 
--------------------------------------------------------------------------------
  41:         return val
  42:     
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
- 45:         n = self.head
+ 45:         pass
  46:         last = None
  47:         while n != None:
  48:             if n.value == value:
  49:                 if last == None:
--------------------------------------------------------------------------------
[0.08235 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.remove(linked_list_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:57: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3affe4ee0>
value = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3affe4ee0>

>   ???
E   UnboundLocalError: local variable 'n' referenced before assignment

linkedList2:47: UnboundLocalError
