   - [#  71] SDL linkedList2: 
--------------------------------------------------------------------------------
  42:     
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
  45:         n = self.head
- 46:         last = None
+ 46:         pass
  47:         while n != None:
  48:             if n.value == value:
  49:                 if last == None:
  50:                     self.head = self.head.next
--------------------------------------------------------------------------------
[0.08467 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.remove(linked_list_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:57: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3aff3d5a0>
value = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3aff3d5a0>

>   ???
E   NameError: name 'last' is not defined

linkedList2:49: NameError

   - [#  72] SDL linkedList2: 
--------------------------------------------------------------------------------
  46:         last = None
  47:         while n != None:
  48:             if n.value == value:
  49:                 if last == None:
- 50:                     self.head = self.head.next
+ 50:                     pass
  51:                 else:
  52:                     last.next = n.next
  53:                 return True
  54:             n = n.next
--------------------------------------------------------------------------------
[0.08122 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.remove(linked_list_0)
        assert var_1 is True
>       assert len(linked_list_0) == 0
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:59: AssertionError

   - [#  73] SDL linkedList2: 
--------------------------------------------------------------------------------
  48:             if n.value == value:
  49:                 if last == None:
  50:                     self.head = self.head.next
  51:                 else:
- 52:                     last.next = n.next
+ 52:                     pass
  53:                 return True
  54:             n = n.next
  55:         return False
  56:     
--------------------------------------------------------------------------------
[0.07929 s] survived

   - [#  74] SDL linkedList2: 
--------------------------------------------------------------------------------
  49:                 if last == None:
  50:                     self.head = self.head.next
  51:                 else:
  52:                     last.next = n.next
- 53:                 return True
+ 53:                 pass
  54:             n = n.next
  55:         return False
  56:     
  57:     def __iter__(self):
--------------------------------------------------------------------------------
[0.07912 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.remove(linked_list_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:58: AssertionError

   - [#  75] SDL linkedList2: 
--------------------------------------------------------------------------------
  50:                     self.head = self.head.next
  51:                 else:
  52:                     last.next = n.next
  53:                 return True
- 54:             n = n.next
+ 54:             pass
  55:         return False
  56:     
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
--------------------------------------------------------------------------------
[5.00310 s] timeout

   - [#  76] SDL linkedList2: 
--------------------------------------------------------------------------------
  51:                 else:
  52:                     last.next = n.next
  53:                 return True
  54:             n = n.next
- 55:         return False
+ 55:         pass
  56:     
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
  59:         n = self.head
--------------------------------------------------------------------------------
[0.08213 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_9

def test_case_9():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.remove(var_0)
>       assert var_1 is False
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:67: AssertionError

   - [#  77] SDL linkedList2: 
--------------------------------------------------------------------------------
  55:         return False
  56:     
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
- 59:         n = self.head
+ 59:         pass
  60:         while n != None:
  61:             yield n.value
  62:             n = n.next
  63:     
--------------------------------------------------------------------------------
[0.09541 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
>       var_0 = linked_list_0.__repr__()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList2:69: in __repr__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[UnboundLocalError("local variable 'n' referenced before assignment") raised in repr()] LinkedList object at 0x7fc3afdf8e20>

>   ???
E   UnboundLocalError: local variable 'n' referenced before assignment

linkedList2:60: UnboundLocalError

   - [#  79] SDL linkedList2: 
--------------------------------------------------------------------------------
  58:         '''Iterator of values in the list.'''
  59:         n = self.head
  60:         while n != None:
  61:             yield n.value
- 62:             n = n.next
+ 62:             pass
  63:     
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
--------------------------------------------------------------------------------
[5.00631 s] timeout

   - [#  80] SDL linkedList2: 
--------------------------------------------------------------------------------
  63:     
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
- 67:             return 'link:[]'
+ 67:             pass
  68:         
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
  71:     def __len__(self):
--------------------------------------------------------------------------------
[0.08314 s] survived

   - [#  81] SDL linkedList2: 
--------------------------------------------------------------------------------
  65:         '''String representation of linked list.'''
  66:         if self.head is None:
  67:             return 'link:[]'
  68:         
- 69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
+ 69:         pass
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
--------------------------------------------------------------------------------
[0.08597 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
        var_0 = linked_list_0.__repr__()
>       assert var_0 == 'link:[W,B,Q,z,d,n,i,d]'
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:87: AssertionError

   - [#  82] SDL linkedList2: 
--------------------------------------------------------------------------------
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
- 73:         n = self.head
+ 73:         pass
  74:         count = 0
  75:         while n != None:
  76:             count += 1
  77:             n = n.next
--------------------------------------------------------------------------------
[0.08342 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = link:[w,#,!,T,!,s,',n,/,B]

>   ???
E   UnboundLocalError: local variable 'n' referenced before assignment

linkedList2:75: UnboundLocalError

   - [#  83] SDL linkedList2: 
--------------------------------------------------------------------------------
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
  73:         n = self.head
- 74:         count = 0
+ 74:         pass
  75:         while n != None:
  76:             count += 1
  77:             n = n.next
  78:         return count
--------------------------------------------------------------------------------
[0.08378 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = link:[w,#,!,T,!,s,',n,/,B]

>   ???
E   UnboundLocalError: local variable 'count' referenced before assignment

linkedList2:76: UnboundLocalError

   - [#  84] SDL linkedList2: 
--------------------------------------------------------------------------------
  73:         n = self.head
  74:         count = 0
  75:         while n != None:
  76:             count += 1
- 77:             n = n.next
+ 77:             pass
  78:         return count
--------------------------------------------------------------------------------
[5.00602 s] timeout

   - [#  89] SVD linkedList2: 
--------------------------------------------------------------------------------
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
  27:         self.head = None
  28:         for _ in start:
- 29:             self.prepend(_)
+ 29:             prepend(_)
  30:     
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
  33:         self.head = LinkedNode(value, self.head)
--------------------------------------------------------------------------------
[0.07541 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
>       linked_list_0 = module_0.LinkedList(*str_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = link:[], start = ('B', '/', 'n', "'", 's', '!', ...), _ = 'B'

>   ???
E   NameError: name 'prepend' is not defined

linkedList2:29: NameError

   - [#  91] SVD linkedList2: 
--------------------------------------------------------------------------------
  29:             self.prepend(_)
  30:     
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
- 33:         self.head = LinkedNode(value, self.head)
+ 33:         self.head = LinkedNode(value, head)
  34:     
  35:     def pop(self):
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
--------------------------------------------------------------------------------
[0.07722 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
>       linked_list_0 = module_0.LinkedList(*str_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList2:29: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = link:[], value = 'B'

>   ???
E   NameError: name 'head' is not defined

linkedList2:33: NameError

   - [#  92] SVD linkedList2: 
--------------------------------------------------------------------------------
  33:         self.head = LinkedNode(value, self.head)
  34:     
  35:     def pop(self):
  36:         '''Remove first value in list.'''
- 37:         if self.head is None:
+ 37:         if head is None:
  38:             raise Exception('Linked list is empty.')
  39:         val = self.head.value
  40:         self.head = self.head.next
  41:         return val
--------------------------------------------------------------------------------
[0.07803 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.pop()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3affe7c10>

>   ???
E   NameError: name 'head' is not defined

linkedList2:37: NameError

   - [#  93] SVD linkedList2: 
--------------------------------------------------------------------------------
  35:     def pop(self):
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
  38:             raise Exception('Linked list is empty.')
- 39:         val = self.head.value
+ 39:         val = head.value
  40:         self.head = self.head.next
  41:         return val
  42:     
  43:     def remove(self, value):
--------------------------------------------------------------------------------
[0.09118 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.pop()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3afe4d240>

>   ???
E   NameError: name 'head' is not defined

linkedList2:39: NameError

   - [#  95] SVD linkedList2: 
--------------------------------------------------------------------------------
  36:         '''Remove first value in list.'''
  37:         if self.head is None:
  38:             raise Exception('Linked list is empty.')
  39:         val = self.head.value
- 40:         self.head = self.head.next
+ 40:         self.head = head.next
  41:         return val
  42:     
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
--------------------------------------------------------------------------------
[0.08024 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.pop()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3b02900a0>

>   ???
E   NameError: name 'head' is not defined

linkedList2:40: NameError

   - [#  96] SVD linkedList2: 
--------------------------------------------------------------------------------
  41:         return val
  42:     
  43:     def remove(self, value):
  44:         '''Remove value from list.'''
- 45:         n = self.head
+ 45:         n = head
  46:         last = None
  47:         while n != None:
  48:             if n.value == value:
  49:                 if last == None:
--------------------------------------------------------------------------------
[0.07818 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.remove(linked_list_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:57: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3b002e6b0>
value = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3b002e6b0>

>   ???
E   NameError: name 'head' is not defined

linkedList2:45: NameError

   - [#  98] SVD linkedList2: 
--------------------------------------------------------------------------------
  46:         last = None
  47:         while n != None:
  48:             if n.value == value:
  49:                 if last == None:
- 50:                     self.head = self.head.next
+ 50:                     self.head = head.next
  51:                 else:
  52:                     last.next = n.next
  53:                 return True
  54:             n = n.next
--------------------------------------------------------------------------------
[0.07840 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
>       var_1 = linked_list_0.remove(linked_list_0)

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:57: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3affbf100>
value = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] LinkedList object at 0x7fc3affbf100>

>   ???
E   NameError: name 'head' is not defined

linkedList2:50: NameError

   - [#  99] SVD linkedList2: 
--------------------------------------------------------------------------------
  55:         return False
  56:     
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
- 59:         n = self.head
+ 59:         n = head
  60:         while n != None:
  61:             yield n.value
  62:             n = n.next
  63:     
--------------------------------------------------------------------------------
[0.08302 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
>       var_0 = linked_list_0.__repr__()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList2:69: in __repr__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'head' is not defined") raised in repr()] LinkedList object at 0x7fc3b002f8b0>

>   ???
E   NameError: name 'head' is not defined

linkedList2:59: NameError

   - [# 100] SVD linkedList2: 
--------------------------------------------------------------------------------
  62:             n = n.next
  63:     
  64:     def __repr__(self):
  65:         '''String representation of linked list.'''
- 66:         if self.head is None:
+ 66:         if head is None:
  67:             return 'link:[]'
  68:         
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
--------------------------------------------------------------------------------
[0.08224 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_12

def test_case_12():
        str_0 = 'dindzQBW'
        linked_list_0 = module_0.LinkedList(*str_0)
        assert len(linked_list_0) == 8
>       var_0 = linked_list_0.__repr__()

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'head' is not defined") raised in repr()] LinkedList object at 0x7fc3afdb3af0>

>   ???
E   NameError: name 'head' is not defined

linkedList2:66: NameError

   - [# 101] SVD linkedList2: 
--------------------------------------------------------------------------------
  69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
  70:     
  71:     def __len__(self):
  72:         '''Count values in list.'''
- 73:         n = self.head
+ 73:         n = head
  74:         count = 0
  75:         while n != None:
  76:             count += 1
  77:             n = n.next
--------------------------------------------------------------------------------
[0.07961 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = link:[w,#,!,T,!,s,',n,/,B]

>   ???
E   NameError: name 'head' is not defined

linkedList2:73: NameError

   - [# 102] ZIL linkedList2: 
--------------------------------------------------------------------------------
  12:     def checkInfinite(self):
  13:         '''Check whether infinite loop via next.'''
  14:         p1 = p2 = self
  15:         while (p1 != None and p2 != None):
- 16:             if p2.next == None:
- 17:                 return False
- 18:             p1 = p1.next
- 19:             p2 = p2.next.next
- 20:             
- 21:             if p1 == p2:
- 22:                 return True
- 23:         return False
+ 16:             break
+ 17:         
+ 18:         
+ 19:         
+ 20:         
+ 21:         
+ 22:         return False
+ 23: 
  24: class LinkedList:
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
  27:         self.head = None
--------------------------------------------------------------------------------
[0.07831 s] survived

   - [# 103] ZIL linkedList2: 
--------------------------------------------------------------------------------
  25:     def __init__(self, *start):
  26:         '''Demonstrate linked lists in Python.'''
  27:         self.head = None
  28:         for _ in start:
- 29:             self.prepend(_)
+ 29:             break
  30:     
  31:     def prepend(self, value):
  32:         '''Prepend element into list.'''
  33:         self.head = LinkedNode(value, self.head)
--------------------------------------------------------------------------------
[0.07863 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError

   - [# 104] ZIL linkedList2: 
--------------------------------------------------------------------------------
  44:         '''Remove value from list.'''
  45:         n = self.head
  46:         last = None
  47:         while n != None:
- 48:             if n.value == value:
- 49:                 if last == None:
- 50:                     self.head = self.head.next
- 51:                 else:
- 52:                     last.next = n.next
- 53:                 return True
- 54:             n = n.next
+ 48:             break
+ 49:         
+ 50:         
+ 51:         
+ 52:         
+ 53:         
+ 54:         
  55:         return False
  56:     
  57:     def __iter__(self):
  58:         '''Iterator of values in the list.'''
--------------------------------------------------------------------------------
[0.07971 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_8

def test_case_8():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.prepend(linked_list_0)
        assert len(linked_list_0) == 1
        var_1 = linked_list_0.remove(linked_list_0)
>       assert var_1 is True
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:58: AssertionError

   - [# 106] ZIL linkedList2: 
--------------------------------------------------------------------------------
  72:         '''Count values in list.'''
  73:         n = self.head
  74:         count = 0
  75:         while n != None:
- 76:             count += 1
- 77:             n = n.next
+ 76:             break
+ 77:         
  78:         return count
--------------------------------------------------------------------------------
[0.07937 s] killed by DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py::test_case_4

def test_case_4():
        str_0 = "B/n's!T!#w"
        linked_list_0 = module_0.LinkedList(*str_0)
>       assert len(linked_list_0) == 10
E       AssertionError

DYNAMOSA-MIO-MOSA/test_linkedList2_MIO.py:30: AssertionError
