3 : Job ID d819b58c37a44d40888f9cef8ba4e30d
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if self.__size != 1: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py FF.                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ...F....            [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_single_element
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_multiple_elements_small_list
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py::test_case_3 - As...
========================= 3 failed, 44 passed in 0.21s =========================

7 : Job ID 747e5fd8cb2d44f99825588a1f6f64a9
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if self.__size < 1: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py F..                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ...F....            [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_single_element
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py::test_case_3 - As...
========================= 2 failed, 45 passed in 0.21s =========================

11 : Job ID 5bbaffaf01d8407dab992ab9fa4cf0ee
SURVIVED
test outcome: survived
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if self.__size <= 1: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py ...                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ........            [100%]
============================== 47 passed in 0.28s ==============================

15 : Job ID 846f7aa64d8d49ec986c8a93dccb2c8b
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if self.__size > 1: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py FF.                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ...F....            [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_single_element
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_multiple_elements_small_list
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py::test_case_3 - As...
========================= 3 failed, 44 passed in 0.21s =========================

19 : Job ID 73071dcb8f2143a696cd662ebc2b2916
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if self.__size >= 1: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py .F.                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ........            [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_multiple_elements_small_list
========================= 1 failed, 46 passed in 0.20s =========================

23 : Job ID adecfb547ed646adab90be4198753541
test outcome: killed
linkedList3.py, start pos: (42, 11), end pos: (42, 27)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if not self.__size == 1: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py FF.                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ...F....            [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_single_element
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_multiple_elements_small_list
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py::test_case_3 - As...
========================= 3 failed, 44 passed in 0.21s =========================

39 : Job ID c8dabcebf185478daf9aa7ca581a6d94
test outcome: killed
linkedList3.py, start pos: (42, 26), end pos: (42, 27)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if self.__size == 2: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py F..                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ...F....            [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_single_element
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py::test_case_3 - As...
========================= 2 failed, 45 passed in 0.20s =========================

40 : Job ID eba10538ab87450d88499cde2cd0af1a
test outcome: killed
linkedList3.py, start pos: (42, 26), end pos: (42, 27)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size == 1: # Alterado para corrigir comportamento
+        if self.__size == 0: # Alterado para corrigir comportamento
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
ALL-SMART-GPT-MUTMUT/test_linkedList3_DYNAMOSA.py ...........            [ 23%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MIO.py ..............              [ 53%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MOSA.py ...........                [ 76%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py F..                      [ 82%]
ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py ...F....            [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_MUTMUT.py::test_remove_single_element
FAILED ALL-SMART-GPT-MUTMUT/test_linkedList3_WHOLE_SUITE.py::test_case_3 - As...
========================= 2 failed, 45 passed in 0.20s =========================
