   - [#   1] ASR linkedList3: 
--------------------------------------------------------------------------------
   25:         newNode = Node(value)
   26:         if self.__size == 0:
   27:             self.__head.next = newNode
   28:             self.__head = newNode
-  29:             self.__size += 1
+  29:             self.__size -= 1
   30:         else:
   31:             self.__sentinel.next = newNode
   32:             newNode.next = self.__head
   33:             self.__head = newNode
--------------------------------------------------------------------------------
[0.08575 s] killed by MIO-MOSA/test_linkedList3_MOSA.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
>       assert int_0 == 1
E       AssertionError

MIO-MOSA/test_linkedList3_MOSA.py:25: AssertionError

   - [#   3] ASR linkedList3: 
--------------------------------------------------------------------------------
   42:         if self.__size >= 1:
   43:             nodeToRemove = self.__head
   44:             self.__sentinel.next = None
   45:             self.__head = self.__sentinel
-  46:             self.__size -= 1
+  46:             self.__size += 1
   47:             return nodeToRemove
   48:         else:
   49:             nodeToRemove = self.__head
   50:             self.__sentinel.next = self.__head.next
--------------------------------------------------------------------------------
[0.06085 s] survived

   - [#   4] ASR linkedList3: 
--------------------------------------------------------------------------------
   48:         else:
   49:             nodeToRemove = self.__head
   50:             self.__sentinel.next = self.__head.next
   51:             self.__head = self.__sentinel.next
-  52:             self.__size -= 1
+  52:             self.__size += 1
   53:             return nodeToRemove
   54:     
   55:     def getHead(self) -> T:
   56:         
--------------------------------------------------------------------------------
[0.06015 s] survived

   - [#   5] CDI linkedList3: 
--------------------------------------------------------------------------------
    6: T = TypeVar('T')
    7: 
    8: 
    9: class Node:
-  10:     def __init__(self, value: T):
-  11:         self.value = value
-  12:         self.next = None
-  13: 
+  10:     @classmethod
+  11:     def __init__(self, value: T):
+  12:         self.value = value
+  13:         self.next = None
   14: 
   15: class SinglyLinkedList:
   16:     def __init__(self):
   17:         self.__sentinel = Node(None)
--------------------------------------------------------------------------------
[0.07968 s] killed by MIO-MOSA/test_linkedList3_MOSA.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_1).__module__}.{type(node_1).__qualname__}' == 'linkedList3.Node'
>       assert node_1.value is None
E       AssertionError

MIO-MOSA/test_linkedList3_MOSA.py:32: AssertionError

   - [#   6] CDI linkedList3: 
--------------------------------------------------------------------------------
   12:         self.next = None
   13: 
   14: 
   15: class SinglyLinkedList:
-  16:     def __init__(self):
-  17:         self.__sentinel = Node(None)
-  18:         self.__head = self.__sentinel
-  19:         self.__size = 0
-  20:     
+  16:     @classmethod
+  17:     def __init__(self):
+  18:         self.__sentinel = Node(None)
+  19:         self.__head = self.__sentinel
+  20:         self.__size = 0
   21:     def add(self, value: T) -> None:
   22:         
   23:         '''Add element to linked list.'''
   24:         
--------------------------------------------------------------------------------
[0.07782 s] killed by MIO-MOSA/test_linkedList3_MOSA.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_1).__module__}.{type(node_1).__qualname__}' == 'linkedList3.Node'
        assert node_1.value is None
>       assert node_1.next is None
E       AssertionError

MIO-MOSA/test_linkedList3_MOSA.py:33: AssertionError

   - [#   7] CDI linkedList3: 
--------------------------------------------------------------------------------
   17:         self.__sentinel = Node(None)
   18:         self.__head = self.__sentinel
   19:         self.__size = 0
   20:     
-  21:     def add(self, value: T) -> None:
-  22:         
-  23:         '''Add element to linked list.'''
-  24:         
-  25:         newNode = Node(value)
-  26:         if self.__size == 0:
-  27:             self.__head.next = newNode
-  28:             self.__head = newNode
-  29:             self.__size += 1
-  30:         else:
-  31:             self.__sentinel.next = newNode
-  32:             newNode.next = self.__head
-  33:             self.__head = newNode
-  34:             self.__size += 1
-  35:     
+  21:     @classmethod
+  22:     def add(self, value: T) -> None:
+  23:         
+  24:         '''Add element to linked list.'''
+  25:         
+  26:         newNode = Node(value)
+  27:         if self.__size == 0:
+  28:             self.__head.next = newNode
+  29:             self.__head = newNode
+  30:             self.__size += 1
+  31:         else:
+  32:             self.__sentinel.next = newNode
+  33:             newNode.next = self.__head
+  34:             self.__head = newNode
+  35:             self.__size += 1
   36:     def remove(self):
   37:         
   38:         '''Remove node from linkedlist.'''
   39:         
--------------------------------------------------------------------------------
[0.07417 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_1

def test_case_1():
        singly_linked_list_0 = module_0.SinglyLinkedList()

   - [#   8] CDI linkedList3: 
--------------------------------------------------------------------------------
   32:             newNode.next = self.__head
   33:             self.__head = newNode
   34:             self.__size += 1
   35:     
-  36:     def remove(self):
-  37:         
-  38:         '''Remove node from linkedlist.'''
-  39:         
-  40:         if self.__size == 0:
-  41:             return None
-  42:         if self.__size >= 1:
-  43:             nodeToRemove = self.__head
-  44:             self.__sentinel.next = None
-  45:             self.__head = self.__sentinel
-  46:             self.__size -= 1
-  47:             return nodeToRemove
-  48:         else:
-  49:             nodeToRemove = self.__head
-  50:             self.__sentinel.next = self.__head.next
-  51:             self.__head = self.__sentinel.next
-  52:             self.__size -= 1
-  53:             return nodeToRemove
-  54:     
+  36:     @classmethod
+  37:     def remove(self):
+  38:         
+  39:         '''Remove node from linkedlist.'''
+  40:         
+  41:         if self.__size == 0:
+  42:             return None
+  43:         if self.__size >= 1:
+  44:             nodeToRemove = self.__head
+  45:             self.__sentinel.next = None
+  46:             self.__head = self.__sentinel
+  47:             self.__size -= 1
+  48:             return nodeToRemove
+  49:         else:
+  50:             nodeToRemove = self.__head
+  51:             self.__sentinel.next = self.__head.next
+  52:             self.__head = self.__sentinel.next
+  53:             self.__size -= 1
+  54:             return nodeToRemove
   55:     def getHead(self) -> T:

   - [#   9] CDI linkedList3: 
--------------------------------------------------------------------------------
   51:             self.__head = self.__sentinel.next
   52:             self.__size -= 1
   53:             return nodeToRemove
   54:     
-  55:     def getHead(self) -> T:
-  56:         
-  57:         '''Get value of the linkedlist head node.'''
-  58:         
-  59:         return self.__head.value
-  60:     
+  55:     @classmethod
+  56:     def getHead(self) -> T:
+  57:         
+  58:         '''Get value of the linkedlist head node.'''
+  59:         
+  60:         return self.__head.value
   61:     def getHeadNode(self) -> Node:
   62:         
   63:         '''Get head node referance.'''
   64:         
--------------------------------------------------------------------------------
[0.08048 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_11

def test_case_11():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       var_0 = singly_linked_list_0.getHead()

MIO-MOSA/test_linkedList3_MIO.py:63: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList3.SinglyLinkedList'>

>   ???
E   AttributeError: type object 'SinglyLinkedList' has no attribute '_SinglyLinkedList__head'

linkedList3:60: AttributeError

   - [#  10] CDI linkedList3: 
--------------------------------------------------------------------------------
   57:         '''Get value of the linkedlist head node.'''
   58:         
   59:         return self.__head.value
   60:     
-  61:     def getHeadNode(self) -> Node:
-  62:         
-  63:         '''Get head node referance.'''
-  64:         
-  65:         return self.__head
-  66:     
+  61:     @classmethod
+  62:     def getHeadNode(self) -> Node:
+  63:         
+  64:         '''Get head node referance.'''
+  65:         
+  66:         return self.__head
   67:     def getSize(self) -> int:
   68:         
   69:         '''Return size of the linkedlist.'''
   70:         
--------------------------------------------------------------------------------
[0.08122 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_12

def test_case_12():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       node_0 = singly_linked_list_0.getHeadNode()

MIO-MOSA/test_linkedList3_MIO.py:67: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList3.SinglyLinkedList'>

>   ???
E   AttributeError: type object 'SinglyLinkedList' has no attribute '_SinglyLinkedList__head'

linkedList3:66: AttributeError

   - [#  11] CDI linkedList3: 
--------------------------------------------------------------------------------
   63:         '''Get head node referance.'''
   64:         
   65:         return self.__head
   66:     
-  67:     def getSize(self) -> int:
-  68:         
-  69:         '''Return size of the linkedlist.'''
-  70:         
-  71:         return self.__size
-  72:     
+  67:     @classmethod
+  68:     def getSize(self) -> int:
+  69:         
+  70:         '''Return size of the linkedlist.'''
+  71:         
+  72:         return self.__size
   73:     def isEmpty(self) -> bool:
   74:         
   75:         '''Checks if linkedlist is empty.'''
   76:         
--------------------------------------------------------------------------------
[0.07775 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_13

def test_case_13():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       int_0 = singly_linked_list_0.getSize()

MIO-MOSA/test_linkedList3_MIO.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList3.SinglyLinkedList'>

>   ???
E   AttributeError: type object 'SinglyLinkedList' has no attribute '_SinglyLinkedList__size'

linkedList3:72: AttributeError

   - [#  12] CDI linkedList3: 
--------------------------------------------------------------------------------
   69:         '''Return size of the linkedlist.'''
   70:         
   71:         return self.__size
   72:     
-  73:     def isEmpty(self) -> bool:
-  74:         
-  75:         '''Checks if linkedlist is empty.'''
-  76:         
-  77:         return True if self.__size == 0 else False
-  78:     
+  73:     @classmethod
+  74:     def isEmpty(self) -> bool:
+  75:         
+  76:         '''Checks if linkedlist is empty.'''
+  77:         
+  78:         return True if self.__size == 0 else False
   79:     def toArray(self) -> list:
   80:         
   81:         '''Converts linkedlist to list.'''
   82:         
--------------------------------------------------------------------------------
[0.07477 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_5

def test_case_5():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       bool_0 = singly_linked_list_0.isEmpty()

MIO-MOSA/test_linkedList3_MIO.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList3.SinglyLinkedList'>

>   ???
E   AttributeError: type object 'SinglyLinkedList' has no attribute '_SinglyLinkedList__size'

linkedList3:78: AttributeError

   - [#  13] CDI linkedList3: 
--------------------------------------------------------------------------------
   75:         '''Checks if linkedlist is empty.'''
   76:         
   77:         return True if self.__size == 0 else False
   78:     
-  79:     def toArray(self) -> list:
-  80:         
-  81:         '''Converts linkedlist to list.'''
-  82:         
-  83:         arr = []
-  84:         current = self.__head
-  85:         while current:
-  86:             arr.append(current.value)
-  87:             current = current.next
-  88:         return arr
-  89:     
+  79:     @classmethod
+  80:     def toArray(self) -> list:
+  81:         
+  82:         '''Converts linkedlist to list.'''
+  83:         
+  84:         arr = []
+  85:         current = self.__head
+  86:         while current:
+  87:             arr.append(current.value)
+  88:             current = current.next
+  89:         return arr
   90:     def __str__(self) -> str:
   91:         
   92:         '''Return String representation of linkedlist values.'''
   93:         
--------------------------------------------------------------------------------
[0.07835 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_7

def test_case_7():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = None
        none_type_1 = singly_linked_list_0.add(none_type_0)
        none_type_2 = singly_linked_list_0.add(none_type_0)
>       list_0 = singly_linked_list_0.toArray()

MIO-MOSA/test_linkedList3_MIO.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [#  14] CDI linkedList3: 
--------------------------------------------------------------------------------
   86:             arr.append(current.value)
   87:             current = current.next
   88:         return arr
   89:     
-  90:     def __str__(self) -> str:
-  91:         
-  92:         '''Return String representation of linkedlist values.'''
-  93:         
-  94:         arr = []
-  95:         current = self.__head
-  96:         while current:
-  97:             arr.append(current.value)
-  98:             current = current.next
-  99:         return str(arr)
- 100: 
+  90:     @classmethod
+  91:     def __str__(self) -> str:
+  92:         
+  93:         '''Return String representation of linkedlist values.'''
+  94:         
+  95:         arr = []
+  96:         current = self.__head
+  97:         while current:
+  98:             arr.append(current.value)
+  99:             current = current.next
+ 100:         return str(arr)
  101: 
  102: if __name__ == '__main__':
  103:     pass
--------------------------------------------------------------------------------
[0.09253 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_9

def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
        none_type_1 = singly_linked_list_0.add(none_type_0)
>       str_0 = singly_linked_list_0.__str__()

MIO-MOSA/test_linkedList3_MIO.py:54: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList3.SinglyLinkedList'>

   - [#  15] COI linkedList3: 
--------------------------------------------------------------------------------
   22:         
   23:         '''Add element to linked list.'''
   24:         
   25:         newNode = Node(value)
-  26:         if self.__size == 0:
+  26:         if not (self.__size == 0):
   27:             self.__head.next = newNode
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
--------------------------------------------------------------------------------
[0.07249 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_3

def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
        var_0 = singly_linked_list_0.remove()
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
        assert f'{type(var_0.value).__module__}.{type(var_0.value).__qualname__}' == 'linkedList3.SinglyLinkedList'
>       assert var_0.next is None
E       AssertionError

MIO-MOSA/test_linkedList3_MIO.py:22: AssertionError

   - [#  17] COI linkedList3: 
--------------------------------------------------------------------------------
   38:         '''Remove node from linkedlist.'''
   39:         
   40:         if self.__size == 0:
   41:             return None
-  42:         if self.__size >= 1:
+  42:         if not (self.__size >= 1):
   43:             nodeToRemove = self.__head
   44:             self.__sentinel.next = None
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
--------------------------------------------------------------------------------
[0.06302 s] survived

   - [#  34] OIL linkedList3: 
--------------------------------------------------------------------------------
   84:         current = self.__head
   85:         while current:
   86:             arr.append(current.value)
   87:             current = current.next
-  88:         return arr
-  89:     
+  88:             break
+  89:         return arr
   90:     def __str__(self) -> str:
   91:         
   92:         '''Return String representation of linkedlist values.'''
   93:         
--------------------------------------------------------------------------------
[0.06022 s] survived

   - [#  57] SDL linkedList3: 
--------------------------------------------------------------------------------
   15: class SinglyLinkedList:
   16:     def __init__(self):
   17:         self.__sentinel = Node(None)
   18:         self.__head = self.__sentinel
-  19:         self.__size = 0
+  19:         pass
   20:     
   21:     def add(self, value: T) -> None:
   22:         
   23:         '''Add element to linked list.'''
--------------------------------------------------------------------------------
[0.07164 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_1

def test_case_1():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       none_type_0 = singly_linked_list_0.add(singly_linked_list_0)

MIO-MOSA/test_linkedList3_MIO.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f46141f89d0>
value = <linkedList3.SinglyLinkedList object at 0x7f46141f89d0>

>   ???
E   AttributeError: 'SinglyLinkedList' object has no attribute '_SinglyLinkedList__size'. Did you mean: '_SinglyLinkedList__head'?

linkedList3:26: AttributeError

   - [#  58] SDL linkedList3: 
--------------------------------------------------------------------------------
   21:     def add(self, value: T) -> None:
   22:         
   23:         '''Add element to linked list.'''
   24:         
-  25:         newNode = Node(value)
+  25:         pass
   26:         if self.__size == 0:
   27:             self.__head.next = newNode
   28:             self.__head = newNode
   29:             self.__size += 1
--------------------------------------------------------------------------------
[0.07278 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_1

def test_case_1():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       none_type_0 = singly_linked_list_0.add(singly_linked_list_0)

MIO-MOSA/test_linkedList3_MIO.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613ff9db0>
value = <linkedList3.SinglyLinkedList object at 0x7f4613ff9db0>

>   ???
E   NameError: name 'newNode' is not defined

linkedList3:27: NameError

   - [#  59] SDL linkedList3: 
--------------------------------------------------------------------------------
   23:         '''Add element to linked list.'''
   24:         
   25:         newNode = Node(value)
   26:         if self.__size == 0:
-  27:             self.__head.next = newNode
+  27:             pass
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
   31:             self.__sentinel.next = newNode
--------------------------------------------------------------------------------
[0.06030 s] survived

   - [#  60] SDL linkedList3: 
--------------------------------------------------------------------------------
   24:         
   25:         newNode = Node(value)
   26:         if self.__size == 0:
   27:             self.__head.next = newNode
-  28:             self.__head = newNode
+  28:             pass
   29:             self.__size += 1
   30:         else:
   31:             self.__sentinel.next = newNode
   32:             newNode.next = self.__head
--------------------------------------------------------------------------------
[0.06941 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_3

def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
        var_0 = singly_linked_list_0.remove()
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
>       assert f'{type(var_0.value).__module__}.{type(var_0.value).__qualname__}' == 'linkedList3.SinglyLinkedList'
E       AssertionError

MIO-MOSA/test_linkedList3_MIO.py:21: AssertionError

   - [#  61] SDL linkedList3: 
--------------------------------------------------------------------------------
   27:             self.__head.next = newNode
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
-  31:             self.__sentinel.next = newNode
+  31:             pass
   32:             newNode.next = self.__head
   33:             self.__head = newNode
   34:             self.__size += 1
   35:     
--------------------------------------------------------------------------------
[0.05918 s] survived

   - [#  62] SDL linkedList3: 
--------------------------------------------------------------------------------
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
   31:             self.__sentinel.next = newNode
-  32:             newNode.next = self.__head
+  32:             pass
   33:             self.__head = newNode
   34:             self.__size += 1
   35:     
   36:     def remove(self):
--------------------------------------------------------------------------------
[0.07982 s] killed by MIO-MOSA/test_linkedList3_MOSA.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_1).__module__}.{type(node_1).__qualname__}' == 'linkedList3.Node'
        assert node_1.value is None
        assert node_1.next is None
        node_2 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_2).__module__}.{type(node_2).__qualname__}' == 'linkedList3.Node'
        assert node_2.value is None
        assert node_2.next is None
        int_2 = singly_linked_list_1.getSize()
        assert int_2 == 1
        int_3 = singly_linked_list_1.getSize()
        assert int_3 == 1
        str_0 = singly_linked_list_0.__str__()

   - [#  63] SDL linkedList3: 
--------------------------------------------------------------------------------
   29:             self.__size += 1
   30:         else:
   31:             self.__sentinel.next = newNode
   32:             newNode.next = self.__head
-  33:             self.__head = newNode
+  33:             pass
   34:             self.__size += 1
   35:     
   36:     def remove(self):
   37:         
--------------------------------------------------------------------------------
[0.07917 s] killed by MIO-MOSA/test_linkedList3_MOSA.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_1).__module__}.{type(node_1).__qualname__}' == 'linkedList3.Node'
        assert node_1.value is None
        assert node_1.next is None
        node_2 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_2).__module__}.{type(node_2).__qualname__}' == 'linkedList3.Node'
        assert node_2.value is None
        assert node_2.next is None
        int_2 = singly_linked_list_1.getSize()
        assert int_2 == 1
        int_3 = singly_linked_list_1.getSize()
        assert int_3 == 1
        str_0 = singly_linked_list_0.__str__()
        assert str_0 == '[None]'

   - [#  65] SDL linkedList3: 
--------------------------------------------------------------------------------
   39:         
   40:         if self.__size == 0:
   41:             return None
   42:         if self.__size >= 1:
-  43:             nodeToRemove = self.__head
+  43:             pass
   44:             self.__sentinel.next = None
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
   47:             return nodeToRemove
--------------------------------------------------------------------------------
[0.07079 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_3

def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
>       var_0 = singly_linked_list_0.remove()

MIO-MOSA/test_linkedList3_MIO.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613d9b100>

>   ???
E   UnboundLocalError: local variable 'nodeToRemove' referenced before assignment

linkedList3:47: UnboundLocalError

   - [#  66] SDL linkedList3: 
--------------------------------------------------------------------------------
   40:         if self.__size == 0:
   41:             return None
   42:         if self.__size >= 1:
   43:             nodeToRemove = self.__head
-  44:             self.__sentinel.next = None
+  44:             pass
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
   47:             return nodeToRemove
   48:         else:
--------------------------------------------------------------------------------
[0.06134 s] survived

   - [#  69] SDL linkedList3: 
--------------------------------------------------------------------------------
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
   47:             return nodeToRemove
   48:         else:
-  49:             nodeToRemove = self.__head
+  49:             pass
   50:             self.__sentinel.next = self.__head.next
   51:             self.__head = self.__sentinel.next
   52:             self.__size -= 1
   53:             return nodeToRemove
--------------------------------------------------------------------------------
[0.05946 s] survived
