   - [#  70] SDL linkedList3: 
--------------------------------------------------------------------------------
   46:             self.__size -= 1
   47:             return nodeToRemove
   48:         else:
   49:             nodeToRemove = self.__head
-  50:             self.__sentinel.next = self.__head.next
+  50:             pass
   51:             self.__head = self.__sentinel.next
   52:             self.__size -= 1
   53:             return nodeToRemove
   54:     
--------------------------------------------------------------------------------
[0.06138 s] survived

   - [#  71] SDL linkedList3: 
--------------------------------------------------------------------------------
   47:             return nodeToRemove
   48:         else:
   49:             nodeToRemove = self.__head
   50:             self.__sentinel.next = self.__head.next
-  51:             self.__head = self.__sentinel.next
+  51:             pass
   52:             self.__size -= 1
   53:             return nodeToRemove
   54:     
   55:     def getHead(self) -> T:
--------------------------------------------------------------------------------
[0.07592 s] survived

   - [#  73] SDL linkedList3: 
--------------------------------------------------------------------------------
   55:     def getHead(self) -> T:
   56:         
   57:         '''Get value of the linkedlist head node.'''
   58:         
-  59:         return self.__head.value
+  59:         pass
   60:     
   61:     def getHeadNode(self) -> Node:
   62:         
   63:         '''Get head node referance.'''
--------------------------------------------------------------------------------
[0.08003 s] killed by MIO-MOSA/test_linkedList3_MOSA.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_1).__module__}.{type(node_1).__qualname__}' == 'linkedList3.Node'
        assert node_1.value is None
        assert node_1.next is None
        node_2 = singly_linked_list_0.getHeadNode()
        assert f'{type(node_2).__module__}.{type(node_2).__qualname__}' == 'linkedList3.Node'
        assert node_2.value is None
        assert node_2.next is None
        int_2 = singly_linked_list_1.getSize()
        assert int_2 == 1
        int_3 = singly_linked_list_1.getSize()
        assert int_3 == 1
        str_0 = singly_linked_list_0.__str__()
        assert str_0 == '[None]'

   - [#  74] SDL linkedList3: 
--------------------------------------------------------------------------------
   61:     def getHeadNode(self) -> Node:
   62:         
   63:         '''Get head node referance.'''
   64:         
-  65:         return self.__head
+  65:         pass
   66:     
   67:     def getSize(self) -> int:
   68:         
   69:         '''Return size of the linkedlist.'''
--------------------------------------------------------------------------------
[0.07918 s] killed by MIO-MOSA/test_linkedList3_MOSA.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = singly_linked_list_0.getHeadNode()
>       assert f'{type(node_1).__module__}.{type(node_1).__qualname__}' == 'linkedList3.Node'
E       AssertionError

MIO-MOSA/test_linkedList3_MOSA.py:31: AssertionError

   - [#  78] SDL linkedList3: 
--------------------------------------------------------------------------------
   80:         
   81:         '''Converts linkedlist to list.'''
   82:         
   83:         arr = []
-  84:         current = self.__head
+  84:         pass
   85:         while current:
   86:             arr.append(current.value)
   87:             current = current.next
   88:         return arr
--------------------------------------------------------------------------------
[0.07550 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_7

def test_case_7():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = None
        none_type_1 = singly_linked_list_0.add(none_type_0)
        none_type_2 = singly_linked_list_0.add(none_type_0)
>       list_0 = singly_linked_list_0.toArray()

MIO-MOSA/test_linkedList3_MIO.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613e81780>

>   ???
E   UnboundLocalError: local variable 'current' referenced before assignment

linkedList3:85: UnboundLocalError

   - [#  81] SDL linkedList3: 
--------------------------------------------------------------------------------
   84:         current = self.__head
   85:         while current:
   86:             arr.append(current.value)
   87:             current = current.next
-  88:         return arr
+  88:         pass
   89:     
   90:     def __str__(self) -> str:
   91:         
   92:         '''Return String representation of linkedlist values.'''
--------------------------------------------------------------------------------
[0.06158 s] survived

   - [#  93] SVD linkedList3: 
--------------------------------------------------------------------------------
   22:         
   23:         '''Add element to linked list.'''
   24:         
   25:         newNode = Node(value)
-  26:         if self.__size == 0:
+  26:         if __size == 0:
   27:             self.__head.next = newNode
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
--------------------------------------------------------------------------------
[0.07203 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_1

def test_case_1():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       none_type_0 = singly_linked_list_0.add(singly_linked_list_0)

MIO-MOSA/test_linkedList3_MIO.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613c6d300>
value = <linkedList3.SinglyLinkedList object at 0x7f4613c6d300>

>   ???
E   NameError: name '_SinglyLinkedList__size' is not defined

linkedList3:26: NameError

   - [#  94] SVD linkedList3: 
--------------------------------------------------------------------------------
   23:         '''Add element to linked list.'''
   24:         
   25:         newNode = Node(value)
   26:         if self.__size == 0:
-  27:             self.__head.next = newNode
+  27:             __head.next = newNode
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
   31:             self.__sentinel.next = newNode
--------------------------------------------------------------------------------
[0.07223 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_1

def test_case_1():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       none_type_0 = singly_linked_list_0.add(singly_linked_list_0)

MIO-MOSA/test_linkedList3_MIO.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613ffbca0>
value = <linkedList3.SinglyLinkedList object at 0x7f4613ffbca0>

>   ???
E   NameError: name '_SinglyLinkedList__head' is not defined

linkedList3:27: NameError

   - [#  97] SVD linkedList3: 
--------------------------------------------------------------------------------
   27:             self.__head.next = newNode
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
-  31:             self.__sentinel.next = newNode
+  31:             __sentinel.next = newNode
   32:             newNode.next = self.__head
   33:             self.__head = newNode
   34:             self.__size += 1
   35:     
--------------------------------------------------------------------------------
[0.07323 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
>       none_type_1 = singly_linked_list_0.add(singly_linked_list_0)

MIO-MOSA/test_linkedList3_MIO.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613e82830>
value = <linkedList3.SinglyLinkedList object at 0x7f4613e82830>

>   ???
E   NameError: name '_SinglyLinkedList__sentinel' is not defined

linkedList3:31: NameError

   - [#  98] SVD linkedList3: 
--------------------------------------------------------------------------------
   28:             self.__head = newNode
   29:             self.__size += 1
   30:         else:
   31:             self.__sentinel.next = newNode
-  32:             newNode.next = self.__head
+  32:             newNode.next = __head
   33:             self.__head = newNode
   34:             self.__size += 1
   35:     
   36:     def remove(self):
--------------------------------------------------------------------------------
[0.07218 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_2

def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
>       none_type_1 = singly_linked_list_0.add(singly_linked_list_0)

MIO-MOSA/test_linkedList3_MIO.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613f320e0>
value = <linkedList3.SinglyLinkedList object at 0x7f4613f320e0>

>   ???
E   NameError: name '_SinglyLinkedList__head' is not defined

linkedList3:32: NameError

   - [# 102] SVD linkedList3: 
--------------------------------------------------------------------------------
   38:         '''Remove node from linkedlist.'''
   39:         
   40:         if self.__size == 0:
   41:             return None
-  42:         if self.__size >= 1:
+  42:         if __size >= 1:
   43:             nodeToRemove = self.__head
   44:             self.__sentinel.next = None
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
--------------------------------------------------------------------------------
[0.07138 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_3

def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
>       var_0 = singly_linked_list_0.remove()

MIO-MOSA/test_linkedList3_MIO.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613da7700>

>   ???
E   NameError: name '_SinglyLinkedList__size' is not defined

linkedList3:42: NameError

   - [# 103] SVD linkedList3: 
--------------------------------------------------------------------------------
   39:         
   40:         if self.__size == 0:
   41:             return None
   42:         if self.__size >= 1:
-  43:             nodeToRemove = self.__head
+  43:             nodeToRemove = __head
   44:             self.__sentinel.next = None
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
   47:             return nodeToRemove
--------------------------------------------------------------------------------
[0.06919 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_3

def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
>       var_0 = singly_linked_list_0.remove()

MIO-MOSA/test_linkedList3_MIO.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613d7a290>

>   ???
E   NameError: name '_SinglyLinkedList__head' is not defined

linkedList3:43: NameError

   - [# 104] SVD linkedList3: 
--------------------------------------------------------------------------------
   40:         if self.__size == 0:
   41:             return None
   42:         if self.__size >= 1:
   43:             nodeToRemove = self.__head
-  44:             self.__sentinel.next = None
+  44:             __sentinel.next = None
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
   47:             return nodeToRemove
   48:         else:
--------------------------------------------------------------------------------
[0.06986 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_3

def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(singly_linked_list_0)
>       var_0 = singly_linked_list_0.remove()

MIO-MOSA/test_linkedList3_MIO.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613d9b610>

>   ???
E   NameError: name '_SinglyLinkedList__sentinel' is not defined

linkedList3:44: NameError

   - [# 108] SVD linkedList3: 
--------------------------------------------------------------------------------
   45:             self.__head = self.__sentinel
   46:             self.__size -= 1
   47:             return nodeToRemove
   48:         else:
-  49:             nodeToRemove = self.__head
+  49:             nodeToRemove = __head
   50:             self.__sentinel.next = self.__head.next
   51:             self.__head = self.__sentinel.next
   52:             self.__size -= 1
   53:             return nodeToRemove
--------------------------------------------------------------------------------
[0.05983 s] survived

   - [# 109] SVD linkedList3: 
--------------------------------------------------------------------------------
   46:             self.__size -= 1
   47:             return nodeToRemove
   48:         else:
   49:             nodeToRemove = self.__head
-  50:             self.__sentinel.next = self.__head.next
+  50:             __sentinel.next = self.__head.next
   51:             self.__head = self.__sentinel.next
   52:             self.__size -= 1
   53:             return nodeToRemove
   54:     
--------------------------------------------------------------------------------
[0.06126 s] survived

   - [# 110] SVD linkedList3: 
--------------------------------------------------------------------------------
   46:             self.__size -= 1
   47:             return nodeToRemove
   48:         else:
   49:             nodeToRemove = self.__head
-  50:             self.__sentinel.next = self.__head.next
+  50:             self.__sentinel.next = __head.next
   51:             self.__head = self.__sentinel.next
   52:             self.__size -= 1
   53:             return nodeToRemove
   54:     
--------------------------------------------------------------------------------
[0.06041 s] survived

   - [# 112] SVD linkedList3: 
--------------------------------------------------------------------------------
   47:             return nodeToRemove
   48:         else:
   49:             nodeToRemove = self.__head
   50:             self.__sentinel.next = self.__head.next
-  51:             self.__head = self.__sentinel.next
+  51:             self.__head = __sentinel.next
   52:             self.__size -= 1
   53:             return nodeToRemove
   54:     
   55:     def getHead(self) -> T:
--------------------------------------------------------------------------------
[0.05938 s] survived

   - [# 114] SVD linkedList3: 
--------------------------------------------------------------------------------
   55:     def getHead(self) -> T:
   56:         
   57:         '''Get value of the linkedlist head node.'''
   58:         
-  59:         return self.__head.value
+  59:         return __head.value
   60:     
   61:     def getHeadNode(self) -> Node:
   62:         
   63:         '''Get head node referance.'''
--------------------------------------------------------------------------------
[0.07711 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_11

def test_case_11():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       var_0 = singly_linked_list_0.getHead()

MIO-MOSA/test_linkedList3_MIO.py:63: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613fc3be0>

>   ???
E   NameError: name '_SinglyLinkedList__head' is not defined

linkedList3:59: NameError

   - [# 115] SVD linkedList3: 
--------------------------------------------------------------------------------
   61:     def getHeadNode(self) -> Node:
   62:         
   63:         '''Get head node referance.'''
   64:         
-  65:         return self.__head
+  65:         return __head
   66:     
   67:     def getSize(self) -> int:
   68:         
   69:         '''Return size of the linkedlist.'''
--------------------------------------------------------------------------------
[0.07793 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_12

def test_case_12():
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       node_0 = singly_linked_list_0.getHeadNode()

MIO-MOSA/test_linkedList3_MIO.py:67: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f4613f913c0>

>   ???
E   NameError: name '_SinglyLinkedList__head' is not defined

linkedList3:65: NameError

   - [# 118] SVD linkedList3: 
--------------------------------------------------------------------------------
   80:         
   81:         '''Converts linkedlist to list.'''
   82:         
   83:         arr = []
-  84:         current = self.__head
+  84:         current = __head
   85:         while current:
   86:             arr.append(current.value)
   87:             current = current.next
   88:         return arr
--------------------------------------------------------------------------------
[0.07533 s] killed by MIO-MOSA/test_linkedList3_MIO.py::test_case_7

def test_case_7():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = None
        none_type_1 = singly_linked_list_0.add(none_type_0)
        none_type_2 = singly_linked_list_0.add(none_type_0)
>       list_0 = singly_linked_list_0.toArray()

MIO-MOSA/test_linkedList3_MIO.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList3.SinglyLinkedList object at 0x7f46140f0910>

>   ???
E   NameError: name '_SinglyLinkedList__head' is not defined

linkedList3:84: NameError
