24 : Job ID 30ac8a1a9921486c9947fea049e277e2
test outcome: killed
linkedList4.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr and val != self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py ............F.          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..........F.......           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py .............FF.            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py FF.                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ..F.....             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_12 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_10 - assert <li...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py::test_case_13 - assert 5 ...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py::test_case_14 - assert <l...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py::test_remove

27 : Job ID 2d9424d27bd8441a9ed7e434c44cc4ca
test outcome: killed
linkedList4.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr and val < self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py ..........FFFF          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..........FF.F....           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py ...........FF.FF            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py FF.                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ..F.FF..             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_10 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_11 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_12 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_13 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_10 - Ty

30 : Job ID 48f2b07a6b94408b9d2254f7c8cb4397
test outcome: killed
linkedList4.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr and val <= self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py ..........FFFF          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..........FF.F....           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py ...........FF.FF            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py F..                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ..F.FF..             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_10 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_11 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_12 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_13 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_10 -

33 : Job ID a67a7d2d8a3e42e99904918da0aff764
test outcome: killed
linkedList4.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr and val > self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py ..........FFFF          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..........FF.F....           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py ...........FFFFF            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py .F.                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ..F.FF..             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_10 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_11 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_12 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_13 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_10 - Ty

36 : Job ID 79044dd61b8c4f0484e58654880163a5
test outcome: killed
linkedList4.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr and val >= self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py ..........FFFF          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..........FF.F....           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py ...........FFFFF            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py ...                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ..F.FF..             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_10 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_11 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_12 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_13 - TypeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_10 -

39 : Job ID 555baa84491d47648caef323ae19270d
SURVIVED
test outcome: survived
linkedList4.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr and val is self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py ..............          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..................           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py ................            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py ...                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ........             [100%]
============================== 59 passed in 0.19s ==============================

42 : Job ID b1335c80e5d448c4ab762efe72ea5319
test outcome: killed
linkedList4.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr and val is not self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py ............F.          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..........F.......           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py .............FF.            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py FF.                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ..F.....             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_12 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_10 - assert <li...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py::test_case_13 - assert 5 ...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py::test_case_14 - assert <l...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py::test_re

53 : Job ID f61621581b9940b3ae0988238b48e44b
test outcome: killed
linkedList4.py, start pos: (71, 11), end pos: (71, 41)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if not curr and val == self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py .....F.F....F.          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ..........F.F.....           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py .......F..F..FF.            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py .F.                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ..FF....             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_5 - Attrib...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_7 - Attrib...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_12 - asser...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_10 - assert <li...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_12 - AttributeE...
FAILED A

57 : Job ID 059a1c2e70b345d989f18885b47832e3
test outcome: killed
linkedList4.py, start pos: (71, 16), end pos: (71, 19)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- alinkedList4.py
+++ blinkedList4.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val == self.head.data: # Manually adjusted line (from is to ==)
+        if curr or val == self.head.data: # Manually adjusted line (from is to ==)
             self.head = self.head.next
             self._length -= 1
         while curr:
ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py .....F.F......          [ 23%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py ............F.....           [ 54%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py .......F..F..F..            [ 81%]
ALL-SMART-GPT-MUTPY/test_linkedList4_MUTPY.py F..                        [ 86%]
ALL-SMART-GPT-MUTPY/test_linkedList4_WHOLE_SUITE.py ...F....             [100%]
=========================== short test summary info ============================
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_5 - Attrib...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_DYNAMOSA.py::test_case_7 - Attrib...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MIO.py::test_case_12 - AttributeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py::test_case_7 - AttributeE...
FAILED ALL-SMART-GPT-MUTPY/test_linkedList4_MOSA.py::test_case_10 - Attribute...
FAI
