   - [#   5] ASR linkedList4: 
--------------------------------------------------------------------------------
  41:     def push(self, val):
  42:         '''Insert a value at the head of the list.'''
  43:         old_head = self.head
  44:         self.head = Node(val, old_head)
- 45:         self._length += 1
+ 45:         self._length -= 1
  46:     
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
--------------------------------------------------------------------------------
[5.41833 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_32

def test_case_32():
        bool_0 = True
        node_0 = module_0.Node(bool_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_1 = linked_list_1.remove(none_type_1)
        none_type_2 = None
        node_2 = module_0.Node(none_type_2)
        linked_list_2 = module_0.LinkedList(node_2)
        assert f'{type(linked_list_2.head).__module__}.{type(linked_list_2.head).__qualname__}' == 'linkedList4.Node'
        var_2 = linked_list_2.remove(none_type_2)
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        none_type_3 = None
        linked_list_4 = module_0.LinkedList(none_type_3)
        assert linked_l

   - [#   6] ASR linkedList4: 
--------------------------------------------------------------------------------
  49:         if not (self.head):
  50:             raise IndexError('Cannot pop from an empty list')
  51:         to_return = self.head
  52:         self.head = self.head.next
- 53:         self._length -= 1
+ 53:         self._length += 1
  54:         return to_return.data
  55:     
  56:     def size(self):
  57:         '''Return the length of the list.'''
--------------------------------------------------------------------------------
[5.81425 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_524

def test_case_524():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList()
        assert linked_list_2.head is None
        var_1 = linked_list_2.remove(none_type_1)
        linked_list_3 = module_0.LinkedList(var_1)
        assert linked_list_3.head is None
        linked_list_4 = module_0.LinkedList()
        assert linked_list_4.head is None
        none_type_2 = None
        node_0 = module_0.Node(none_type_2)
        linked_list_5 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_5.head).__module__}.{type(linked_list_5.head).__qualname__}' == 'linkedList4.Node'
        var_2 = linked_list_5.remove(none_type_2)
        linked_list_6 = module_0.LinkedList(none_type_2)
        assert linked_list_6.head is None
        var_3 = link

   - [#   8] ASR linkedList4: 
--------------------------------------------------------------------------------
  73:             self._length -= 1
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
  76:                 curr.next = curr.next.next
- 77:                 self._length -= 1
+ 77:                 self._length += 1
  78:             curr = curr.next
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
--------------------------------------------------------------------------------
[2.89331 s] survived

   - [#  10] CDI linkedList4: 
--------------------------------------------------------------------------------
   6: 
   7:     Data attribute for data storage and Next for pointer to next node.
   8:     '''
   9:     
- 10:     def __init__(self, data, next_node=None):
- 11:         '''Attribute data and next_node.'''
- 12:         self.data = data
- 13:         self.next = next_node
- 14: 
+ 10:     @classmethod
+ 11:     def __init__(self, data, next_node=None):
+ 12:         '''Attribute data and next_node.'''
+ 13:         self.data = data
+ 14:         self.next = next_node
  15: 
  16: class LinkedList(object):
  17:     '''Method for linked list.
  18: 
--------------------------------------------------------------------------------
[5.13171 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module

   - [#  12] CDI linkedList4: 
--------------------------------------------------------------------------------
  37:         except TypeError:
  38:             if data:
  39:                 self.push(data)
  40:     
- 41:     def push(self, val):
- 42:         '''Insert a value at the head of the list.'''
- 43:         old_head = self.head
- 44:         self.head = Node(val, old_head)
- 45:         self._length += 1
- 46:     
+ 41:     @classmethod
+ 42:     def push(self, val):
+ 43:         '''Insert a value at the head of the list.'''
+ 44:         old_head = self.head
+ 45:         self.head = Node(val, old_head)
+ 46:         self._length += 1
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
  50:             raise IndexError('Cannot pop from an empty list')
--------------------------------------------------------------------------------
[5.03050 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

self = <linkedList4.LinkedList object at 0x7eff4c812110>
data = <linkedList4.Node object at 0x7eff4c811e40>

>   ???
E   TypeError: 'Node' object is not iterable

linkedList4:35: TypeError

During handling of the above exception, another exception occurred:

    def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
>       linked_list_0 = module_0.LinkedList(node_0)

RANDOM/test_linkedList4_RANDOM.py:155: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList4:39: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [#  13] CDI linkedList4: 
--------------------------------------------------------------------------------
  43:         old_head = self.head
  44:         self.head = Node(val, old_head)
  45:         self._length += 1
  46:     
- 47:     def pop(self):
- 48:         '''Remove the first value and return it.'''
- 49:         if not (self.head):
- 50:             raise IndexError('Cannot pop from an empty list')
- 51:         to_return = self.head
- 52:         self.head = self.head.next
- 53:         self._length -= 1
- 54:         return to_return.data
- 55:     
+ 47:     @classmethod
+ 48:     def pop(self):
+ 49:         '''Remove the first value and return it.'''
+ 50:         if not (self.head):
+ 51:             raise IndexError('Cannot pop from an empty list')
+ 52:         to_return = self.head
+ 53:         self.head = self.head.next
+ 54:         self._length -= 1
+ 55:         return to_return.data
  56:     def size(self):
  57:         '''Return the length of the list.'''
  58:         return self._length
  59:     
--------------------------------------------------------------------------------
[5.12696 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type

   - [#  14] CDI linkedList4: 
--------------------------------------------------------------------------------
  52:         self.head = self.head.next
  53:         self._length -= 1
  54:         return to_return.data
  55:     
- 56:     def size(self):
- 57:         '''Return the length of the list.'''
- 58:         return self._length
- 59:     
+ 56:     @classmethod
+ 57:     def size(self):
+ 58:         '''Return the length of the list.'''
+ 59:         return self._length
  60:     def search(self, val):
  61:         '''Return the node containing val.'''
  62:         curr = self.head
  63:         while curr:
--------------------------------------------------------------------------------
[5.05275 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_0

def test_case_0():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
>       var_0 = linked_list_0.size()

RANDOM/test_linkedList4_RANDOM.py:11: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList4.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute '_length'

linkedList4:59: AttributeError

   - [#  15] CDI linkedList4: 
--------------------------------------------------------------------------------
  56:     def size(self):
  57:         '''Return the length of the list.'''
  58:         return self._length
  59:     
- 60:     def search(self, val):
- 61:         '''Return the node containing val.'''
- 62:         curr = self.head
- 63:         while curr:
- 64:             if curr.data == val:
- 65:                 return curr
- 66:             curr = curr.next
- 67:     
+ 60:     @classmethod
+ 61:     def search(self, val):
+ 62:         '''Return the node containing val.'''
+ 63:         curr = self.head
+ 64:         while curr:
+ 65:             if curr.data == val:
+ 66:                 return curr
+ 67:             curr = curr.next
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
  71:         if (curr and val is self.head.data):
--------------------------------------------------------------------------------
[4.97157 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_8

def test_case_8():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
        assert var_2 == ')'

   - [#  16] CDI linkedList4: 
--------------------------------------------------------------------------------
  64:             if curr.data == val:
  65:                 return curr
  66:             curr = curr.next
  67:     
- 68:     def remove(self, val):
- 69:         '''Remove node from list if exists.'''
- 70:         curr = self.head
- 71:         if (curr and val is self.head.data):
- 72:             self.head = self.head.next
- 73:             self._length -= 1
- 74:         while curr:
- 75:             if (curr.next and curr.next.data == val):
- 76:                 curr.next = curr.next.next
- 77:                 self._length -= 1
- 78:             curr = curr.next
- 79:     
+ 68:     @classmethod
+ 69:     def remove(self, val):
+ 70:         '''Remove node from list if exists.'''
+ 71:         curr = self.head
+ 72:         if (curr and val is self.head.data):
+ 73:             self.head = self.head.next
+ 74:             self._length -= 1
+ 75:         while curr:
+ 76:             if (curr.next and curr.next.data == val):
+ 77:                 curr.next = curr.next.next
+ 78:                 self._length -= 1
+ 79:             curr = curr.next
  80:     def display(self):
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
  83:         display = '('
--------------------------------------------------------------------------------
[5.09057 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.he

   - [#  17] CDI linkedList4: 
--------------------------------------------------------------------------------
  76:                 curr.next = curr.next.next
  77:                 self._length -= 1
  78:             curr = curr.next
  79:     
- 80:     def display(self):
- 81:         '''Display list as a tuple.'''
- 82:         curr = self.head
- 83:         display = '('
- 84:         while curr:
- 85:             display += str(curr.data) + ', '
- 86:             curr = curr.next
- 87:         return display[:-2] + ')'
+ 80:     @classmethod
+ 81:     def display(self):
+ 82:         '''Display list as a tuple.'''
+ 83:         curr = self.head
+ 84:         display = '('
+ 85:         while curr:
+ 86:             display += str(curr.data) + ', '
+ 87:             curr = curr.next
+ 88:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.34334 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
>       var_2 = linked_list_0.display()

RANDOM/test_linkedList4_RANDOM.py:74: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [#  18] COD linkedList4: 
--------------------------------------------------------------------------------
  45:         self._length += 1
  46:     
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
- 49:         if not (self.head):
+ 49:         if self.head:
  50:             raise IndexError('Cannot pop from an empty list')
  51:         to_return = self.head
  52:         self.head = self.head.next
  53:         self._length -= 1
--------------------------------------------------------------------------------
[5.35840 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()
        assert li

   - [#  20] COI linkedList4: 
--------------------------------------------------------------------------------
  45:         self._length += 1
  46:     
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
- 49:         if not (self.head):
+ 49:         if not ((not (self.head))):
  50:             raise IndexError('Cannot pop from an empty list')
  51:         to_return = self.head
  52:         self.head = self.head.next
  53:         self._length -= 1
--------------------------------------------------------------------------------
[5.16625 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()

   - [#  22] COI linkedList4: 
--------------------------------------------------------------------------------
  60:     def search(self, val):
  61:         '''Return the node containing val.'''
  62:         curr = self.head
  63:         while curr:
- 64:             if curr.data == val:
+ 64:             if not (curr.data == val):
  65:                 return curr
  66:             curr = curr.next
  67:     
  68:     def remove(self, val):
--------------------------------------------------------------------------------
[5.78616 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_365

def test_case_365():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
        var_0 = linked_list_0.remove(none_type_0)
        linked_list_1 = module_0.LinkedList(none_type_0)
        assert linked_list_1.head is None
        var_1 = linked_list_0.display()
        int_0 = 1454
        linked_list_2 = module_0.LinkedList()
        assert linked_list_2.head is None
        var_2 = linked_list_2.search(int_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_3 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_3.head).__module__}.{type(linked_list_3.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_3.remove(none_type_1)
        linked_list_4 = module_0.LinkedList()
        assert linked_list_4.head is None
        node_2 = module_0.Node(linked_list_3, linked_list_2)
        linked_list_5 = module_0.Linke

   - [#  23] COI linkedList4: 
--------------------------------------------------------------------------------
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
- 71:         if (curr and val is self.head.data):
+ 71:         if not ((curr and val is self.head.data)):
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
--------------------------------------------------------------------------------
[5.23758 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_12

def test_case_12():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_0 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
        var_0 = linked_list_0.remove(none_type_1)
        none_type_2 = None
        linked_list_1 = module_0.LinkedList(none_type_2)
        assert linked_list_1.head is None
        var_1 = linked_list_1.size()
        assert var_1 == 0
        linked_list_2 = module_0.LinkedList()
        assert linked_list_2.head is None
        none_type_3 = None
        linked_list_3 = module_0.LinkedList(none_type_3)
        assert linked_list_3.head is None
        var_2 = linked_list_3.size()
        assert var_2 == 0
        var_3 = linked_list_1.display()
        assert var_3 == ')'
        none_type_4 = None
        linked_list_4 = module_0.LinkedList(none_type_4)
        assert link

   - [#  25] COI linkedList4: 
--------------------------------------------------------------------------------
  71:         if (curr and val is self.head.data):
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
- 75:             if (curr.next and curr.next.data == val):
+ 75:             if not ((curr.next and curr.next.data == val)):
  76:                 curr.next = curr.next.next
  77:                 self._length -= 1
  78:             curr = curr.next
  79:     
--------------------------------------------------------------------------------
[5.20120 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
>       var_0 = linked_list_0.remove(none_type_0)

RANDOM/test_linkedList4_RANDOM.py:158: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff5033b3a0>, val = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList4:76: AttributeError

   - [#  27] CRP linkedList4: 
--------------------------------------------------------------------------------
  28:     '''
  29:     
  30:     def __init__(self, data=None):
  31:         '''Linked list initialized with head.'''
- 32:         self._length = 0
+ 32:         self._length = 1
  33:         self.head = None
  34:         try:
  35:             for val in data:
  36:                 self.push(val)
--------------------------------------------------------------------------------
[5.26636 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_0

def test_case_0():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
>       assert var_0 == 0
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:12: AssertionError

   - [#  29] CRP linkedList4: 
--------------------------------------------------------------------------------
  46:     
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
- 50:             raise IndexError('Cannot pop from an empty list')
+ 50:             raise IndexError('mutpy')
  51:         to_return = self.head
  52:         self.head = self.head.next
  53:         self._length -= 1
  54:         return to_return.data
--------------------------------------------------------------------------------
[2.77271 s] survived

   - [#  30] CRP linkedList4: 
--------------------------------------------------------------------------------
  46:     
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
- 50:             raise IndexError('Cannot pop from an empty list')
+ 50:             raise IndexError('')
  51:         to_return = self.head
  52:         self.head = self.head.next
  53:         self._length -= 1
  54:         return to_return.data
--------------------------------------------------------------------------------
[2.84986 s] survived

   - [#  34] CRP linkedList4: 
--------------------------------------------------------------------------------
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
- 83:         display = '('
+ 83:         display = 'mutpy'
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
  87:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.16874 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
>       assert var_2 == ')'
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:75: AssertionError
