   - [#  35] CRP linkedList4: 
--------------------------------------------------------------------------------
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
- 83:         display = '('
+ 83:         display = ''
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
  87:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.28204 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_199

def test_case_199():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        int_0 = 1454
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        var_3 = linked_list_1.search(int_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_2 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_2.head).__module__}.{type(linked_list_2.head).__qualname__}' == 'linkedList4.Node'
        var_4 = linked_list_2.remove(none_type_1)
        linked_list_3 = module_0.LinkedList()
        assert linked_list_3.head is None
        node_2 = module_0.Node(linked_list_2, linked_list_1)
        none_type_2 = None
        node_3 = module_0.Node(none_type_2)
        none_type_3

   - [#  36] CRP linkedList4: 
--------------------------------------------------------------------------------
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
  83:         display = '('
  84:         while curr:
- 85:             display += str(curr.data) + ', '
+ 85:             display += str(curr.data) + 'mutpy'
  86:             curr = curr.next
  87:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.71458 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_199

def test_case_199():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        int_0 = 1454
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        var_3 = linked_list_1.search(int_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_2 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_2.head).__module__}.{type(linked_list_2.head).__qualname__}' == 'linkedList4.Node'
        var_4 = linked_list_2.remove(none_type_1)
        linked_list_3 = module_0.LinkedList()
        assert linked_list_3.head is None
        node_2 = module_0.Node(linked_list_2, linked_list_1)
        none_type_2 = None
        node_3 = module_0.Node(none_type_2)
        none_type_3 = None

   - [#  37] CRP linkedList4: 
--------------------------------------------------------------------------------
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
  83:         display = '('
  84:         while curr:
- 85:             display += str(curr.data) + ', '
+ 85:             display += str(curr.data) + ''
  86:             curr = curr.next
  87:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.40182 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_199

def test_case_199():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        int_0 = 1454
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        var_3 = linked_list_1.search(int_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_2 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_2.head).__module__}.{type(linked_list_2.head).__qualname__}' == 'linkedList4.Node'
        var_4 = linked_list_2.remove(none_type_1)
        linked_list_3 = module_0.LinkedList()
        assert linked_list_3.head is None
        node_2 = module_0.Node(linked_list_2, linked_list_1)
        none_type_2 = None
        node_3 = module_0.Node(none_type_2)
        none_type_3 = None
        lin

   - [#  39] CRP linkedList4: 
--------------------------------------------------------------------------------
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
- 87:         return display[:-2] + ')'
+ 87:         return display[:-2] + 'mutpy'
--------------------------------------------------------------------------------
[5.20838 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
>       assert var_2 == ')'
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:75: AssertionError

   - [#  40] CRP linkedList4: 
--------------------------------------------------------------------------------
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
- 87:         return display[:-2] + ')'
+ 87:         return display[:-2] + ''
--------------------------------------------------------------------------------
[5.18276 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
>       assert var_2 == ')'
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:75: AssertionError

   - [#  43] LCR linkedList4: 
--------------------------------------------------------------------------------
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
- 71:         if (curr and val is self.head.data):
+ 71:         if (curr or val is self.head.data):
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
--------------------------------------------------------------------------------
[5.17249 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_12

def test_case_12():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_0 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
        var_0 = linked_list_0.remove(none_type_1)
        none_type_2 = None
        linked_list_1 = module_0.LinkedList(none_type_2)
        assert linked_list_1.head is None
        var_1 = linked_list_1.size()
        assert var_1 == 0
        linked_list_2 = module_0.LinkedList()
        assert linked_list_2.head is None
        none_type_3 = None
        linked_list_3 = module_0.LinkedList(none_type_3)
        assert linked_list_3.head is None
        var_2 = linked_list_3.size()
        assert var_2 == 0
        var_3 = linked_list_1.display()
        assert var_3 == ')'
        none_type_4 = None
        linked_list_4 = module_0.LinkedList(none_type_4)
        assert linked_list

   - [#  48] OIL linkedList4: 
--------------------------------------------------------------------------------
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
- 87:         return display[:-2] + ')'
+ 87:             break
+ 88:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.30933 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_290

def test_case_290():
        bytes_0 = b'\xabyc\x83\x0b[\x1e\xf3)\xf3'
        linked_list_0 = module_0.LinkedList(bytes_0)
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
        var_0 = linked_list_0.display()
>       assert var_0 == '(243, 41, 243, 30, 91, 11, 131, 99, 121, 171)'
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:12108: AssertionError

   - [#  53] SDI linkedList4: 
--------------------------------------------------------------------------------
  26:     display() - will return a unicode string representing the list as
  27:     if it were a Python tuple literal: "(12, \'sam\', 37, \'tango\')"
  28:     '''
  29:     
- 30:     def __init__(self, data=None):
- 31:         '''Linked list initialized with head.'''
- 32:         self._length = 0
- 33:         self.head = None
- 34:         try:
- 35:             for val in data:
- 36:                 self.push(val)
- 37:         except TypeError:
- 38:             if data:
- 39:                 self.push(data)
- 40:     
+ 30:     @staticmethod
+ 31:     def __init__(self, data=None):
+ 32:         '''Linked list initialized with head.'''
+ 33:         self._length = 0
+ 34:         self.head = None
+ 35:         try:
+ 36:             for val in data:
+ 37:                 self.push(val)
+ 38:         except TypeError:
+ 39:             if data:
+ 40:                 self.push(data)
  41:     def push(self, val):
  42:         '''Insert a value at the head of the list.'''
  43:         old_head = self.head
  44:         self.head = Node(val, old_head)
--------------------------------------------------------------------------------
[5.30432 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_0

def test_case_0():
        none_type_0 = None
>       linked_list_0 = module_0.LinkedList(none_type_0)

RANDOM/test_linkedList4_RANDOM.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = None, data = None

>   ???

   - [#  60] SDL linkedList4: 
--------------------------------------------------------------------------------
   8:     '''
   9:     
  10:     def __init__(self, data, next_node=None):
  11:         '''Attribute data and next_node.'''
- 12:         self.data = data
+ 12:         pass
  13:         self.next = next_node
  14: 
  15: 
  16: class LinkedList(object):
--------------------------------------------------------------------------------
[5.15847 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_6

def test_case_6():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        node_0 = module_0.Node(none_type_1)
        none_type_2 = None
        linked_list_2 = module_0.LinkedList(none_type_2)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_2.size()
        assert var_2 == 0
        none_type_3 = None
        node_1 = module_0.Node(none_type_3)
        none_type_4 = None
        linked_list_3 = module_0.LinkedList(none_type_4)
        assert linked_list_3.head is None
        var_3 = linked_list_3.size()
        assert var_3 == 0
        linked_list_4 = module_0.LinkedList()
        assert linked_list_4.head is None
        none_type_5 = None
        linked_list_5 = module_0.LinkedList(none_type_5)
        assert linked_list_5.head is None

   - [#  62] SDL linkedList4: 
--------------------------------------------------------------------------------
  28:     '''
  29:     
  30:     def __init__(self, data=None):
  31:         '''Linked list initialized with head.'''
- 32:         self._length = 0
+ 32:         pass
  33:         self.head = None
  34:         try:
  35:             for val in data:
  36:                 self.push(val)
--------------------------------------------------------------------------------
[5.17308 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_0

def test_case_0():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
>       var_0 = linked_list_0.size()

RANDOM/test_linkedList4_RANDOM.py:11: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff503065f0>

>   ???
E   AttributeError: 'LinkedList' object has no attribute '_length'

linkedList4:58: AttributeError

   - [#  63] SDL linkedList4: 
--------------------------------------------------------------------------------
  29:     
  30:     def __init__(self, data=None):
  31:         '''Linked list initialized with head.'''
  32:         self._length = 0
- 33:         self.head = None
+ 33:         pass
  34:         try:
  35:             for val in data:
  36:                 self.push(val)
  37:         except TypeError:
--------------------------------------------------------------------------------
[5.13598 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_0

def test_case_0():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
>       assert linked_list_0.head is None
E       AttributeError: 'LinkedList' object has no attribute 'head'

RANDOM/test_linkedList4_RANDOM.py:10: AttributeError

   - [#  66] SDL linkedList4: 
--------------------------------------------------------------------------------
  39:                 self.push(data)
  40:     
  41:     def push(self, val):
  42:         '''Insert a value at the head of the list.'''
- 43:         old_head = self.head
+ 43:         pass
  44:         self.head = Node(val, old_head)
  45:         self._length += 1
  46:     
  47:     def pop(self):
--------------------------------------------------------------------------------
[5.16520 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

self = <linkedList4.LinkedList object at 0x7eff516f1a80>
data = <linkedList4.Node object at 0x7eff516f1b70>

>   ???
E   TypeError: 'Node' object is not iterable

linkedList4:35: TypeError

During handling of the above exception, another exception occurred:

    def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
>       linked_list_0 = module_0.LinkedList(node_0)

RANDOM/test_linkedList4_RANDOM.py:155: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList4:39: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff516f1a80>
val = <linkedList4.Node object at 0x7eff516f1b70>

>   ???
E   NameError: name 'old_head' is not defined

linkedList4:44: NameError

   - [#  67] SDL linkedList4: 
--------------------------------------------------------------------------------
  40:     
  41:     def push(self, val):
  42:         '''Insert a value at the head of the list.'''
  43:         old_head = self.head
- 44:         self.head = Node(val, old_head)
+ 44:         pass
  45:         self._length += 1
  46:     
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
--------------------------------------------------------------------------------
[5.18707 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
>       assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:157: AssertionError

   - [#  68] SDL linkedList4: 
--------------------------------------------------------------------------------
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
  50:             raise IndexError('Cannot pop from an empty list')
- 51:         to_return = self.head
+ 51:         pass
  52:         self.head = self.head.next
  53:         self._length -= 1
  54:         return to_return.data
  55:     
--------------------------------------------------------------------------------
[5.47398 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()
        assert linked_

   - [#  69] SDL linkedList4: 
--------------------------------------------------------------------------------
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
  50:             raise IndexError('Cannot pop from an empty list')
  51:         to_return = self.head
- 52:         self.head = self.head.next
+ 52:         pass
  53:         self._length -= 1
  54:         return to_return.data
  55:     
  56:     def size(self):
--------------------------------------------------------------------------------
[5.54432 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()
        assert linked

   - [#  70] SDL linkedList4: 
--------------------------------------------------------------------------------
  50:             raise IndexError('Cannot pop from an empty list')
  51:         to_return = self.head
  52:         self.head = self.head.next
  53:         self._length -= 1
- 54:         return to_return.data
+ 54:         pass
  55:     
  56:     def size(self):
  57:         '''Return the length of the list.'''
  58:         return self._length
--------------------------------------------------------------------------------
[5.64638 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()
        assert linked_list_4

   - [#  71] SDL linkedList4: 
--------------------------------------------------------------------------------
  54:         return to_return.data
  55:     
  56:     def size(self):
  57:         '''Return the length of the list.'''
- 58:         return self._length
+ 58:         pass
  59:     
  60:     def search(self, val):
  61:         '''Return the node containing val.'''
  62:         curr = self.head
--------------------------------------------------------------------------------
[5.39423 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_0

def test_case_0():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
>       assert var_0 == 0
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:12: AssertionError

   - [#  72] SDL linkedList4: 
--------------------------------------------------------------------------------
  58:         return self._length
  59:     
  60:     def search(self, val):
  61:         '''Return the node containing val.'''
- 62:         curr = self.head
+ 62:         pass
  63:         while curr:
  64:             if curr.data == val:
  65:                 return curr
  66:             curr = curr.next
--------------------------------------------------------------------------------
[5.50427 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_8

def test_case_8():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
        assert var_2 == ')'
>       var_3 = linked_list_0.search(var_2)

RANDOM/test_linkedList4_RANDOM.py:150: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff4f172230>, val = ')'

>   ???
E   UnboundLocalError: local variable 'curr' referenced before assignment

linkedList4:63: UnboundLocalError

   - [#  73] SDL linkedList4: 
--------------------------------------------------------------------------------
  61:         '''Return the node containing val.'''
  62:         curr = self.head
  63:         while curr:
  64:             if curr.data == val:
- 65:                 return curr
+ 65:                 pass
  66:             curr = curr.next
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
--------------------------------------------------------------------------------
[5.79472 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_365

def test_case_365():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
        var_0 = linked_list_0.remove(none_type_0)
        linked_list_1 = module_0.LinkedList(none_type_0)
        assert linked_list_1.head is None
        var_1 = linked_list_0.display()
        int_0 = 1454
        linked_list_2 = module_0.LinkedList()
        assert linked_list_2.head is None
        var_2 = linked_list_2.search(int_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_3 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_3.head).__module__}.{type(linked_list_3.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_3.remove(none_type_1)
        linked_list_4 = module_0.LinkedList()
        assert linked_list_4.head is None
        node_2 = module_0.Node(linked_list_3, linked_list_2)
        linked_list_5 = module_0.Lin

   - [#  74] SDL linkedList4: 
--------------------------------------------------------------------------------
  62:         curr = self.head
  63:         while curr:
  64:             if curr.data == val:
  65:                 return curr
- 66:             curr = curr.next
+ 66:             pass
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
--------------------------------------------------------------------------------
[14.24112 s] timeout
