   - [#  75] SDL linkedList4: 
--------------------------------------------------------------------------------
  66:             curr = curr.next
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
- 70:         curr = self.head
+ 70:         pass
  71:         if (curr and val is self.head.data):
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
--------------------------------------------------------------------------------
[5.18974 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
>       var_0 = linked_list_0.remove(none_type_0)

RANDOM/test_linkedList4_RANDOM.py:158: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff50305240>, val = None

>   ???
E   UnboundLocalError: local variable 'curr' referenced before assignment

linkedList4:71: UnboundLocalError

   - [#  76] SDL linkedList4: 
--------------------------------------------------------------------------------
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
  71:         if (curr and val is self.head.data):
- 72:             self.head = self.head.next
+ 72:             pass
  73:             self._length -= 1
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
  76:                 curr.next = curr.next.next
--------------------------------------------------------------------------------
[6.42470 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_1215

def test_case_1215():
        bytes_0 = b'\xc3\xc2\xb3\x80\xf1b_\xad\xc6\x00Z\xff(~\x07>\x94t'
        node_0 = module_0.Node(bytes_0, bytes_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.push(linked_list_0)
        bool_0 = True
        node_1 = module_0.Node(bool_0)
        node_2 = module_0.Node(node_1)
        node_3 = module_0.Node(bool_0)
        complex_0 = -1265.460815 + 1056.434j
        node_4 = module_0.Node(node_3, complex_0)
        var_1 = linked_list_0.remove(linked_list_0)
>       assert linked_list_0.head is None
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:54736: AssertionError

   - [#  77] SDL linkedList4: 
--------------------------------------------------------------------------------
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
- 76:                 curr.next = curr.next.next
+ 76:                 pass
  77:                 self._length -= 1
  78:             curr = curr.next
  79:     
  80:     def display(self):
--------------------------------------------------------------------------------
[2.96818 s] survived

   - [#  78] SDL linkedList4: 
--------------------------------------------------------------------------------
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
  76:                 curr.next = curr.next.next
  77:                 self._length -= 1
- 78:             curr = curr.next
+ 78:             pass
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
--------------------------------------------------------------------------------
[14.25382 s] timeout

   - [#  79] SDL linkedList4: 
--------------------------------------------------------------------------------
  78:             curr = curr.next
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
- 82:         curr = self.head
+ 82:         pass
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
--------------------------------------------------------------------------------
[5.49979 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
>       var_2 = linked_list_0.display()

RANDOM/test_linkedList4_RANDOM.py:74: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff503076d0>

>   ???
E   UnboundLocalError: local variable 'curr' referenced before assignment

linkedList4:84: UnboundLocalError

   - [#  80] SDL linkedList4: 
--------------------------------------------------------------------------------
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
- 83:         display = '('
+ 83:         pass
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
  87:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.42220 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
>       var_2 = linked_list_0.display()

RANDOM/test_linkedList4_RANDOM.py:74: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff50305a80>

>   ???
E   UnboundLocalError: local variable 'display' referenced before assignment

linkedList4:87: UnboundLocalError

   - [#  81] SDL linkedList4: 
--------------------------------------------------------------------------------
  82:         curr = self.head
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
- 86:             curr = curr.next
+ 86:             pass
  87:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[14.25333 s] timeout

   - [#  82] SDL linkedList4: 
--------------------------------------------------------------------------------
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
- 87:         return display[:-2] + ')'
+ 87:         pass
--------------------------------------------------------------------------------
[5.09892 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
>       assert var_2 == ')'
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:75: AssertionError

   - [#  83] SIR linkedList4: 
--------------------------------------------------------------------------------
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
- 87:         return display[:-2] + ')'
+ 87:         return display[:] + ')'
--------------------------------------------------------------------------------
[5.03466 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
>       assert var_2 == ')'
E       AssertionError

RANDOM/test_linkedList4_RANDOM.py:75: AssertionError

   - [#  90] SVD linkedList4: 
--------------------------------------------------------------------------------
  39:                 self.push(data)
  40:     
  41:     def push(self, val):
  42:         '''Insert a value at the head of the list.'''
- 43:         old_head = self.head
+ 43:         old_head = head
  44:         self.head = Node(val, old_head)
  45:         self._length += 1
  46:     
  47:     def pop(self):
--------------------------------------------------------------------------------
[5.16567 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

self = <linkedList4.LinkedList object at 0x7eff50306ad0>
data = <linkedList4.Node object at 0x7eff50307790>

>   ???
E   TypeError: 'Node' object is not iterable

linkedList4:35: TypeError

During handling of the above exception, another exception occurred:

    def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
>       linked_list_0 = module_0.LinkedList(node_0)

RANDOM/test_linkedList4_RANDOM.py:155: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linkedList4:39: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff50306ad0>
val = <linkedList4.Node object at 0x7eff50307790>

>   ???
E   NameError: name 'head' is not defined

linkedList4:43: NameError

   - [#  93] SVD linkedList4: 
--------------------------------------------------------------------------------
  45:         self._length += 1
  46:     
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
- 49:         if not (self.head):
+ 49:         if not head:
  50:             raise IndexError('Cannot pop from an empty list')
  51:         to_return = self.head
  52:         self.head = self.head.next
  53:         self._length -= 1
--------------------------------------------------------------------------------
[5.21506 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()
        assert lin

   - [#  94] SVD linkedList4: 
--------------------------------------------------------------------------------
  47:     def pop(self):
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
  50:             raise IndexError('Cannot pop from an empty list')
- 51:         to_return = self.head
+ 51:         to_return = head
  52:         self.head = self.head.next
  53:         self._length -= 1
  54:         return to_return.data
  55:     
--------------------------------------------------------------------------------
[5.18408 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()
        as

   - [#  96] SVD linkedList4: 
--------------------------------------------------------------------------------
  48:         '''Remove the first value and return it.'''
  49:         if not (self.head):
  50:             raise IndexError('Cannot pop from an empty list')
  51:         to_return = self.head
- 52:         self.head = self.head.next
+ 52:         self.head = head.next
  53:         self._length -= 1
  54:         return to_return.data
  55:     
  56:     def size(self):
--------------------------------------------------------------------------------
[5.24845 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_121

def test_case_121():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_1 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_1.head).__module__}.{type(linked_list_1.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_1.remove(none_type_1)
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        none_type_2 = None
        linked_list_3 = module_0.LinkedList(none_type_2)
        assert linked_list_3.head is None
        var_4 = linked_list_3.size()
        assert var_4 == 0
        linked_list_4 = module_0.LinkedList()

   - [#  98] SVD linkedList4: 
--------------------------------------------------------------------------------
  54:         return to_return.data
  55:     
  56:     def size(self):
  57:         '''Return the length of the list.'''
- 58:         return self._length
+ 58:         return _length
  59:     
  60:     def search(self, val):
  61:         '''Return the node containing val.'''
  62:         curr = self.head
--------------------------------------------------------------------------------
[4.99069 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_0

def test_case_0():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
>       var_0 = linked_list_0.size()

RANDOM/test_linkedList4_RANDOM.py:11: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff502e01f0>

>   ???
E   NameError: name '_length' is not defined

linkedList4:58: NameError

   - [#  99] SVD linkedList4: 
--------------------------------------------------------------------------------
  58:         return self._length
  59:     
  60:     def search(self, val):
  61:         '''Return the node containing val.'''
- 62:         curr = self.head
+ 62:         curr = head
  63:         while curr:
  64:             if curr.data == val:
  65:                 return curr
  66:             curr = curr.next
--------------------------------------------------------------------------------
[5.18505 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_8

def test_case_8():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
        var_2 = linked_list_0.display()
        assert var_2 == ')'
>       var_3 = linked_list_0.search(var_2)

RANDOM/test_linkedList4_RANDOM.py:150: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff516f3460>, val = ')'

>   ???
E   NameError: name 'head' is not defined

linkedList4:62: NameError

   - [# 100] SVD linkedList4: 
--------------------------------------------------------------------------------
  66:             curr = curr.next
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
- 70:         curr = self.head
+ 70:         curr = head
  71:         if (curr and val is self.head.data):
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
--------------------------------------------------------------------------------
[5.01768 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
>       var_0 = linked_list_0.remove(none_type_0)

RANDOM/test_linkedList4_RANDOM.py:158: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff50695180>, val = None

>   ???
E   NameError: name 'head' is not defined

linkedList4:70: NameError

   - [# 101] SVD linkedList4: 
--------------------------------------------------------------------------------
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
- 71:         if (curr and val is self.head.data):
+ 71:         if (curr and val is head.data):
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
--------------------------------------------------------------------------------
[5.21977 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_9

def test_case_9():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
>       var_0 = linked_list_0.remove(none_type_0)

RANDOM/test_linkedList4_RANDOM.py:158: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff4f271fc0>, val = None

>   ???
E   NameError: name 'head' is not defined

linkedList4:71: NameError

   - [# 103] SVD linkedList4: 
--------------------------------------------------------------------------------
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
  71:         if (curr and val is self.head.data):
- 72:             self.head = self.head.next
+ 72:             self.head = head.next
  73:             self._length -= 1
  74:         while curr:
  75:             if (curr.next and curr.next.data == val):
  76:                 curr.next = curr.next.next
--------------------------------------------------------------------------------
[5.15449 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_12

def test_case_12():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_0 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
        var_0 = linked_list_0.remove(none_type_1)
        none_type_2 = None
        linked_list_1 = module_0.LinkedList(none_type_2)
        assert linked_list_1.head is None
        var_1 = linked_list_1.size()
        assert var_1 == 0
        linked_list_2 = module_0.LinkedList()
        assert linked_list_2.head is None
        none_type_3 = None
        linked_list_3 = module_0.LinkedList(none_type_3)
        assert linked_list_3.head is None
        var_2 = linked_list_3.size()
        assert var_2 == 0
        var_3 = linked_list_1.display()
        assert var_3 == ')'
        none_type_4 = None
        linked_list_4 = module_0.LinkedList(none_type_4

   - [# 106] SVD linkedList4: 
--------------------------------------------------------------------------------
  78:             curr = curr.next
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
- 82:         curr = self.head
+ 82:         curr = head
  83:         display = '('
  84:         while curr:
  85:             display += str(curr.data) + ', '
  86:             curr = curr.next
--------------------------------------------------------------------------------
[5.23987 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_5

def test_case_5():
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        none_type_1 = None
        linked_list_2 = module_0.LinkedList(none_type_1)
        assert linked_list_2.head is None
        var_1 = linked_list_2.size()
        assert var_1 == 0
>       var_2 = linked_list_0.display()

RANDOM/test_linkedList4_RANDOM.py:74: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList4.LinkedList object at 0x7eff516cdab0>

>   ???
E   NameError: name 'head' is not defined

linkedList4:82: NameError

   - [# 108] ZIL linkedList4: 
--------------------------------------------------------------------------------
  60:     def search(self, val):
  61:         '''Return the node containing val.'''
  62:         curr = self.head
  63:         while curr:
- 64:             if curr.data == val:
- 65:                 return curr
- 66:             curr = curr.next
+ 64:             break
+ 65:     
+ 66:     
  67:     
  68:     def remove(self, val):
  69:         '''Remove node from list if exists.'''
  70:         curr = self.head
--------------------------------------------------------------------------------
[5.53492 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_365

def test_case_365():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        linked_list_0 = module_0.LinkedList(node_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert f'{type(linked_list_0.head).__module__}.{type(linked_list_0.head).__qualname__}' == 'linkedList4.Node'
        var_0 = linked_list_0.remove(none_type_0)
        linked_list_1 = module_0.LinkedList(none_type_0)
        assert linked_list_1.head is None
        var_1 = linked_list_0.display()
        int_0 = 1454
        linked_list_2 = module_0.LinkedList()
        assert linked_list_2.head is None
        var_2 = linked_list_2.search(int_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_3 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_3.head).__module__}.{type(linked_list_3.head).__qualname__}' == 'linkedList4.Node'
        var_3 = linked_list_3.remove(none_type_1)
        linked_list_4 = module_0.LinkedList()
        assert linked_list_4.head is None
        node_2

   - [# 109] ZIL linkedList4: 
--------------------------------------------------------------------------------
  71:         if (curr and val is self.head.data):
  72:             self.head = self.head.next
  73:             self._length -= 1
  74:         while curr:
- 75:             if (curr.next and curr.next.data == val):
- 76:                 curr.next = curr.next.next
- 77:                 self._length -= 1
- 78:             curr = curr.next
+ 75:             break
+ 76:     
+ 77:     
+ 78:     
  79:     
  80:     def display(self):
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
--------------------------------------------------------------------------------
[2.72094 s] survived

   - [# 110] ZIL linkedList4: 
--------------------------------------------------------------------------------
  81:         '''Display list as a tuple.'''
  82:         curr = self.head
  83:         display = '('
  84:         while curr:
- 85:             display += str(curr.data) + ', '
- 86:             curr = curr.next
+ 85:             break
+ 86:         
  87:         return display[:-2] + ')'
--------------------------------------------------------------------------------
[5.30052 s] killed by RANDOM/test_linkedList4_RANDOM.py::test_case_199

def test_case_199():
        complex_0 = -2363.678516 + 1356.37j
        node_0 = module_0.Node(complex_0)
        none_type_0 = None
        linked_list_0 = module_0.LinkedList(none_type_0)
        assert f'{type(linked_list_0).__module__}.{type(linked_list_0).__qualname__}' == 'linkedList4.LinkedList'
        assert linked_list_0.head is None
        var_0 = linked_list_0.size()
        assert var_0 == 0
        var_1 = linked_list_0.display()
        assert var_1 == ')'
        var_2 = linked_list_0.search(none_type_0)
        int_0 = 1454
        linked_list_1 = module_0.LinkedList()
        assert linked_list_1.head is None
        var_3 = linked_list_1.search(int_0)
        none_type_1 = None
        node_1 = module_0.Node(none_type_1)
        linked_list_2 = module_0.LinkedList(node_1)
        assert f'{type(linked_list_2.head).__module__}.{type(linked_list_2.head).__qualname__}' == 'linkedList4.Node'
        var_4 = linked_list_2.remove(none_type_1)
        linked_list_3 = module_0.LinkedList()
        assert linked_list_3.head is None
        node_2 = module_0.Node(linked_list_2, linked_list_1)
        none_type_2 = None
        node_3 = module_0.Node(none_type_2)
        none_type_3 = None
        linked_list_4
