   - [#  47] SDI linkedList5: 
--------------------------------------------------------------------------------
   1: class Node(object):
   2:     
-  3:     def __init__(self, data, next=None):
-  4:         self.next = next
-  5:         self.data = data
-  6:     
+  3:     @staticmethod
+  4:     def __init__(self, data, next=None):
+  5:         self.next = next
+  6:         self.data = data
   7:     def __str__(self):
   8:         return self.data
   9: 
  10: 
--------------------------------------------------------------------------------
[0.11510 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.insert_to_front(linked_list_0)
>       assert len(linked_list_0) == 1

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7f82585678b0>

>   ???
E   AttributeError: 'Node' object has no attribute 'next'

linkedList5:21: AttributeError
