1 : Job ID feb2b392afd74eee913999ba2b5425ff
test outcome: killed
linkedList5.py, start pos: (49, 30), end pos: (49, 32)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if curr_node.data != data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...F.............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................F.... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AssertionE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - assert <l...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - Assertio...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7 - As...
========================= 4 failed, 85 passed in 0.10s =========================

2 : Job ID 29d9fad3dd054e97a0553d1739ae0bf1
test outcome: killed
linkedList5.py, start pos: (59, 26), end pos: (59, 28)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if self.head.data != data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .................F.F....... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F............F...F. [ 70%]
FF.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...FF..F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert <l...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_0 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_5 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_7 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_li

4 : Job ID 3c4f40b0f902410b867cf9e10f0c42b5
test outcome: killed
linkedList5.py, start pos: (77, 26), end pos: (77, 28)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if curr_node.data != data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................F.. [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 3 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9 - as...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 85 passed in 0.10s =========================

5 : Job ID 9d6d9fedd99d413093647624bdbb5a01
test outcome: killed
linkedList5.py, start pos: (81, 35), end pos: (81, 37)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if curr_node.next.data != data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F............F...... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..................F....FF. [ 70%]
.F.F..                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert <li...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_18 - assert 1...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linked

6 : Job ID 44bec1689ba7475da4684e165293830b
test outcome: killed
linkedList5.py, start pos: (49, 30), end pos: (49, 32)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if curr_node.data < data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...FF............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................FF... [ 70%]
FF.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - TypeErro...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_22 - TypeErro...
FAIL

7 : Job ID 1b5669278aa7420580ef8ee9ec872d0e
test outcome: killed
linkedList5.py, start pos: (59, 26), end pos: (59, 28)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if self.head.data < data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ................FFFFF...... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F............F...FF [ 70%]
FFFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...FF..F..........F [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_16 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_18 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linked

9 : Job ID 73013543dc1740df8432eca9de8cde1a
test outcome: killed
linkedList5.py, start pos: (77, 26), end pos: (77, 28)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if curr_node.data < data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F.....FF..FFF. [ 30%]
.....F....                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .........F..F.....F.FFFFF. [ 70%]
.FFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F.FF......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_23 - TypeError...
FAILED MIO-MOSA-

10 : Job ID 7d0841aacd1d43879894bc1eaded1f41
test outcome: killed
linkedList5.py, start pos: (81, 35), end pos: (81, 37)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if curr_node.next.data < data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F......F....F. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..................F....FF. [ 70%]
.F.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_25 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedLis

11 : Job ID 627f344b15f54af3afcd6a19cb4b67ac
test outcome: killed
linkedList5.py, start pos: (49, 30), end pos: (49, 32)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if curr_node.data <= data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...FF............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................FF... [ 70%]
FF.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - TypeErro...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_22 - TypeErro...
F

12 : Job ID e874b966727f444493e7aed2d0973ad9
test outcome: killed
linkedList5.py, start pos: (59, 26), end pos: (59, 28)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if self.head.data <= data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ................F.FFF...... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F................FF [ 70%]
FFFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...FF..F..........F [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_16 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_18 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_0 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_lin

14 : Job ID 9408026078354427aae7ca8e89e09ad6
test outcome: killed
linkedList5.py, start pos: (77, 26), end pos: (77, 28)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if curr_node.data <= data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F.....FF..FFF. [ 30%]
.....F....                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .........F..F.....F.FFFFF. [ 70%]
.FFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F.FF......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_23 - TypeError...
FAILED MIO-MO

15 : Job ID b7697afe3d1d47e79953ba2605ced7ee
test outcome: killed
linkedList5.py, start pos: (81, 35), end pos: (81, 37)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if curr_node.next.data <= data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F......F....F. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..................F....FF. [ 70%]
.F.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ..........F......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_25 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedL

16 : Job ID 53b0b2d2586a4001a94674c56939eeb3
test outcome: killed
linkedList5.py, start pos: (49, 30), end pos: (49, 32)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if curr_node.data > data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...FF............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................FF... [ 70%]
FF.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - TypeErro...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_22 - TypeErro...
FAI

17 : Job ID 9f08be72d14043a1a198e8486d17a3a8
test outcome: killed
linkedList5.py, start pos: (59, 26), end pos: (59, 28)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if self.head.data > data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ................FFFFF...... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F............F...FF [ 70%]
FFFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...FF..F..........F [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_16 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_18 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linke

19 : Job ID eaa3ecef5423453f9ebc11849ef6476a
test outcome: killed
linkedList5.py, start pos: (77, 26), end pos: (77, 28)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if curr_node.data > data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F.....FF..FFF. [ 30%]
.....F....                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .........F..F.....F.FFFFF. [ 70%]
.FFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F.FF......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_23 - TypeError...
FAILED MIO-MOSA

20 : Job ID fda24eb0ae3b44b1be28ab0e576ba49d
test outcome: killed
linkedList5.py, start pos: (81, 35), end pos: (81, 37)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if curr_node.next.data > data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F......F....F. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..................F....FF. [ 70%]
.F.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_25 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedLis

21 : Job ID 16e19163956a4b459f184e73e6d5b974
test outcome: killed
linkedList5.py, start pos: (49, 30), end pos: (49, 32)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if curr_node.data >= data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...FF............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................FF... [ 70%]
FF.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - TypeErro...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_22 - TypeErro...
F

22 : Job ID abcc9d43b19b47c385b7069e6ead57f3
test outcome: killed
linkedList5.py, start pos: (59, 26), end pos: (59, 28)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if self.head.data >= data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ................F.FFF...... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F................FF [ 70%]
FFFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...FF..F..........F [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_16 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_18 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_0 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_lin

24 : Job ID 6d083cf6ef4142f4bb787438765ad133
test outcome: killed
linkedList5.py, start pos: (77, 26), end pos: (77, 28)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if curr_node.data >= data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F.....FF..FFF. [ 30%]
.....F....                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .........F..F.....F.FFFFF. [ 70%]
.FFFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F.FF......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_23 - TypeError...
FAILED MIO-MO
