25 : Job ID 06cb52714c8343f6b5903c16ae39e40b
test outcome: killed
linkedList5.py, start pos: (81, 35), end pos: (81, 37)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if curr_node.next.data >= data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F.....F......F....F. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..................F....FF. [ 70%]
.F.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ..........F......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - TypeError:...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_13 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_25 - TypeError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedL

26 : Job ID d25c3b09338141afa4471a9e64550df3
SURVIVED
test outcome: survived
linkedList5.py, start pos: (49, 30), end pos: (49, 32)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if curr_node.data is data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ................... [ 98%]
.                                                                        [100%]
============================== 89 passed in 0.10s ==============================

27 : Job ID bd491113cb22422da064ff63c5e08339
SURVIVED
test outcome: survived
linkedList5.py, start pos: (59, 26), end pos: (59, 28)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if self.head.data is data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ................... [ 98%]
.                                                                        [100%]
============================== 89 passed in 0.10s ==============================

29 : Job ID 65b06987fcd34145afb76f4a056c5cf7
SURVIVED
test outcome: survived
linkedList5.py, start pos: (77, 26), end pos: (77, 28)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if curr_node.data is data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ................... [ 98%]
.                                                                        [100%]
============================== 89 passed in 0.09s ==============================

30 : Job ID 7c57c945201347cd9f16c3378aa9ecd2
SURVIVED
test outcome: survived
linkedList5.py, start pos: (81, 35), end pos: (81, 37)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if curr_node.next.data is data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ................... [ 98%]
.                                                                        [100%]
============================== 89 passed in 0.10s ==============================

31 : Job ID 719b663cf3024fe8b2b357abe1798cf5
test outcome: killed
linkedList5.py, start pos: (49, 30), end pos: (49, 32)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if curr_node.data is not data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...F.............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................F.... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AssertionE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - assert <l...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - Assertio...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7 - As...
========================= 4 failed, 85 passed in 0.10s =====================

32 : Job ID 6e953084e8b2497d922033ea845ce7a5
test outcome: killed
linkedList5.py, start pos: (59, 26), end pos: (59, 28)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if self.head.data is not data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .................F.F....... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F............F...F. [ 70%]
FF.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...FF..F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert <l...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_0 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_5 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_7 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/te

34 : Job ID 6b14a54cbe094fe48dc2de74e726bbad
test outcome: killed
linkedList5.py, start pos: (77, 26), end pos: (77, 28)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if curr_node.data is not data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................F.. [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 3 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9 - as...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 85 passed in 0.10s =========================

35 : Job ID 1d348a8777a6451cb14847f10c00e70b
test outcome: killed
linkedList5.py, start pos: (81, 35), end pos: (81, 37)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if curr_node.next.data is not data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F............F...... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..................F....FF. [ 70%]
.F.F..                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert <li...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_18 - assert 1...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_l

36 : Job ID 0d07f35b9da34916b3f208c8e10b608b
test outcome: killed
linkedList5.py, start pos: (25, 16), end pos: (25, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -22,7 +22,7 @@
         return counter
     def insert_to_front(self, data):
-        if data is None:
+        if data is not None:
             return None
         node = Node(data, self.head)
         self.head = node
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py F...F.FFF...F....FFFF..F.F. [ 30%]
FF...F...F                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FF.FFF.F.F..F.....FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF....F.......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_cas

37 : Job ID bb700272cacf46bf9905f78d8edea3b3
test outcome: killed
linkedList5.py, start pos: (32, 16), end pos: (32, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -29,7 +29,7 @@
         return node
     def append(self, data):
-        if data is None:
+        if data is not None:
             return None
         node = Node(data)
         if self.head is None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FF...FFFF...FF..F.FFF...FF. [ 30%]
F.........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....F.FF.........F..FF.FF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF..F..FFF....F. [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - assert 1 ==

38 : Job ID 5bd7bb0c84bc4aa88db34629b72cccf1
test outcome: killed
linkedList5.py, start pos: (35, 21), end pos: (35, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -32,7 +32,7 @@
         if data is None:
             return None
         node = Node(data)
-        if self.head is None:
+        if self.head is not None:
             self.head = node
             return node
         curr_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FF...FFFF...FF..F.FFF...FF. [ 30%]
F.........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....F.F..........F..FF.FF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF..F..FF.....F. [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linke

39 : Job ID 2128e76fac744feb85a681c692122e21
test outcome: killed
linkedList5.py, start pos: (45, 16), end pos: (45, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -42,7 +42,7 @@
         return node
     def find(self, data):
-        if data is None:
+        if data is not None:
             return None
         curr_node = self.head
         while curr_node is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...F.............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................F.... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AssertionE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - Assertion...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - Assertio...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7 - As...
========================= 4 failed, 85 passed in 0.10s =========================

40 : Job ID a9f9b9a4eccf4bdba87e5374c792f633
test outcome: killed
linkedList5.py, start pos: (55, 16), end pos: (55, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -52,7 +52,7 @@
         return None
     def delete(self, data):
-        if data is None:
+        if data is not None:
             return
         if self.head is None:
             return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .................F.F....... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ....................F..... [ 70%]
....F.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...F...F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_20 - assert 1...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_30 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3 - as...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7 - as...
==========

41 : Job ID 82a967d5050c4b55b0f0d798642cf878
test outcome: killed
linkedList5.py, start pos: (57, 21), end pos: (57, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 5
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -54,7 +54,7 @@
     def delete(self, data):
         if data is None:
             return
-        if self.head is None:
+        if self.head is not None:
             return
         if self.head.data == data:
             self.head = self.head.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .F.............F.F.F......F [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..F......F.........FF..... [ 70%]
....F.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py F..F...F.....F..... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_15 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_26 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/tes

42 : Job ID dffac9a434b040608e4e7594f5bee917
test outcome: killed
linkedList5.py, start pos: (72, 16), end pos: (72, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 6
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -69,7 +69,7 @@
             curr_node = curr_node.next
     def delete_alt(self, data):
-        if data is None:
+        if data is not None:
             return
         if self.head is None:
             return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................F.. [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 3 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9 - as...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 85 passed in 0.11s =========================

44 : Job ID 408d650853774b51a76482301a2be4de
test outcome: killed
linkedList5.py, start pos: (19, 19), end pos: (19, 25)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -16,7 +16,7 @@
     def __len__(self):
         curr = self.head
         counter = 0
-        while curr is not None:
+        while curr is None:
             counter += 1
             curr = curr.next
         return counter
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FFFFFFFFFF.FFFFFFFFFFFFFFFF [ 30%]
FF.F.FFFFF                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FFFFFF.FFF.FFFFFF.FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py FFFFFFFFFFFF.F.FFFF [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_2 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_3 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::te

45 : Job ID 6d641c521e26488cb89eb21bc84067ec
test outcome: killed
linkedList5.py, start pos: (39, 29), end pos: (39, 35)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -36,7 +36,7 @@
             self.head = node
             return node
         curr_node = self.head
-        while curr_node.next is not None:
+        while curr_node.next is None:
             curr_node = curr_node.next
         curr_node.next = node
         return node
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py F.....FFF...FF....FFF....F. [ 30%]
F.........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......F..........F..F..FF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ..F....F..F......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - Attribute...
FAILED M

46 : Job ID 027a8eb70eb84a14887ea35f2726116d
test outcome: killed
linkedList5.py, start pos: (48, 24), end pos: (48, 30)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 2
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -45,7 +45,7 @@
         if data is None:
             return None
         curr_node = self.head
-        while curr_node is not None:
+        while curr_node is None:
             if curr_node.data == data:
                 return curr_node
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F..FF.......FF..... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ...F.................F.... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py F....F.F........... [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AssertionE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_11 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - Assertion...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_21 - Attribute...

47 : Job ID 655bf77e3968456dbf1443f61bcb4bde
test outcome: killed
linkedList5.py, start pos: (64, 24), end pos: (64, 30)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -61,7 +61,7 @@
             return
         prev_node = self.head
         curr_node = self.head.next
-        while curr_node is not None:
+        while curr_node is None:
             if curr_node.data == data:
                 prev_node.next = curr_node.next
                 return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ................F..F....... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F.................. [ 70%]
....F.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...F..............F [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_16 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_0 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_5 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_7 - Attribute

48 : Job ID 8d89cb0d2e74400d8c0da79192d9d9fb
test outcome: killed
linkedList5.py, start pos: (80, 29), end pos: (80, 35)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -77,7 +77,7 @@
         if curr_node.data == data:
             curr_node = curr_node.next
             return
-        while curr_node.next is not None:
+        while curr_node.next is None:
             if curr_node.next.data == data:
                 curr_node.next = curr_node.next.next
                 return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F...........F....F.. [ 30%]
.....F....                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .........F..........FFFFF. [ 70%]
..FFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F.FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 3 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_24 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_32 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOS
