51 : Job ID 3cf69a1056bc4a18ba6746d5cd9688a6
test outcome: killed
linkedList5.py, start pos: (19, 14), end pos: (19, 30)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -16,7 +16,7 @@
     def __len__(self):
         curr = self.head
         counter = 0
-        while curr is not None:
+        while not curr is not None:
             counter += 1
             curr = curr.next
         return counter
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FFFFFFFFFF.FFFFFFFFFFFFFFFF [ 30%]
FF.F.FFFFF                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FFFFFF.FFF.FFFFFF.FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py FFFFFFFFFFFF.F.FFFF [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_2 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_3 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - Attribut

52 : Job ID ade6c60e86e34375b7d8e05b8b433cea
test outcome: killed
linkedList5.py, start pos: (25, 11), end pos: (25, 23)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -22,7 +22,7 @@
         return counter
     def insert_to_front(self, data):
-        if data is None:
+        if not data is None:
             return None
         node = Node(data, self.head)
         self.head = node
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py F...F.FFF...F....FFFF..F.F. [ 30%]
FF...F...F                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FF.FFF.F.F..F.....FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF....F.......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - assert 0 ...
FAILED M

53 : Job ID 03e97ab9fc454aeeaa6b36c3d81ee8e7
test outcome: killed
linkedList5.py, start pos: (32, 11), end pos: (32, 23)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -29,7 +29,7 @@
         return node
     def append(self, data):
-        if data is None:
+        if not data is None:
             return None
         node = Node(data)
         if self.head is None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FF...FFFF...FF..F.FFF...FF. [ 30%]
F.........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....F.FF.........F..FF.FF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF..F..FFF....F. [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUIT

54 : Job ID 35d3de7f9f8b456c895cf5c67831fd97
test outcome: killed
linkedList5.py, start pos: (35, 11), end pos: (35, 28)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -32,7 +32,7 @@
         if data is None:
             return None
         node = Node(data)
-        if self.head is None:
+        if not self.head is None:
             self.head = node
             return node
         curr_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FF...FFFF...FF..F.FFF...FF. [ 30%]
F.........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....F.F..........F..FF.FF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF..F..FF.....F. [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 1 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 -

55 : Job ID e2e21f5b400e4fc2a91e0c3d3aebceb4
test outcome: killed
linkedList5.py, start pos: (39, 14), end pos: (39, 40)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -36,7 +36,7 @@
             self.head = node
             return node
         curr_node = self.head
-        while curr_node.next is not None:
+        while not curr_node.next is not None:
             curr_node = curr_node.next
         curr_node.next = node
         return node
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py F.....FFF...FF....FFF....F. [ 30%]
F.........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......F..........F..F..FF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ..F....F..F......F. [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/

56 : Job ID e7fe29e4eb5147e7b69038ba77d5cf58
test outcome: killed
linkedList5.py, start pos: (45, 11), end pos: (45, 23)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -42,7 +42,7 @@
         return node
     def find(self, data):
-        if data is None:
+        if not data is None:
             return None
         curr_node = self.head
         while curr_node is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...F.............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................F.... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AssertionE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - Assertion...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - Assertio...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7 - As...
========================= 4 failed, 85 passed in 0.10s =========================

57 : Job ID d09a1d1318ae4913a1cf57bcef208897
test outcome: killed
linkedList5.py, start pos: (48, 14), end pos: (48, 35)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -45,7 +45,7 @@
         if data is None:
             return None
         curr_node = self.head
-        while curr_node is not None:
+        while not curr_node is not None:
             if curr_node.data == data:
                 return curr_node
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F..FF.......FF..... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ...F.................F.... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py F....F.F........... [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AssertionE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_11 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - Assertion...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_21 - Attribute...
FAILED MIO-MOSA-WHOL

58 : Job ID 07f50432cd8d43c78690e04bc572273a
test outcome: killed
linkedList5.py, start pos: (49, 15), end pos: (49, 37)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -46,7 +46,7 @@
             return None
         curr_node = self.head
         while curr_node is not None:
-            if curr_node.data == data:
+            if not curr_node.data == data:
                 return curr_node
             curr_node = curr_node.next
         return None
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ........F...F.............. [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .....................F.... [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_8 - AssertionE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12 - assert <l...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_21 - Assertio...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7 - As...
========================= 4 failed, 85 passed in 0.10s =========================

59 : Job ID f3f08704b93f4a07931e3d5fcc4b1e0c
test outcome: killed
linkedList5.py, start pos: (55, 11), end pos: (55, 23)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -52,7 +52,7 @@
         return None
     def delete(self, data):
-        if data is None:
+        if not data is None:
             return
         if self.head is None:
             return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .................F.F....... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ....................F..... [ 70%]
....F.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...F...F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_20 - assert 1...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_30 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3 - as...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7 - as...
========================= 6 failed, 83

60 : Job ID f1ad716fce094b0cb080e6d4aff28b4b
test outcome: killed
linkedList5.py, start pos: (57, 11), end pos: (57, 28)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -54,7 +54,7 @@
     def delete(self, data):
         if data is None:
             return
-        if self.head is None:
+        if not self.head is None:
             return
         if self.head.data == data:
             self.head = self.head.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .F.............F.F.F......F [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..F......F.........FF..... [ 70%]
....F.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py F..F...F.....F..... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - AttributeE...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_15 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_26 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_

61 : Job ID 7b4c1779f6164b349f508c737629e425
test outcome: killed
linkedList5.py, start pos: (59, 11), end pos: (59, 33)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -56,7 +56,7 @@
             return
         if self.head is None:
             return
-        if self.head.data == data:
+        if not self.head.data == data:
             self.head = self.head.next
             return
         prev_node = self.head
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .................F.F....... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F............F...F. [ 70%]
FF.FF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...FF..F........... [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_17 - assert 1 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert <l...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_0 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_5 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_7 - assert 0 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::tes

62 : Job ID dfe68a2f98994192a51308621c1bfdbe
test outcome: killed
linkedList5.py, start pos: (64, 14), end pos: (64, 35)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -61,7 +61,7 @@
             return
         prev_node = self.head
         curr_node = self.head.next
-        while curr_node is not None:
+        while not curr_node is not None:
             if curr_node.data == data:
                 prev_node.next = curr_node.next
                 return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py ................F..F....... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py F....F.F.................. [ 70%]
....F.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py ...F..............F [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_16 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_0 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_5 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_7 - Attribute...
FAILED MIO-MOSA

64 : Job ID 5f53f969877c451d8b1c2ccdf7a2cff9
test outcome: killed
linkedList5.py, start pos: (72, 11), end pos: (72, 23)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -69,7 +69,7 @@
             curr_node = curr_node.next
     def delete_alt(self, data):
-        if data is None:
+        if not data is None:
             return
         if self.head is None:
             return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................F.. [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 3 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9 - as...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 85 passed in 0.10s =========================

66 : Job ID 679b2dbc422e4c3bbb3aca258fd01067
test outcome: killed
linkedList5.py, start pos: (77, 11), end pos: (77, 33)
operator: core/AddNot, occurrence: 15
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -74,7 +74,7 @@
         if self.head is None:
             return
         curr_node = self.head
-        if curr_node.data == data:
+        if not curr_node.data == data:
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F................... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .......................F.. [ 70%]
......                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 3 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9 - as...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 85 passed in 0.10s =========================

67 : Job ID 8fde87dcbbff461ea0db69a68dcaeddc
test outcome: killed
linkedList5.py, start pos: (80, 14), end pos: (80, 40)
operator: core/AddNot, occurrence: 16
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -77,7 +77,7 @@
         if curr_node.data == data:
             curr_node = curr_node.next
             return
-        while curr_node.next is not None:
+        while not curr_node.next is not None:
             if curr_node.next.data == data:
                 curr_node.next = curr_node.next.next
                 return
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F...........F....F.. [ 30%]
.....F....                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py .........F..........FFFFF. [ 70%]
..FFF.                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .......F.FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 3 == 2
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_19 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_24 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_32 - Attribute...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_9 -

68 : Job ID 924c7d4a3b824298aa9b540650ca43fe
test outcome: killed
linkedList5.py, start pos: (81, 15), end pos: (81, 42)
operator: core/AddNot, occurrence: 17
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -78,7 +78,7 @@
             curr_node = curr_node.next
             return
         while curr_node.next is not None:
-            if curr_node.next.data == data:
+            if not curr_node.next.data == data:
                 curr_node.next = curr_node.next.next
                 return
             curr_node = curr_node.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py .......F............F...... [ 30%]
..........                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py ..................F....FF. [ 70%]
.F.F..                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .........FF........ [ 98%]
.                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert <li...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_20 - assert 2 ...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_18 - assert 1...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_23 - assert 2...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_ca

71 : Job ID 32a137767d8148ad8f1f15fad6184b45
test outcome: killed
linkedList5.py, start pos: (18, 18), end pos: (18, 19)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -15,7 +15,7 @@
     def __len__(self):
         curr = self.head
-        counter = 0
+        counter = 1
         while curr is not None:
             counter += 1
             curr = curr.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FFFFFFFFFF.FFFFFFFFFFFFFFFF [ 30%]
FF.F.FFFFF                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FFFFFF.FFF.FFFFFF.FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py FFFFFFFFFFFF.F.FFFF [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 1 == 0
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - assert 1 == 0
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_2 - assert 1 == 0
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_3 - assert 1 == 0
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - assert 1 == 0
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - assert 1 == 0
FAILED MIO-MOSA-WHOLE_SUIT

72 : Job ID c8f5a8cbc94f4829969752beff07cd1e
test outcome: killed
linkedList5.py, start pos: (18, 18), end pos: (18, 19)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -15,7 +15,7 @@
     def __len__(self):
         curr = self.head
-        counter = 0
+        counter = -1
         while curr is not None:
             counter += 1
             curr = curr.next
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FFFFFFFFFF.FFFFFFFFFFFFFFFF [ 30%]
FF.F.FFFFF                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FFFFFF.FFF.FFFFFF.FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py FFFFFFFFFFFF.F.FFFF [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - ValueError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - ValueError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_2 - ValueError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_3 - ValueError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - ValueError...
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - ValueError...
FAILED MIO-MOSA-WHOLE_SUI

73 : Job ID 21c3d0f6762f401abeecd29285fa6931
test outcome: killed
linkedList5.py, start pos: (20, 23), end pos: (20, 24)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -17,7 +17,7 @@
         curr = self.head
         counter = 0
         while curr is not None:
-            counter += 1
+            counter += 2
             curr = curr.next
         return counter
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FF..FFFFF...FF..FFFFF..FFF. [ 30%]
FF...F...F                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FF.FFF.F.F..F.....FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF..F.FFF.....FF [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 2 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - assert 2 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - assert 2 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - assert 2 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 2 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 2 == 1
FAILED MIO-MOSA-WHOLE

74 : Job ID 93e07fdabbfb48ef98a4b1d7f2c95e2e
test outcome: killed
linkedList5.py, start pos: (20, 23), end pos: (20, 24)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- alinkedList5.py
+++ blinkedList5.py
@@ -17,7 +17,7 @@
         curr = self.head
         counter = 0
         while curr is not None:
-            counter += 1
+            counter += 0
             curr = curr.next
         return counter
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py FF..FFFFF...FF..FFFFF..FFF. [ 30%]
FF...F...F                                                               [ 41%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py FF.FFF.F.F..F.....FFFFFFFF [ 70%]
FFFFFF                                                                   [ 77%]
MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py .FFFF..F.FFF.....FF [ 98%]
F                                                                        [100%]
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_0 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_1 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_4 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_5 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_6 - assert 0 == 1
FAILED MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_7 - assert 0 == 1
FAILED MIO-MOSA-WHOLE
