   - [#   1] ASR linkedList5: 
--------------------------------------------------------------------------------
  16:     def __len__(self):
  17:         curr = self.head
  18:         counter = 0
  19:         while curr is not None:
- 20:             counter += 1
+ 20:             counter -= 1
  21:             curr = curr.next
  22:         return counter
  23:     
  24:     def insert_to_front(self, data):
--------------------------------------------------------------------------------
[0.08210 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 1
E       ValueError: __len__() should return >= 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:19: ValueError

   - [#   2] CDI linkedList5: 
--------------------------------------------------------------------------------
   1: class Node(object):
   2:     
-  3:     def __init__(self, data, next=None):
-  4:         self.next = next
-  5:         self.data = data
-  6:     
+  3:     @classmethod
+  4:     def __init__(self, data, next=None):
+  5:         self.next = next
+  6:         self.data = data
   7:     def __str__(self):
   8:         return self.data
   9: 
  10: 
--------------------------------------------------------------------------------
[5.00307 s] timeout

   - [#   3] CDI linkedList5: 
--------------------------------------------------------------------------------
   3:     def __init__(self, data, next=None):
   4:         self.next = next
   5:         self.data = data
   6:     
-  7:     def __str__(self):
-  8:         return self.data
-  9: 
+  7:     @classmethod
+  8:     def __str__(self):
+  9:         return self.data
  10: 
  11: class LinkedList(object):
  12:     
  13:     def __init__(self, head=None):
--------------------------------------------------------------------------------
[0.08588 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_4

def test_case_4():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(var_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.Node'
        var_2 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 3
        assert len(var_0.data) == 3
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_2.next).__mod

   - [#   4] CDI linkedList5: 
--------------------------------------------------------------------------------
   9: 
  10: 
  11: class LinkedList(object):
  12:     
- 13:     def __init__(self, head=None):
- 14:         self.head = head
- 15:     
+ 13:     @classmethod
+ 14:     def __init__(self, head=None):
+ 15:         self.head = head
  16:     def __len__(self):
  17:         curr = self.head
  18:         counter = 0
  19:         while curr is not None:
--------------------------------------------------------------------------------
[0.09159 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_15

def test_case_15():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        node_0 = module_0.Node(linked_list_0)
        assert len(node_0.data) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.print_list()
        linked_list_2 = module_0.LinkedList(linked_list_1)
>       assert len(linked_list_2.head) == 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:305: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c5f82b0>

>   ???
E   AttributeError: 'LinkedList' object has no attribute 'next'

linkedList5:21: AttributeError

   - [#   5] CDI linkedList5: 
--------------------------------------------------------------------------------
  12:     
  13:     def __init__(self, head=None):
  14:         self.head = head
  15:     
- 16:     def __len__(self):
- 17:         curr = self.head
- 18:         counter = 0
- 19:         while curr is not None:
- 20:             counter += 1
- 21:             curr = curr.next
- 22:         return counter
- 23:     
+ 16:     @classmethod
+ 17:     def __len__(self):
+ 18:         curr = self.head
+ 19:         counter = 0
+ 20:         while curr is not None:
+ 21:             counter += 1
+ 22:             curr = curr.next
+ 23:         return counter
  24:     def insert_to_front(self, data):
  25:         if data is None:
  26:             return None
  27:         node = Node(data, self.head)
--------------------------------------------------------------------------------
[0.08339 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
>       assert len(linked_list_0) == 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList5.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

linkedList5:18: AttributeError

   - [#   6] CDI linkedList5: 
--------------------------------------------------------------------------------
  20:             counter += 1
  21:             curr = curr.next
  22:         return counter
  23:     
- 24:     def insert_to_front(self, data):
- 25:         if data is None:
- 26:             return None
- 27:         node = Node(data, self.head)
- 28:         self.head = node
- 29:         return node
- 30:     
+ 24:     @classmethod
+ 25:     def insert_to_front(self, data):
+ 26:         if data is None:
+ 27:             return None
+ 28:         node = Node(data, self.head)
+ 29:         self.head = node
+ 30:         return node
  31:     def append(self, data):
  32:         if data is None:
  33:             return None
  34:         node = Node(data)
--------------------------------------------------------------------------------
[0.08441 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
>       var_1 = linked_list_0.insert_to_front(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList5.LinkedList'>
data = <linkedList5.LinkedList object at 0x7faf4c6834c0>

>   ???

   - [#   7] CDI linkedList5: 
--------------------------------------------------------------------------------
  27:         node = Node(data, self.head)
  28:         self.head = node
  29:         return node
  30:     
- 31:     def append(self, data):
- 32:         if data is None:
- 33:             return None
- 34:         node = Node(data)
- 35:         if self.head is None:
- 36:             self.head = node
- 37:             return node
- 38:         curr_node = self.head
- 39:         while curr_node.next is not None:
- 40:             curr_node = curr_node.next
- 41:         curr_node.next = node
- 42:         return node
- 43:     
+ 31:     @classmethod
+ 32:     def append(self, data):
+ 33:         if data is None:
+ 34:             return None
+ 35:         node = Node(data)
+ 36:         if self.head is None:
+ 37:             self.head = node
+ 38:             return node
+ 39:         curr_node = self.head
+ 40:         while curr_node.next is not None:
+ 41:             curr_node = curr_node.next
+ 42:         curr_node.next = node
+ 43:         return node
  44:     def find(self, data):
  45:         if data is None:
  46:             return None
  47:         curr_node = self.head
--------------------------------------------------------------------------------
[0.08435 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
>       var_0 = linked_list_0.append(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:18:

   - [#   8] CDI linkedList5: 
--------------------------------------------------------------------------------
  40:             curr_node = curr_node.next
  41:         curr_node.next = node
  42:         return node
  43:     
- 44:     def find(self, data):
- 45:         if data is None:
- 46:             return None
- 47:         curr_node = self.head
- 48:         while curr_node is not None:
- 49:             if curr_node.data == data:
- 50:                 return curr_node
- 51:             curr_node = curr_node.next
- 52:         return None
- 53:     
+ 44:     @classmethod
+ 45:     def find(self, data):
+ 46:         if data is None:
+ 47:             return None
+ 48:         curr_node = self.head
+ 49:         while curr_node is not None:
+ 50:             if curr_node.data == data:
+ 51:                 return curr_node
+ 52:             curr_node = curr_node.next
+ 53:         return None
  54:     def delete(self, data):
  55:         if data is None:
  56:             return
  57:         if self.head is None:
--------------------------------------------------------------------------------
[0.08314 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
>       var_1 = linked_list_0.find(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:11: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList5.LinkedList'>

   - [#   9] CDI linkedList5: 
--------------------------------------------------------------------------------
  50:                 return curr_node
  51:             curr_node = curr_node.next
  52:         return None
  53:     
- 54:     def delete(self, data):
- 55:         if data is None:
- 56:             return
- 57:         if self.head is None:
- 58:             return
- 59:         if self.head.data == data:
- 60:             self.head = self.head.next
- 61:             return
- 62:         prev_node = self.head
- 63:         curr_node = self.head.next
- 64:         while curr_node is not None:
- 65:             if curr_node.data == data:
- 66:                 prev_node.next = curr_node.next
- 67:                 return
- 68:             prev_node = curr_node
- 69:             curr_node = curr_node.next
- 70:     
+ 54:     @classmethod
+ 55:     def delete(self, data):
+ 56:         if data is None:
+ 57:             return
+ 58:         if self.head is None:
+ 59:             return
+ 60:         if self.head.data == data:
+ 61:             self.head = self.head.next
+ 62:             return
+ 63:         prev_node = self.head
+ 64:         curr_node = self.head.next
+ 65:         while curr_node is not None:
+ 66:             if curr_node.data == data:
+ 67:                 prev_node.next = curr_node.next
+ 68:                 return
+ 69:             prev_node = curr_node
+ 70:             curr_node = curr_node.next
  71:     def delete_alt(self, data):
  72:         if data is None:
  73:             return
  74:         if self.head is None:
--------------------------------------------------------------------------------

   - [#  10] CDI linkedList5: 
--------------------------------------------------------------------------------
  67:                 return
  68:             prev_node = curr_node
  69:             curr_node = curr_node.next
  70:     
- 71:     def delete_alt(self, data):
- 72:         if data is None:
- 73:             return
- 74:         if self.head is None:
- 75:             return
- 76:         curr_node = self.head
- 77:         if curr_node.data == data:
- 78:             curr_node = curr_node.next
- 79:             return
- 80:         while curr_node.next is not None:
- 81:             if curr_node.next.data == data:
- 82:                 curr_node.next = curr_node.next.next
- 83:                 return
- 84:             curr_node = curr_node.next
- 85:     
+ 71:     @classmethod
+ 72:     def delete_alt(self, data):
+ 73:         if data is None:
+ 74:             return
+ 75:         if self.head is None:
+ 76:             return
+ 77:         curr_node = self.head
+ 78:         if curr_node.data == data:
+ 79:             curr_node = curr_node.next
+ 80:             return
+ 81:         while curr_node.next is not None:
+ 82:             if curr_node.next.data == data:
+ 83:                 curr_node.next = curr_node.next.next
+ 84:                 return
+ 85:             curr_node = curr_node.next
  86:     def print_list(self):
  87:         curr_node = self.head
  88:         while curr_node is not None:
  89:             print(curr_node.data)
--------------------------------------------------------------------------------
[0.08846 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()

   - [#  11] CDI linkedList5: 
--------------------------------------------------------------------------------
  82:                 curr_node.next = curr_node.next.next
  83:                 return
  84:             curr_node = curr_node.next
  85:     
- 86:     def print_list(self):
- 87:         curr_node = self.head
- 88:         while curr_node is not None:
- 89:             print(curr_node.data)
- 90:             curr_node = curr_node.next
- 91:     
+ 86:     @classmethod
+ 87:     def print_list(self):
+ 88:         curr_node = self.head
+ 89:         while curr_node is not None:
+ 90:             print(curr_node.data)
+ 91:             curr_node = curr_node.next
  92:     def get_all_data(self):
  93:         data = []
  94:         curr_node = self.head
  95:         while curr_node is not None:
--------------------------------------------------------------------------------
[0.08639 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f

   - [#  12] CDI linkedList5: 
--------------------------------------------------------------------------------
  88:         while curr_node is not None:
  89:             print(curr_node.data)
  90:             curr_node = curr_node.next
  91:     
- 92:     def get_all_data(self):
- 93:         data = []
- 94:         curr_node = self.head
- 95:         while curr_node is not None:
- 96:             data.append(curr_node.data)
- 97:             curr_node = curr_node.next
- 98:         return data
+ 92:     @classmethod
+ 93:     def get_all_data(self):
+ 94:         data = []
+ 95:         curr_node = self.head
+ 96:         while curr_node is not None:
+ 97:             data.append(curr_node.data)
+ 98:             curr_node = curr_node.next
+ 99:         return data
--------------------------------------------------------------------------------
[0.08346 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
>       var_0 = linked_list_1.get_all_data()

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'linkedList5.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

linkedList5:95: AttributeError

   - [#  13] COI linkedList5: 
--------------------------------------------------------------------------------
  15:     
  16:     def __len__(self):
  17:         curr = self.head
  18:         counter = 0
- 19:         while curr is not None:
+ 19:         while not (curr is not None):
  20:             counter += 1
  21:             curr = curr.next
  22:         return counter
  23:     
--------------------------------------------------------------------------------
[0.08358 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
>       assert len(linked_list_0) == 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c6ba2c0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList5:21: AttributeError

   - [#  14] COI linkedList5: 
--------------------------------------------------------------------------------
  21:             curr = curr.next
  22:         return counter
  23:     
  24:     def insert_to_front(self, data):
- 25:         if data is None:
+ 25:         if not (data is None):
  26:             return None
  27:         node = Node(data, self.head)
  28:         self.head = node
  29:         return node
--------------------------------------------------------------------------------
[0.08386 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
>       assert len(linked_list_0) == 2
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:25: AssertionError

   - [#  15] COI linkedList5: 
--------------------------------------------------------------------------------
  28:         self.head = node
  29:         return node
  30:     
  31:     def append(self, data):
- 32:         if data is None:
+ 32:         if not (data is None):
  33:             return None
  34:         node = Node(data)
  35:         if self.head is None:
  36:             self.head = node
--------------------------------------------------------------------------------
[0.08478 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:19: AssertionError

   - [#  16] COI linkedList5: 
--------------------------------------------------------------------------------
  31:     def append(self, data):
  32:         if data is None:
  33:             return None
  34:         node = Node(data)
- 35:         if self.head is None:
+ 35:         if not (self.head is None):
  36:             self.head = node
  37:             return node
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
--------------------------------------------------------------------------------
[0.08420 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
>       var_0 = linked_list_0.append(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c438fa0>
data = <linkedList5.LinkedList object at 0x7faf4c438fa0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList5:39: AttributeError

   - [#  17] COI linkedList5: 
--------------------------------------------------------------------------------
  35:         if self.head is None:
  36:             self.head = node
  37:             return node
  38:         curr_node = self.head
- 39:         while curr_node.next is not None:
+ 39:         while not (curr_node.next is not None):
  40:             curr_node = curr_node.next
  41:         curr_node.next = node
  42:         return node
  43:     
--------------------------------------------------------------------------------
[0.08496 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_2

def test_case_2():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
        var_2 = linked_list_0.print_list()
        var_3 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 3
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:51: Asserti

   - [#  18] COI linkedList5: 
--------------------------------------------------------------------------------
  41:         curr_node.next = node
  42:         return node
  43:     
  44:     def find(self, data):
- 45:         if data is None:
+ 45:         if not (data is None):
  46:             return None
  47:         curr_node = self.head
  48:         while curr_node is not None:
  49:             if curr_node.data == data:
--------------------------------------------------------------------------------
[0.08673 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:148: AssertionError

   - [#  19] COI linkedList5: 
--------------------------------------------------------------------------------
  44:     def find(self, data):
  45:         if data is None:
  46:             return None
  47:         curr_node = self.head
- 48:         while curr_node is not None:
+ 48:         while not (curr_node is not None):
  49:             if curr_node.data == data:
  50:                 return curr_node
  51:             curr_node = curr_node.next
  52:         return None
--------------------------------------------------------------------------------
[0.09969 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
>       var_1 = linked_list_0.find(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:11: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c4696f0>
data = <linkedList5.LinkedList object at 0x7faf4c4696f0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

linkedList5:49: AttributeError

   - [#  20] COI linkedList5: 
--------------------------------------------------------------------------------
  45:         if data is None:
  46:             return None
  47:         curr_node = self.head
  48:         while curr_node is not None:
- 49:             if curr_node.data == data:
+ 49:             if not (curr_node.data == data):
  50:                 return curr_node
  51:             curr_node = curr_node.next
  52:         return None
  53:     
--------------------------------------------------------------------------------
[0.08675 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:148: AssertionError

   - [#  21] COI linkedList5: 
--------------------------------------------------------------------------------
  51:             curr_node = curr_node.next
  52:         return None
  53:     
  54:     def delete(self, data):
- 55:         if data is None:
+ 55:         if not (data is None):
  56:             return
  57:         if self.head is None:
  58:             return
  59:         if self.head.data == data:
--------------------------------------------------------------------------------
[0.08498 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
        var_2 = linked_list_0.delete(linked_list_0)
>       assert len(linked_list_0) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:88: AssertionError
