   - [#  22] COI linkedList5: 
--------------------------------------------------------------------------------
  53:     
  54:     def delete(self, data):
  55:         if data is None:
  56:             return
- 57:         if self.head is None:
+ 57:         if not (self.head is None):
  58:             return
  59:         if self.head.data == data:
  60:             self.head = self.head.next
  61:             return
--------------------------------------------------------------------------------
[0.08616 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
        var_1 = linked_list_0.find(linked_list_0)
>       var_2 = linked_list_0.delete(var_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c9169e0>, data = []

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

linkedList5:59: AttributeError

   - [#  23] COI linkedList5: 
--------------------------------------------------------------------------------
  55:         if data is None:
  56:             return
  57:         if self.head is None:
  58:             return
- 59:         if self.head.data == data:
+ 59:         if not (self.head.data == data):
  60:             self.head = self.head.next
  61:             return
  62:         prev_node = self.head
  63:         curr_node = self.head.next
--------------------------------------------------------------------------------
[0.08950 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
        var_2 = linked_list_0.delete(linked_list_0)
        assert len(linked_list_0) == 1
        assert len(var_0.data) == 1
>       assert var_1.next is None
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:90: AssertionError

   - [#  24] COI linkedList5: 
--------------------------------------------------------------------------------
  60:             self.head = self.head.next
  61:             return
  62:         prev_node = self.head
  63:         curr_node = self.head.next
- 64:         while curr_node is not None:
+ 64:         while not (curr_node is not None):
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
  67:                 return
  68:             prev_node = curr_node
--------------------------------------------------------------------------------
[0.08703 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
        var_2 = linked_list_0.delete(linked_list_0)
>       assert len(linked_list_0) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:88: AssertionError

   - [#  26] COI linkedList5: 
--------------------------------------------------------------------------------
  68:             prev_node = curr_node
  69:             curr_node = curr_node.next
  70:     
  71:     def delete_alt(self, data):
- 72:         if data is None:
+ 72:         if not (data is None):
  73:             return
  74:         if self.head is None:
  75:             return
  76:         curr_node = self.head
--------------------------------------------------------------------------------
[0.08921 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9

def test_case_9():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        int_0 = -3730
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.insert_to_front(int_0)
        assert len(linked_list_1) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert var_0.data == -3730
        var_1 = linked_list_1.insert_to_front(linked_list_0)
        assert len(linked_list_1) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 0
        var_2 = linked_list_1.delete_alt(int_0)
>       assert len(linked_list_1) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:206: AssertionError

   - [#  28] COI linkedList5: 
--------------------------------------------------------------------------------
  73:             return
  74:         if self.head is None:
  75:             return
  76:         curr_node = self.head
- 77:         if curr_node.data == data:
+ 77:         if not (curr_node.data == data):
  78:             curr_node = curr_node.next
  79:             return
  80:         while curr_node.next is not None:
  81:             if curr_node.next.data == data:
--------------------------------------------------------------------------------
[0.08998 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9

def test_case_9():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        int_0 = -3730
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.insert_to_front(int_0)
        assert len(linked_list_1) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert var_0.data == -3730
        var_1 = linked_list_1.insert_to_front(linked_list_0)
        assert len(linked_list_1) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 0
        var_2 = linked_list_1.delete_alt(int_0)
>       assert len(linked_list_1) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:206: AssertionError

   - [#  29] COI linkedList5: 
--------------------------------------------------------------------------------
  76:         curr_node = self.head
  77:         if curr_node.data == data:
  78:             curr_node = curr_node.next
  79:             return
- 80:         while curr_node.next is not None:
+ 80:         while not (curr_node.next is not None):
  81:             if curr_node.next.data == data:
  82:                 curr_node.next = curr_node.next.next
  83:                 return
  84:             curr_node = curr_node.next
--------------------------------------------------------------------------------
[0.10519 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert var_1.next is None
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 1
        set_0 = {var_0, var_1, linked_list_0}
        var_2 = linked_list_0.append(set_0)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert f'{type(var_1.next)

   - [#  30] COI linkedList5: 
--------------------------------------------------------------------------------
  77:         if curr_node.data == data:
  78:             curr_node = curr_node.next
  79:             return
  80:         while curr_node.next is not None:
- 81:             if curr_node.next.data == data:
+ 81:             if not (curr_node.next.data == data):
  82:                 curr_node.next = curr_node.next.next
  83:                 return
  84:             curr_node = curr_node.next
  85:     
--------------------------------------------------------------------------------
[0.08811 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9

def test_case_9():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        int_0 = -3730
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.insert_to_front(int_0)
        assert len(linked_list_1) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert var_0.data == -3730
        var_1 = linked_list_1.insert_to_front(linked_list_0)
        assert len(linked_list_1) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 0
        var_2 = linked_list_1.delete_alt(int_0)
>       assert len(linked_list_1) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:206: AssertionError

   - [#  35] OIL linkedList5: 
--------------------------------------------------------------------------------
  18:         counter = 0
  19:         while curr is not None:
  20:             counter += 1
  21:             curr = curr.next
- 22:         return counter
- 23:     
+ 22:             break
+ 23:         return counter
  24:     def insert_to_front(self, data):
  25:         if data is None:
  26:             return None
  27:         node = Node(data, self.head)
--------------------------------------------------------------------------------
[0.08231 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
>       assert len(linked_list_0) == 2
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:25: AssertionError

   - [#  36] OIL linkedList5: 
--------------------------------------------------------------------------------
  37:             return node
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
  40:             curr_node = curr_node.next
- 41:         curr_node.next = node
- 42:         return node
- 43:     
+ 41:             break
+ 42:         curr_node.next = node
+ 43:         return node
  44:     def find(self, data):
  45:         if data is None:
  46:             return None
  47:         curr_node = self.head
--------------------------------------------------------------------------------
[0.08481 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_2

def test_case_2():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
        var_2 = linked_list_0.print_list()
        var_3 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) ==

   - [#  37] OIL linkedList5: 
--------------------------------------------------------------------------------
  48:         while curr_node is not None:
  49:             if curr_node.data == data:
  50:                 return curr_node
  51:             curr_node = curr_node.next
- 52:         return None
- 53:     
+ 52:             break
+ 53:         return None
  54:     def delete(self, data):
  55:         if data is None:
  56:             return
  57:         if self.head is None:
--------------------------------------------------------------------------------
[0.12188 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py::test_case_12

def test_case_12():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.append(var_0)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert var_1.next is None
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.Node'
        var_2 = linked_list_0.find(var_0)
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'linkedList5.Node'
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_MIO.py:191: Assertio

   - [#  38] OIL linkedList5: 
--------------------------------------------------------------------------------
  66:                 prev_node.next = curr_node.next
  67:                 return
  68:             prev_node = curr_node
  69:             curr_node = curr_node.next
- 70:     
+ 70:             break
  71:     def delete_alt(self, data):
  72:         if data is None:
  73:             return
  74:         if self.head is None:
--------------------------------------------------------------------------------
[0.10463 s] survived

   - [#  41] OIL linkedList5: 
--------------------------------------------------------------------------------
  94:         curr_node = self.head
  95:         while curr_node is not None:
  96:             data.append(curr_node.data)
  97:             curr_node = curr_node.next
- 98:         return data
+ 98:             break
+ 99:         return data
--------------------------------------------------------------------------------
[0.12119 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_29

def test_case_29():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = var_0.__str__()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1) == 1
        var_2 = linked_list_0.__len__()
        assert var_2 == 1
        var_3 = linked_list_0.append(var_2)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert len(var_1) == 2
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'linkedList5.Node'
        assert var_3.next is None
        assert var_3.data == 1
        var_4 = linked_list_0.get_all_data()
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_5 = linked_list_1.insert_

   - [#  58] SDL linkedList5: 
--------------------------------------------------------------------------------
   1: class Node(object):
   2:     
   3:     def __init__(self, data, next=None):
-  4:         self.next = next
+  4:         pass
   5:         self.data = data
   6:     
   7:     def __str__(self):
   8:         return self.data
--------------------------------------------------------------------------------
[0.10123 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 1

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c3e1b40>

>   ???
E   AttributeError: 'Node' object has no attribute 'next'

linkedList5:21: AttributeError

   - [#  59] SDL linkedList5: 
--------------------------------------------------------------------------------
   1: class Node(object):
   2:     
   3:     def __init__(self, data, next=None):
   4:         self.next = next
-  5:         self.data = data
+  5:         pass
   6:     
   7:     def __str__(self):
   8:         return self.data
   9: 
--------------------------------------------------------------------------------
[0.10032 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
>       assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
E       AttributeError: 'Node' object has no attribute 'data'

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:22: AttributeError

   - [#  60] SDL linkedList5: 
--------------------------------------------------------------------------------
   4:         self.next = next
   5:         self.data = data
   6:     
   7:     def __str__(self):
-  8:         return self.data
+  8:         pass
   9: 
  10: 
  11: class LinkedList(object):
  12:     
--------------------------------------------------------------------------------
[0.08632 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_4

def test_case_4():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(var_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.Node'
        var_2 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 3
        assert len(var_0.data) == 3
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_2.next).__module__}.{type(var_2.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_2.data).__module__}.{type(var_2.data).__qualname__}' == 'linked

   - [#  61] SDL linkedList5: 
--------------------------------------------------------------------------------
  10: 
  11: class LinkedList(object):
  12:     
  13:     def __init__(self, head=None):
- 14:         self.head = head
+ 14:         pass
  15:     
  16:     def __len__(self):
  17:         curr = self.head
  18:         counter = 0
--------------------------------------------------------------------------------
[0.08379 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
>       assert len(linked_list_0) == 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c7ea590>

>   ???
E   AttributeError: 'LinkedList' object has no attribute 'head'

linkedList5:17: AttributeError

   - [#  62] SDL linkedList5: 
--------------------------------------------------------------------------------
  13:     def __init__(self, head=None):
  14:         self.head = head
  15:     
  16:     def __len__(self):
- 17:         curr = self.head
+ 17:         pass
  18:         counter = 0
  19:         while curr is not None:
  20:             counter += 1
  21:             curr = curr.next
--------------------------------------------------------------------------------
[0.08351 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
>       assert len(linked_list_0) == 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c4643d0>

>   ???
E   UnboundLocalError: local variable 'curr' referenced before assignment

linkedList5:19: UnboundLocalError

   - [#  63] SDL linkedList5: 
--------------------------------------------------------------------------------
  14:         self.head = head
  15:     
  16:     def __len__(self):
  17:         curr = self.head
- 18:         counter = 0
+ 18:         pass
  19:         while curr is not None:
  20:             counter += 1
  21:             curr = curr.next
  22:         return counter
--------------------------------------------------------------------------------
[0.08372 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
>       assert len(linked_list_0) == 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c783610>

>   ???
E   UnboundLocalError: local variable 'counter' referenced before assignment

linkedList5:22: UnboundLocalError

   - [#  64] SDL linkedList5: 
--------------------------------------------------------------------------------
  17:         curr = self.head
  18:         counter = 0
  19:         while curr is not None:
  20:             counter += 1
- 21:             curr = curr.next
+ 21:             pass
  22:         return counter
  23:     
  24:     def insert_to_front(self, data):
  25:         if data is None:
--------------------------------------------------------------------------------
[5.00288 s] timeout

   - [#  66] SDL linkedList5: 
--------------------------------------------------------------------------------
  22:         return counter
  23:     
  24:     def insert_to_front(self, data):
  25:         if data is None:
- 26:             return None
+ 26:             pass
  27:         node = Node(data, self.head)
  28:         self.head = node
  29:         return node
  30:     
--------------------------------------------------------------------------------
[0.10419 s] survived

   - [#  67] SDL linkedList5: 
--------------------------------------------------------------------------------
  23:     
  24:     def insert_to_front(self, data):
  25:         if data is None:
  26:             return None
- 27:         node = Node(data, self.head)
+ 27:         pass
  28:         self.head = node
  29:         return node
  30:     
  31:     def append(self, data):
--------------------------------------------------------------------------------
[0.08516 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
>       var_1 = linked_list_0.insert_to_front(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c681540>
data = <linkedList5.LinkedList object at 0x7faf4c681540>

>   ???
E   NameError: name 'node' is not defined

linkedList5:28: NameError

   - [#  68] SDL linkedList5: 
--------------------------------------------------------------------------------
  24:     def insert_to_front(self, data):
  25:         if data is None:
  26:             return None
  27:         node = Node(data, self.head)
- 28:         self.head = node
+ 28:         pass
  29:         return node
  30:     
  31:     def append(self, data):
  32:         if data is None:
--------------------------------------------------------------------------------
[0.08440 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
>       assert len(linked_list_0) == 2
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:25: AssertionError
