   - [#  69] SDL linkedList5: 
--------------------------------------------------------------------------------
  25:         if data is None:
  26:             return None
  27:         node = Node(data, self.head)
  28:         self.head = node
- 29:         return node
+ 29:         pass
  30:     
  31:     def append(self, data):
  32:         if data is None:
  33:             return None
--------------------------------------------------------------------------------
[0.09950 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:27: AssertionError

   - [#  71] SDL linkedList5: 
--------------------------------------------------------------------------------
  30:     
  31:     def append(self, data):
  32:         if data is None:
  33:             return None
- 34:         node = Node(data)
+ 34:         pass
  35:         if self.head is None:
  36:             self.head = node
  37:             return node
  38:         curr_node = self.head
--------------------------------------------------------------------------------
[0.08458 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
>       var_0 = linked_list_0.append(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c43b2b0>
data = <linkedList5.LinkedList object at 0x7faf4c43b2b0>

>   ???
E   NameError: name 'node' is not defined

linkedList5:36: NameError

   - [#  72] SDL linkedList5: 
--------------------------------------------------------------------------------
  32:         if data is None:
  33:             return None
  34:         node = Node(data)
  35:         if self.head is None:
- 36:             self.head = node
+ 36:             pass
  37:             return node
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
  40:             curr_node = curr_node.next
--------------------------------------------------------------------------------
[0.08502 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:19: AssertionError

   - [#  74] SDL linkedList5: 
--------------------------------------------------------------------------------
  34:         node = Node(data)
  35:         if self.head is None:
  36:             self.head = node
  37:             return node
- 38:         curr_node = self.head
+ 38:         pass
  39:         while curr_node.next is not None:
  40:             curr_node = curr_node.next
  41:         curr_node.next = node
  42:         return node
--------------------------------------------------------------------------------
[0.08709 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_2

def test_case_2():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
        var_2 = linked_list_0.print_list()
>       var_3 = linked_list_0.append(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [#  75] SDL linkedList5: 
--------------------------------------------------------------------------------
  36:             self.head = node
  37:             return node
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
- 40:             curr_node = curr_node.next
+ 40:             pass
  41:         curr_node.next = node
  42:         return node
  43:     
  44:     def find(self, data):
--------------------------------------------------------------------------------
[5.00639 s] timeout

   - [#  76] SDL linkedList5: 
--------------------------------------------------------------------------------
  37:             return node
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
  40:             curr_node = curr_node.next
- 41:         curr_node.next = node
+ 41:         pass
  42:         return node
  43:     
  44:     def find(self, data):
  45:         if data is None:
--------------------------------------------------------------------------------
[0.08570 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_2

def test_case_2():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
        var_2 = linked_list_0.print_list()
        var_3 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 3
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:51: AssertionError

   - [#  77] SDL linkedList5: 
--------------------------------------------------------------------------------
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
  40:             curr_node = curr_node.next
  41:         curr_node.next = node
- 42:         return node
+ 42:         pass
  43:     
  44:     def find(self, data):
  45:         if data is None:
  46:             return None
--------------------------------------------------------------------------------
[0.08548 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_2

def test_case_2():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
        var_2 = linked_list_0.print_list()
        var_3 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 3
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data

   - [#  79] SDL linkedList5: 
--------------------------------------------------------------------------------
  43:     
  44:     def find(self, data):
  45:         if data is None:
  46:             return None
- 47:         curr_node = self.head
+ 47:         pass
  48:         while curr_node is not None:
  49:             if curr_node.data == data:
  50:                 return curr_node
  51:             curr_node = curr_node.next
--------------------------------------------------------------------------------
[0.08360 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
>       var_1 = linked_list_0.find(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:11: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c4ae830>
data = <linkedList5.LinkedList object at 0x7faf4c4ae830>

>   ???
E   UnboundLocalError: local variable 'curr_node' referenced before assignment

linkedList5:48: UnboundLocalError

   - [#  80] SDL linkedList5: 
--------------------------------------------------------------------------------
  46:             return None
  47:         curr_node = self.head
  48:         while curr_node is not None:
  49:             if curr_node.data == data:
- 50:                 return curr_node
+ 50:                 pass
  51:             curr_node = curr_node.next
  52:         return None
  53:     
  54:     def delete(self, data):
--------------------------------------------------------------------------------
[0.10281 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:148: AssertionError

   - [#  81] SDL linkedList5: 
--------------------------------------------------------------------------------
  47:         curr_node = self.head
  48:         while curr_node is not None:
  49:             if curr_node.data == data:
  50:                 return curr_node
- 51:             curr_node = curr_node.next
+ 51:             pass
  52:         return None
  53:     
  54:     def delete(self, data):
  55:         if data is None:
--------------------------------------------------------------------------------
[5.00637 s] timeout

   - [#  82] SDL linkedList5: 
--------------------------------------------------------------------------------
  48:         while curr_node is not None:
  49:             if curr_node.data == data:
  50:                 return curr_node
  51:             curr_node = curr_node.next
- 52:         return None
+ 52:         pass
  53:     
  54:     def delete(self, data):
  55:         if data is None:
  56:             return
--------------------------------------------------------------------------------
[0.10208 s] survived

   - [#  83] SDL linkedList5: 
--------------------------------------------------------------------------------
  52:         return None
  53:     
  54:     def delete(self, data):
  55:         if data is None:
- 56:             return
+ 56:             pass
  57:         if self.head is None:
  58:             return
  59:         if self.head.data == data:
  60:             self.head = self.head.next
--------------------------------------------------------------------------------
[0.10364 s] survived

   - [#  84] SDL linkedList5: 
--------------------------------------------------------------------------------
  54:     def delete(self, data):
  55:         if data is None:
  56:             return
  57:         if self.head is None:
- 58:             return
+ 58:             pass
  59:         if self.head.data == data:
  60:             self.head = self.head.next
  61:             return
  62:         prev_node = self.head
--------------------------------------------------------------------------------
[0.08386 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
        var_1 = linked_list_0.find(linked_list_0)
>       var_2 = linked_list_0.delete(var_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c6812a0>, data = []

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

linkedList5:59: AttributeError

   - [#  85] SDL linkedList5: 
--------------------------------------------------------------------------------
  56:             return
  57:         if self.head is None:
  58:             return
  59:         if self.head.data == data:
- 60:             self.head = self.head.next
+ 60:             pass
  61:             return
  62:         prev_node = self.head
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
--------------------------------------------------------------------------------
[0.08856 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert var_1.next is None
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 1
        set_0 = {var_0, var_1, linked_list_0}
        var_2 = linked_list_0.append(set_0)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_1

   - [#  86] SDL linkedList5: 
--------------------------------------------------------------------------------
  57:         if self.head is None:
  58:             return
  59:         if self.head.data == data:
  60:             self.head = self.head.next
- 61:             return
+ 61:             pass
  62:         prev_node = self.head
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
--------------------------------------------------------------------------------
[0.11521 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_20

def test_case_20():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.get_all_data()
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_1 = linked_list_1.insert_to_front(var_0)
        assert len(linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert var_1.next is None
        assert var_1.data == []
        var_2 = linked_list_0.insert_to_front(var_1)
        assert len(linked_list_0) == 1
        assert f'{type(var_2.data).__module__}.{type(var_2.data).__qualname__}' == 'linkedList5.Node'
        var_3 = linked_list_0.delete_alt(var_0)
>       var_4 = linked_list_1.delete(var_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py:340: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c3841f0>, data = []

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList5:63: AttributeError

   - [#  87] SDL linkedList5: 
--------------------------------------------------------------------------------
  58:             return
  59:         if self.head.data == data:
  60:             self.head = self.head.next
  61:             return
- 62:         prev_node = self.head
+ 62:         pass
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
--------------------------------------------------------------------------------
[0.08675 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
>       var_2 = linked_list_0.delete(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:87: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c84aaa0>
data =

   - [#  88] SDL linkedList5: 
--------------------------------------------------------------------------------
  59:         if self.head.data == data:
  60:             self.head = self.head.next
  61:             return
  62:         prev_node = self.head
- 63:         curr_node = self.head.next
+ 63:         pass
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
  67:                 return
--------------------------------------------------------------------------------
[0.08609 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
>       var_2 = linked_list_0.delete(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:87: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c6b97b0>
dat

   - [#  89] SDL linkedList5: 
--------------------------------------------------------------------------------
  62:         prev_node = self.head
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
- 66:                 prev_node.next = curr_node.next
+ 66:                 pass
  67:                 return
  68:             prev_node = curr_node
  69:             curr_node = curr_node.next
  70:     
--------------------------------------------------------------------------------
[0.08622 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
        var_2 = linked_list_0.delete(linked_list_0)
>       assert len(linked_list_0) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:88: AssertionError

   - [#  90] SDL linkedList5: 
--------------------------------------------------------------------------------
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
- 67:                 return
+ 67:                 pass
  68:             prev_node = curr_node
  69:             curr_node = curr_node.next
  70:     
  71:     def delete_alt(self, data):
--------------------------------------------------------------------------------
[0.10359 s] survived

   - [#  91] SDL linkedList5: 
--------------------------------------------------------------------------------
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
  67:                 return
- 68:             prev_node = curr_node
+ 68:             pass
  69:             curr_node = curr_node.next
  70:     
  71:     def delete_alt(self, data):
  72:         if data is None:
--------------------------------------------------------------------------------
[0.10406 s] survived

   - [#  92] SDL linkedList5: 
--------------------------------------------------------------------------------
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
  67:                 return
  68:             prev_node = curr_node
- 69:             curr_node = curr_node.next
+ 69:             pass
  70:     
  71:     def delete_alt(self, data):
  72:         if data is None:
  73:             return
--------------------------------------------------------------------------------
[5.00636 s] timeout

   - [#  95] SDL linkedList5: 
--------------------------------------------------------------------------------
  72:         if data is None:
  73:             return
  74:         if self.head is None:
  75:             return
- 76:         curr_node = self.head
+ 76:         pass
  77:         if curr_node.data == data:
  78:             curr_node = curr_node.next
  79:             return
  80:         while curr_node.next is not None:
--------------------------------------------------------------------------------
[0.08710 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert var_1.next is None
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 1
        set_0 = {var_0, var_1, linked_list_0}
        var_2 = linked_list_0.append(set_0)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_1.data) ==

   - [#  96] SDL linkedList5: 
--------------------------------------------------------------------------------
  74:         if self.head is None:
  75:             return
  76:         curr_node = self.head
  77:         if curr_node.data == data:
- 78:             curr_node = curr_node.next
+ 78:             pass
  79:             return
  80:         while curr_node.next is not None:
  81:             if curr_node.next.data == data:
  82:                 curr_node.next = curr_node.next.next
--------------------------------------------------------------------------------
[0.10273 s] survived

   - [#  97] SDL linkedList5: 
--------------------------------------------------------------------------------
  75:             return
  76:         curr_node = self.head
  77:         if curr_node.data == data:
  78:             curr_node = curr_node.next
- 79:             return
+ 79:             pass
  80:         while curr_node.next is not None:
  81:             if curr_node.next.data == data:
  82:                 curr_node.next = curr_node.next.next
  83:                 return
--------------------------------------------------------------------------------
[0.11086 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_12

def test_case_12():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
>       var_1 = linked_list_0.delete_alt(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py:219: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c387430>
data = <linkedList5.LinkedList object at 0x7faf4c387430>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linkedList5:80: AttributeError
