   - [#  98] SDL linkedList5: 
--------------------------------------------------------------------------------
  78:             curr_node = curr_node.next
  79:             return
  80:         while curr_node.next is not None:
  81:             if curr_node.next.data == data:
- 82:                 curr_node.next = curr_node.next.next
+ 82:                 pass
  83:                 return
  84:             curr_node = curr_node.next
  85:     
  86:     def print_list(self):
--------------------------------------------------------------------------------
[0.08796 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9

def test_case_9():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        int_0 = -3730
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.insert_to_front(int_0)
        assert len(linked_list_1) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert var_0.data == -3730
        var_1 = linked_list_1.insert_to_front(linked_list_0)
        assert len(linked_list_1) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 0
        var_2 = linked_list_1.delete_alt(int_0)
>       assert len(linked_list_1) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:206: AssertionError

   - [#  99] SDL linkedList5: 
--------------------------------------------------------------------------------
  79:             return
  80:         while curr_node.next is not None:
  81:             if curr_node.next.data == data:
  82:                 curr_node.next = curr_node.next.next
- 83:                 return
+ 83:                 pass
  84:             curr_node = curr_node.next
  85:     
  86:     def print_list(self):
  87:         curr_node = self.head
--------------------------------------------------------------------------------
[0.09011 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9

def test_case_9():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        int_0 = -3730
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.insert_to_front(int_0)
        assert len(linked_list_1) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert var_0.data == -3730
        var_1 = linked_list_1.insert_to_front(linked_list_0)
        assert len(linked_list_1) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 0
>       var_2 = linked_list_1.delete_alt(int_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:205: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c5bddb0>, data =

   - [# 100] SDL linkedList5: 
--------------------------------------------------------------------------------
  80:         while curr_node.next is not None:
  81:             if curr_node.next.data == data:
  82:                 curr_node.next = curr_node.next.next
  83:                 return
- 84:             curr_node = curr_node.next
+ 84:             pass
  85:     
  86:     def print_list(self):
  87:         curr_node = self.head
  88:         while curr_node is not None:
--------------------------------------------------------------------------------
[5.00633 s] timeout

   - [# 101] SDL linkedList5: 
--------------------------------------------------------------------------------
  83:                 return
  84:             curr_node = curr_node.next
  85:     
  86:     def print_list(self):
- 87:         curr_node = self.head
+ 87:         pass
  88:         while curr_node is not None:
  89:             print(curr_node.data)
  90:             curr_node = curr_node.next
  91:     
--------------------------------------------------------------------------------
[0.10329 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
>       var_2 = linked_list_0.print_list()

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c680f10>

>   ???
E   UnboundLocalEr

   - [# 102] SDL linkedList5: 
--------------------------------------------------------------------------------
  85:     
  86:     def print_list(self):
  87:         curr_node = self.head
  88:         while curr_node is not None:
- 89:             print(curr_node.data)
+ 89:             pass
  90:             curr_node = curr_node.next
  91:     
  92:     def get_all_data(self):
  93:         data = []
--------------------------------------------------------------------------------
[0.11976 s] survived

   - [# 103] SDL linkedList5: 
--------------------------------------------------------------------------------
  86:     def print_list(self):
  87:         curr_node = self.head
  88:         while curr_node is not None:
  89:             print(curr_node.data)
- 90:             curr_node = curr_node.next
+ 90:             pass
  91:     
  92:     def get_all_data(self):
  93:         data = []
  94:         curr_node = self.head
--------------------------------------------------------------------------------
[5.00638 s] timeout

   - [# 104] SDL linkedList5: 
--------------------------------------------------------------------------------
  89:             print(curr_node.data)
  90:             curr_node = curr_node.next
  91:     
  92:     def get_all_data(self):
- 93:         data = []
+ 93:         pass
  94:         curr_node = self.head
  95:         while curr_node is not None:
  96:             data.append(curr_node.data)
  97:             curr_node = curr_node.next
--------------------------------------------------------------------------------
[0.08448 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
>       var_0 = linked_list_1.get_all_data()

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c4adcc0>

>   ???
E   NameError: name 'data' is not defined

linkedList5:98: NameError

   - [# 105] SDL linkedList5: 
--------------------------------------------------------------------------------
  90:             curr_node = curr_node.next
  91:     
  92:     def get_all_data(self):
  93:         data = []
- 94:         curr_node = self.head
+ 94:         pass
  95:         while curr_node is not None:
  96:             data.append(curr_node.data)
  97:             curr_node = curr_node.next
  98:         return data
--------------------------------------------------------------------------------
[0.08419 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
>       var_0 = linked_list_1.get_all_data()

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c438f40>

>   ???
E   UnboundLocalError: local variable 'curr_node' referenced before assignment

linkedList5:95: UnboundLocalError

   - [# 106] SDL linkedList5: 
--------------------------------------------------------------------------------
  92:     def get_all_data(self):
  93:         data = []
  94:         curr_node = self.head
  95:         while curr_node is not None:
- 96:             data.append(curr_node.data)
+ 96:             pass
  97:             curr_node = curr_node.next
  98:         return data
--------------------------------------------------------------------------------
[0.12028 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_29

def test_case_29():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = var_0.__str__()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1) == 1
        var_2 = linked_list_0.__len__()
        assert var_2 == 1
        var_3 = linked_list_0.append(var_2)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert len(var_1) == 2
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'linkedList5.Node'
        assert var_3.next is None
        assert var_3.data == 1
        var_4 = linked_list_0.get_all_data()
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0

   - [# 107] SDL linkedList5: 
--------------------------------------------------------------------------------
  93:         data = []
  94:         curr_node = self.head
  95:         while curr_node is not None:
  96:             data.append(curr_node.data)
- 97:             curr_node = curr_node.next
+ 97:             pass
  98:         return data
--------------------------------------------------------------------------------
[5.00379 s] timeout

   - [# 108] SDL linkedList5: 
--------------------------------------------------------------------------------
  94:         curr_node = self.head
  95:         while curr_node is not None:
  96:             data.append(curr_node.data)
  97:             curr_node = curr_node.next
- 98:         return data
+ 98:         pass
--------------------------------------------------------------------------------
[0.08767 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
        var_1 = linked_list_0.find(linked_list_0)
        var_2 = linked_list_0.delete(var_0)
>       var_3 = var_0.__len__()
E       AttributeError: 'NoneType' object has no attribute '__len__'. Did you mean: '__le__'?

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:13: AttributeError

   - [# 111] SVD linkedList5: 
--------------------------------------------------------------------------------
   4:         self.next = next
   5:         self.data = data
   6:     
   7:     def __str__(self):
-  8:         return self.data
+  8:         return data
   9: 
  10: 
  11: class LinkedList(object):
  12:     
--------------------------------------------------------------------------------
[0.08690 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_4

def test_case_4():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(var_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.Node'
        var_2 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 3
        assert len(var_0.data) == 3
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_2.next).__module__}.{type(var_2.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_2.data).__module__}.{type(var_2.data).__qualname__}' ==

   - [# 113] SVD linkedList5: 
--------------------------------------------------------------------------------
  13:     def __init__(self, head=None):
  14:         self.head = head
  15:     
  16:     def __len__(self):
- 17:         curr = self.head
+ 17:         curr = head
  18:         counter = 0
  19:         while curr is not None:
  20:             counter += 1
  21:             curr = curr.next
--------------------------------------------------------------------------------
[0.09838 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
>       assert len(linked_list_0) == 0

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c8b2770>

>   ???
E   NameError: name 'head' is not defined

linkedList5:17: NameError

   - [# 114] SVD linkedList5: 
--------------------------------------------------------------------------------
  23:     
  24:     def insert_to_front(self, data):
  25:         if data is None:
  26:             return None
- 27:         node = Node(data, self.head)
+ 27:         node = Node(data, head)
  28:         self.head = node
  29:         return node
  30:     
  31:     def append(self, data):
--------------------------------------------------------------------------------
[0.08456 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
>       var_1 = linked_list_0.insert_to_front(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c420bb0>
data = <linkedList5.LinkedList object at 0x7faf4c420bb0>

>   ???
E   NameError: name 'head' is not defined

linkedList5:27: NameError

   - [# 116] SVD linkedList5: 
--------------------------------------------------------------------------------
  31:     def append(self, data):
  32:         if data is None:
  33:             return None
  34:         node = Node(data)
- 35:         if self.head is None:
+ 35:         if head is None:
  36:             self.head = node
  37:             return node
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
--------------------------------------------------------------------------------
[0.08448 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
>       var_0 = linked_list_0.append(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c4acfd0>
data = <linkedList5.LinkedList object at 0x7faf4c4acfd0>

>   ???
E   NameError: name 'head' is not defined

linkedList5:35: NameError

   - [# 118] SVD linkedList5: 
--------------------------------------------------------------------------------
  34:         node = Node(data)
  35:         if self.head is None:
  36:             self.head = node
  37:             return node
- 38:         curr_node = self.head
+ 38:         curr_node = head
  39:         while curr_node.next is not None:
  40:             curr_node = curr_node.next
  41:         curr_node.next = node
  42:         return node
--------------------------------------------------------------------------------
[0.08510 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_2

def test_case_2():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
        var_2 = linked_list_0.print_list()
>       var_3 = linked_list_0.append(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [# 119] SVD linkedList5: 
--------------------------------------------------------------------------------
  43:     
  44:     def find(self, data):
  45:         if data is None:
  46:             return None
- 47:         curr_node = self.head
+ 47:         curr_node = head
  48:         while curr_node is not None:
  49:             if curr_node.data == data:
  50:                 return curr_node
  51:             curr_node = curr_node.next
--------------------------------------------------------------------------------
[0.08381 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
>       var_1 = linked_list_0.find(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:11: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c4231f0>
data = <linkedList5.LinkedList object at 0x7faf4c4231f0>

>   ???
E   NameError: name 'head' is not defined

linkedList5:47: NameError

   - [# 120] SVD linkedList5: 
--------------------------------------------------------------------------------
  53:     
  54:     def delete(self, data):
  55:         if data is None:
  56:             return
- 57:         if self.head is None:
+ 57:         if head is None:
  58:             return
  59:         if self.head.data == data:
  60:             self.head = self.head.next
  61:             return
--------------------------------------------------------------------------------
[0.08346 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.get_all_data()
        var_1 = linked_list_0.find(linked_list_0)
>       var_2 = linked_list_0.delete(var_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c24f3a0>, data = []

>   ???
E   NameError: name 'head' is not defined

linkedList5:57: NameError

   - [# 121] SVD linkedList5: 
--------------------------------------------------------------------------------
  55:         if data is None:
  56:             return
  57:         if self.head is None:
  58:             return
- 59:         if self.head.data == data:
+ 59:         if head.data == data:
  60:             self.head = self.head.next
  61:             return
  62:         prev_node = self.head
  63:         curr_node = self.head.next
--------------------------------------------------------------------------------
[0.08602 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
>       var_2 = linked_list_0.delete(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:87: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c781480>
data = <linkedList5.LinkedList object at

   - [# 123] SVD linkedList5: 
--------------------------------------------------------------------------------
  56:             return
  57:         if self.head is None:
  58:             return
  59:         if self.head.data == data:
- 60:             self.head = self.head.next
+ 60:             self.head = head.next
  61:             return
  62:         prev_node = self.head
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
--------------------------------------------------------------------------------
[0.09885 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert var_1.next is None
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 1
        set_0 = {var_0, var_1, linked_list_0}
        var_2 = linked_list_0.append(set_0)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'

   - [# 124] SVD linkedList5: 
--------------------------------------------------------------------------------
  58:             return
  59:         if self.head.data == data:
  60:             self.head = self.head.next
  61:             return
- 62:         prev_node = self.head
+ 62:         prev_node = head
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
--------------------------------------------------------------------------------
[0.09602 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
>       var_2 = linked_list_0.delete(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:87: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c438

   - [# 125] SVD linkedList5: 
--------------------------------------------------------------------------------
  59:         if self.head.data == data:
  60:             self.head = self.head.next
  61:             return
  62:         prev_node = self.head
- 63:         curr_node = self.head.next
+ 63:         curr_node = head.next
  64:         while curr_node is not None:
  65:             if curr_node.data == data:
  66:                 prev_node.next = curr_node.next
  67:                 return
--------------------------------------------------------------------------------
[0.08542 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
>       var_2 = linked_list_0.delete(linked_list_0)

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:87: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x
