   - [# 127] SVD linkedList5: 
--------------------------------------------------------------------------------
  72:         if data is None:
  73:             return
  74:         if self.head is None:
  75:             return
- 76:         curr_node = self.head
+ 76:         curr_node = head
  77:         if curr_node.data == data:
  78:             curr_node = curr_node.next
  79:             return
  80:         while curr_node.next is not None:
--------------------------------------------------------------------------------
[0.08765 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert var_1.next is None
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 1
        set_0 = {var_0, var_1, linked_list_0}
        var_2 = linked_list_0.append(set_0)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert len(va

   - [# 128] SVD linkedList5: 
--------------------------------------------------------------------------------
  83:                 return
  84:             curr_node = curr_node.next
  85:     
  86:     def print_list(self):
- 87:         curr_node = self.head
+ 87:         curr_node = head
  88:         while curr_node is not None:
  89:             print(curr_node.data)
  90:             curr_node = curr_node.next
  91:     
--------------------------------------------------------------------------------
[0.08700 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
>       var_2 = linked_list_0.print_list()

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c7eaaa0>

>   ???
E   Na

   - [# 129] SVD linkedList5: 
--------------------------------------------------------------------------------
  90:             curr_node = curr_node.next
  91:     
  92:     def get_all_data(self):
  93:         data = []
- 94:         curr_node = self.head
+ 94:         curr_node = head
  95:         while curr_node is not None:
  96:             data.append(curr_node.data)
  97:             curr_node = curr_node.next
  98:         return data
--------------------------------------------------------------------------------
[0.08364 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_0

def test_case_0():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
>       var_0 = linked_list_1.get_all_data()

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linkedList5.LinkedList object at 0x7faf4c5a4be0>

>   ???
E   NameError: name 'head' is not defined

linkedList5:94: NameError

   - [# 130] ZIL linkedList5: 
--------------------------------------------------------------------------------
  16:     def __len__(self):
  17:         curr = self.head
  18:         counter = 0
  19:         while curr is not None:
- 20:             counter += 1
- 21:             curr = curr.next
+ 20:             break
+ 21:         
  22:         return counter
  23:     
  24:     def insert_to_front(self, data):
  25:         if data is None:
--------------------------------------------------------------------------------
[0.08355 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_1

def test_case_1():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 1
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:19: AssertionError

   - [# 131] ZIL linkedList5: 
--------------------------------------------------------------------------------
  36:             self.head = node
  37:             return node
  38:         curr_node = self.head
  39:         while curr_node.next is not None:
- 40:             curr_node = curr_node.next
+ 40:             break
  41:         curr_node.next = node
  42:         return node
  43:     
  44:     def find(self, data):
--------------------------------------------------------------------------------
[0.08368 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_2

def test_case_2():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 2
        var_2 = linked_list_0.print_list()
        var_3 = linked_list_0.append(linked_list_0)
>       assert len(linked_list_0) == 3
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:51: AssertionError

   - [# 132] ZIL linkedList5: 
--------------------------------------------------------------------------------
  45:         if data is None:
  46:             return None
  47:         curr_node = self.head
  48:         while curr_node is not None:
- 49:             if curr_node.data == data:
- 50:                 return curr_node
- 51:             curr_node = curr_node.next
+ 49:             break
+ 50:         
+ 51:         
  52:         return None
  53:     
  54:     def delete(self, data):
  55:         if data is None:
--------------------------------------------------------------------------------
[0.08727 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_7

def test_case_7():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.find(linked_list_0)
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
E       AssertionError

MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py:148: AssertionError

   - [# 133] ZIL linkedList5: 
--------------------------------------------------------------------------------
  61:             return
  62:         prev_node = self.head
  63:         curr_node = self.head.next
  64:         while curr_node is not None:
- 65:             if curr_node.data == data:
- 66:                 prev_node.next = curr_node.next
- 67:                 return
- 68:             prev_node = curr_node
- 69:             curr_node = curr_node.next
+ 65:             break
+ 66:     
+ 67:     
+ 68:     
+ 69:     
  70:     
  71:     def delete_alt(self, data):
  72:         if data is None:
  73:             return
--------------------------------------------------------------------------------
[0.08553 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_3

def test_case_3():
        float_0 = -532.81
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.append(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = linked_list_0.insert_to_front(float_0)
        assert len(linked_list_0) == 2
        assert len(var_0.data) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert var_1.data == pytest.approx(-532.81, abs=0.01, rel=0.01)
        var_2 = linked_list_0.delete(linked_list_0)
>       assert len(linked_list_0) == 1
E       A

   - [# 134] ZIL linkedList5: 
--------------------------------------------------------------------------------
  77:         if curr_node.data == data:
  78:             curr_node = curr_node.next
  79:             return
  80:         while curr_node.next is not None:
- 81:             if curr_node.next.data == data:
- 82:                 curr_node.next = curr_node.next.next
- 83:                 return
- 84:             curr_node = curr_node.next
+ 81:             break
+ 82:     
+ 83:     
+ 84:     
  85:     
  86:     def print_list(self):
  87:         curr_node = self.head
  88:         while curr_node is not None:
--------------------------------------------------------------------------------
[0.10389 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_WHOLE_SUITE.py::test_case_9

def test_case_9():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        int_0 = -3730
        linked_list_1 = module_0.LinkedList()
        assert len(linked_list_1) == 0
        var_0 = linked_list_1.insert_to_front(int_0)
        assert len(linked_list_1) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert var_0.data == -3730
        var_1 = linked_list_1.insert_to_front(linked_list_0)
        assert len(linked_list_1) == 2
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.next).__module__}.{type(var_1.next).__qualname__}' == 'linkedList5.Node'
        assert f'{type(var_1.data).__module__}.{type(var_1.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1.data) == 0
        var_2 = linked_list_1.delete_alt(int_0)
>       assert len(linked_list_1) == 1
E

   - [# 135] ZIL linkedList5: 
--------------------------------------------------------------------------------
  85:     
  86:     def print_list(self):
  87:         curr_node = self.head
  88:         while curr_node is not None:
- 89:             print(curr_node.data)
- 90:             curr_node = curr_node.next
+ 89:             break
+ 90:     
  91:     
  92:     def get_all_data(self):
  93:         data = []
  94:         curr_node = self.head
--------------------------------------------------------------------------------
[0.10381 s] survived

   - [# 136] ZIL linkedList5: 
--------------------------------------------------------------------------------
  92:     def get_all_data(self):
  93:         data = []
  94:         curr_node = self.head
  95:         while curr_node is not None:
- 96:             data.append(curr_node.data)
- 97:             curr_node = curr_node.next
+ 96:             break
+ 97:         
  98:         return data
--------------------------------------------------------------------------------
[0.12100 s] killed by MIO-MOSA-WHOLE_SUITE/test_linkedList5_MOSA.py::test_case_29

def test_case_29():
        linked_list_0 = module_0.LinkedList()
        assert len(linked_list_0) == 0
        var_0 = linked_list_0.insert_to_front(linked_list_0)
        assert len(linked_list_0) == 1
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList5.Node'
        assert var_0.next is None
        assert f'{type(var_0.data).__module__}.{type(var_0.data).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_0.data) == 1
        var_1 = var_0.__str__()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'linkedList5.LinkedList'
        assert len(var_1) == 1
        var_2 = linked_list_0.__len__()
        assert var_2 == 1
        var_3 = linked_list_0.append(var_2)
        assert len(linked_list_0) == 2
        assert f'{type(var_0.next).__module__}.{type(var_0.next).__qualname__}' == 'linkedList5.Node'
        assert len(var_0.data) == 2
        assert len(var_1) == 2
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'linkedList5.Node'
        assert var_3.next is None
        assert var_3.data == 1
        var_4 = linked_list_0.get_all_data()
        linked_list_1 = module_0.LinkedList()
        assert len(linked_lis
