   - [#   2] ASR queue1: 
--------------------------------------------------------------------------------
  36:             raise ValueError()
  37:         else:
  38:             front_node = self.front
  39:             self.front = self.front.next
- 40:             self.size -= 1
+ 40:             self.size += 1
  41:             return front_node.data
  42:     
  43:     def peek(self):
  44:         if self.front is None:
--------------------------------------------------------------------------------
[0.08415 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
        var_2 = queue_0.dequeue()
>       assert len(queue_0) == 0
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:36: AssertionError

   - [#   3] CDI queue1: 
--------------------------------------------------------------------------------
   5: '''
   6: 
   7: class Queue(object):
   8:     
-  9:     def __init__(self):
- 10:         self.front = None
- 11:         self.back = None
- 12:         self.size = 0
- 13:     
+  9:     @classmethod
+ 10:     def __init__(self):
+ 11:         self.front = None
+ 12:         self.back = None
+ 13:         self.size = 0
  14:     def __str__(self):
  15:         
  16:         pass
  17:     
--------------------------------------------------------------------------------
[0.07703 s] survived

   - [#   4] CDI queue1: 
--------------------------------------------------------------------------------
  10:         self.front = None
  11:         self.back = None
  12:         self.size = 0
  13:     
- 14:     def __str__(self):
- 15:         
- 16:         pass
- 17:     
+ 14:     @classmethod
+ 15:     def __str__(self):
+ 16:         
+ 17:         pass
  18:     def __len__(self):
  19:         return self.size
  20:     
  21:     def enqueue(self, item):
--------------------------------------------------------------------------------
[0.07701 s] survived

   - [#   6] CDI queue1: 
--------------------------------------------------------------------------------
  17:     
  18:     def __len__(self):
  19:         return self.size
  20:     
- 21:     def enqueue(self, item):
- 22:         
- 23:         if self.front is None:
- 24:             new_node = QueueNode(item)
- 25:             self.front = new_node
- 26:             self.back = new_node
- 27:         else:
- 28:             new_back = QueueNode(item)
- 29:             self.back.next = new_back
- 30:             self.back = new_back
- 31:         
- 32:         self.size += 1
- 33:     
+ 21:     @classmethod
+ 22:     def enqueue(self, item):
+ 23:         
+ 24:         if self.front is None:
+ 25:             new_node = QueueNode(item)
+ 26:             self.front = new_node
+ 27:             self.back = new_node
+ 28:         else:
+ 29:             new_back = QueueNode(item)
+ 30:             self.back.next = new_back
+ 31:             self.back = new_back
+ 32:         
+ 33:         self.size += 1
  34:     def dequeue(self):
  35:         if self.front is None:
  36:             raise ValueError()
  37:         else:
--------------------------------------------------------------------------------
[0.08214 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
>       var_1 = queue_0.enqueue(queue_0)

   - [#   7] CDI queue1: 
--------------------------------------------------------------------------------
  30:             self.back = new_back
  31:         
  32:         self.size += 1
  33:     
- 34:     def dequeue(self):
- 35:         if self.front is None:
- 36:             raise ValueError()
- 37:         else:
- 38:             front_node = self.front
- 39:             self.front = self.front.next
- 40:             self.size -= 1
- 41:             return front_node.data
- 42:     
+ 34:     @classmethod
+ 35:     def dequeue(self):
+ 36:         if self.front is None:
+ 37:             raise ValueError()
+ 38:         else:
+ 39:             front_node = self.front
+ 40:             self.front = self.front.next
+ 41:             self.size -= 1
+ 42:             return front_node.data
  43:     def peek(self):
  44:         if self.front is None:
  45:             return None
  46:         return self.front.data
--------------------------------------------------------------------------------
[0.08925 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        with pytest.raises(ValueError):
>           queue_0.dequeue()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue1.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute 'front'

   - [#   8] CDI queue1: 
--------------------------------------------------------------------------------
  39:             self.front = self.front.next
  40:             self.size -= 1
  41:             return front_node.data
  42:     
- 43:     def peek(self):
- 44:         if self.front is None:
- 45:             return None
- 46:         return self.front.data
- 47:     
+ 43:     @classmethod
+ 44:     def peek(self):
+ 45:         if self.front is None:
+ 46:             return None
+ 47:         return self.front.data
  48:     def clear(self):
  49:         self.size = 0
  50:         self.front = None
  51:         self.back = None
--------------------------------------------------------------------------------
[0.08784 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
>       var_0 = queue_0.peek()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue1.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute 'front'

queue1:45: AttributeError

   - [#   9] CDI queue1: 
--------------------------------------------------------------------------------
  44:         if self.front is None:
  45:             return None
  46:         return self.front.data
  47:     
- 48:     def clear(self):
- 49:         self.size = 0
- 50:         self.front = None
- 51:         self.back = None
- 52: 
+ 48:     @classmethod
+ 49:     def clear(self):
+ 50:         self.size = 0
+ 51:         self.front = None
+ 52:         self.back = None
  53: class QueueNode(object):
  54:     def __init__(self, item):
  55:         self.data = item
  56:         self.next = None
--------------------------------------------------------------------------------
[0.09082 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue1.Queue'
        assert len(var_1) == 1
        var_2 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 2
        assert len(var_1) == 2
        var_3 = queue_0.__str__()
        var_4 = queue_0.__str__()
        var_5 = var_3.__str__()
        var_6 = var_1.clear()
>       assert len(queue_0) == 0
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py:44: AssertionError

   - [#  10] CDI queue1: 
--------------------------------------------------------------------------------
  50:         self.front = None
  51:         self.back = None
  52: 
  53: class QueueNode(object):
- 54:     def __init__(self, item):
- 55:         self.data = item
- 56:         self.next = None
+ 54:     @classmethod
+ 55:     def __init__(self, item):
+ 56:         self.data = item
+ 57:         self.next = None
--------------------------------------------------------------------------------
[0.07770 s] survived

   - [#  11] COI queue1: 
--------------------------------------------------------------------------------
  19:         return self.size
  20:     
  21:     def enqueue(self, item):
  22:         
- 23:         if self.front is None:
+ 23:         if not (self.front is None):
  24:             new_node = QueueNode(item)
  25:             self.front = new_node
  26:             self.back = new_node
  27:         else:
--------------------------------------------------------------------------------
[0.07988 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
>       var_1 = queue_0.enqueue(queue_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b0242b0>
item = <queue1.Queue object at 0x7f389b0242b0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue1:29: AttributeError

   - [#  12] COI queue1: 
--------------------------------------------------------------------------------
  31:         
  32:         self.size += 1
  33:     
  34:     def dequeue(self):
- 35:         if self.front is None:
+ 35:         if not (self.front is None):
  36:             raise ValueError()
  37:         else:
  38:             front_node = self.front
  39:             self.front = self.front.next
--------------------------------------------------------------------------------
[0.08647 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        with pytest.raises(ValueError):
>           queue_0.dequeue()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389affb5b0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue1:39: AttributeError

   - [#  13] COI queue1: 
--------------------------------------------------------------------------------
  40:             self.size -= 1
  41:             return front_node.data
  42:     
  43:     def peek(self):
- 44:         if self.front is None:
+ 44:         if not (self.front is None):
  45:             return None
  46:         return self.front.data
  47:     
  48:     def clear(self):
--------------------------------------------------------------------------------
[0.08172 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
>       var_0 = queue_0.peek()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b12ca90>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

queue1:46: AttributeError

   - [#  26] SDL queue1: 
--------------------------------------------------------------------------------
   6: 
   7: class Queue(object):
   8:     
   9:     def __init__(self):
- 10:         self.front = None
+ 10:         pass
  11:         self.back = None
  12:         self.size = 0
  13:     
  14:     def __str__(self):
--------------------------------------------------------------------------------
[0.08619 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
>       var_1 = queue_0.enqueue(queue_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389af140a0>
item = <queue1.Queue object at 0x7f389af140a0>

>   ???
E   AttributeError: 'Queue' object has no attribute 'front'

queue1:23: AttributeError

   - [#  27] SDL queue1: 
--------------------------------------------------------------------------------
   7: class Queue(object):
   8:     
   9:     def __init__(self):
  10:         self.front = None
- 11:         self.back = None
+ 11:         pass
  12:         self.size = 0
  13:     
  14:     def __str__(self):
  15:         
--------------------------------------------------------------------------------
[0.07697 s] survived

   - [#  28] SDL queue1: 
--------------------------------------------------------------------------------
   8:     
   9:     def __init__(self):
  10:         self.front = None
  11:         self.back = None
- 12:         self.size = 0
+ 12:         pass
  13:     
  14:     def __str__(self):
  15:         
  16:         pass
--------------------------------------------------------------------------------
[0.08183 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
>       assert len(queue_0) == 0

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b0434f0>

>   ???
E   AttributeError: 'Queue' object has no attribute 'size'

queue1:19: AttributeError

   - [#  30] SDL queue1: 
--------------------------------------------------------------------------------
  20:     
  21:     def enqueue(self, item):
  22:         
  23:         if self.front is None:
- 24:             new_node = QueueNode(item)
+ 24:             pass
  25:             self.front = new_node
  26:             self.back = new_node
  27:         else:
  28:             new_back = QueueNode(item)
--------------------------------------------------------------------------------
[0.12569 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
>       var_1 = queue_0.enqueue(queue_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b12d120>
item = <queue1.Queue object at 0x7f389b12d120>

>   ???
E   NameError: name 'new_node' is not defined

queue1:25: NameError

   - [#  31] SDL queue1: 
--------------------------------------------------------------------------------
  21:     def enqueue(self, item):
  22:         
  23:         if self.front is None:
  24:             new_node = QueueNode(item)
- 25:             self.front = new_node
+ 25:             pass
  26:             self.back = new_node
  27:         else:
  28:             new_back = QueueNode(item)
  29:             self.back.next = new_back
--------------------------------------------------------------------------------
[0.08168 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
>       var_2 = queue_0.dequeue()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b0401f0>

>   ???
E   ValueError

queue1:36: ValueError

   - [#  32] SDL queue1: 
--------------------------------------------------------------------------------
  22:         
  23:         if self.front is None:
  24:             new_node = QueueNode(item)
  25:             self.front = new_node
- 26:             self.back = new_node
+ 26:             pass
  27:         else:
  28:             new_back = QueueNode(item)
  29:             self.back.next = new_back
  30:             self.back = new_back
--------------------------------------------------------------------------------
[0.08642 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_7

def test_case_7():
        str_0 = '\\=BToYP3(\rYl?ol$]='
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
>       var_1 = queue_0.enqueue(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:67: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b0415a0>, item = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue1:29: AttributeError

   - [#  33] SDL queue1: 
--------------------------------------------------------------------------------
  24:             new_node = QueueNode(item)
  25:             self.front = new_node
  26:             self.back = new_node
  27:         else:
- 28:             new_back = QueueNode(item)
+ 28:             pass
  29:             self.back.next = new_back
  30:             self.back = new_back
  31:         
  32:         self.size += 1
--------------------------------------------------------------------------------
[0.09281 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_7

def test_case_7():
        str_0 = '\\=BToYP3(\rYl?ol$]='
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
>       var_1 = queue_0.enqueue(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:67: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b0403d0>, item = None

>   ???
E   NameError: name 'new_back' is not defined

queue1:29: NameError

   - [#  34] SDL queue1: 
--------------------------------------------------------------------------------
  25:             self.front = new_node
  26:             self.back = new_node
  27:         else:
  28:             new_back = QueueNode(item)
- 29:             self.back.next = new_back
+ 29:             pass
  30:             self.back = new_back
  31:         
  32:         self.size += 1
  33:     
--------------------------------------------------------------------------------
[0.07992 s] survived

   - [#  35] SDL queue1: 
--------------------------------------------------------------------------------
  26:             self.back = new_node
  27:         else:
  28:             new_back = QueueNode(item)
  29:             self.back.next = new_back
- 30:             self.back = new_back
+ 30:             pass
  31:         
  32:         self.size += 1
  33:     
  34:     def dequeue(self):
--------------------------------------------------------------------------------
[0.09347 s] survived

   - [#  36] SDL queue1: 
--------------------------------------------------------------------------------
  34:     def dequeue(self):
  35:         if self.front is None:
  36:             raise ValueError()
  37:         else:
- 38:             front_node = self.front
+ 38:             pass
  39:             self.front = self.front.next
  40:             self.size -= 1
  41:             return front_node.data
  42:     
--------------------------------------------------------------------------------
[0.09587 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
>       var_2 = queue_0.dequeue()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389afb04f0>

>   ???
E   NameError: name 'front_node' is not defined

queue1:41: NameError

   - [#  37] SDL queue1: 
--------------------------------------------------------------------------------
  35:         if self.front is None:
  36:             raise ValueError()
  37:         else:
  38:             front_node = self.front
- 39:             self.front = self.front.next
+ 39:             pass
  40:             self.size -= 1
  41:             return front_node.data
  42:     
  43:     def peek(self):
--------------------------------------------------------------------------------
[0.08533 s] survived

   - [#  38] SDL queue1: 
--------------------------------------------------------------------------------
  37:         else:
  38:             front_node = self.front
  39:             self.front = self.front.next
  40:             self.size -= 1
- 41:             return front_node.data
+ 41:             pass
  42:     
  43:     def peek(self):
  44:         if self.front is None:
  45:             return None
--------------------------------------------------------------------------------
[0.10148 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.peek()
        var_1 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 1
        var_2 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 2
        var_3 = queue_0.__str__()
        var_4 = queue_0.__str__()
        var_5 = var_3.__str__()
        var_6 = queue_0.__len__()
        assert var_6 == 2
        var_7 = queue_0.dequeue()
        assert len(queue_0) == 1
>       assert f'{type(var_7).__module__}.{type(var_7).__qualname__}' == 'queue1.Queue'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py:20: AssertionError

   - [#  39] SDL queue1: 
--------------------------------------------------------------------------------
  41:             return front_node.data
  42:     
  43:     def peek(self):
  44:         if self.front is None:
- 45:             return None
+ 45:             pass
  46:         return self.front.data
  47:     
  48:     def clear(self):
  49:         self.size = 0
--------------------------------------------------------------------------------
[0.08697 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
>       var_0 = queue_0.peek()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b1c2a70>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

queue1:46: AttributeError

   - [#  40] SDL queue1: 
--------------------------------------------------------------------------------
  42:     
  43:     def peek(self):
  44:         if self.front is None:
  45:             return None
- 46:         return self.front.data
+ 46:         pass
  47:     
  48:     def clear(self):
  49:         self.size = 0
  50:         self.front = None
--------------------------------------------------------------------------------
[0.10074 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue1.Queue'
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py:35: AssertionError

   - [#  41] SDL queue1: 
--------------------------------------------------------------------------------
  45:             return None
  46:         return self.front.data
  47:     
  48:     def clear(self):
- 49:         self.size = 0
+ 49:         pass
  50:         self.front = None
  51:         self.back = None
  52: 
  53: class QueueNode(object):
--------------------------------------------------------------------------------
[0.08469 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue1.Queue'
        assert len(var_1) == 1
        var_2 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 2
        assert len(var_1) == 2
        var_3 = queue_0.__str__()
        var_4 = queue_0.__str__()
        var_5 = var_3.__str__()
        var_6 = var_1.clear()
>       assert len(queue_0) == 0
E       AssertionError

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py:44: AssertionError

   - [#  42] SDL queue1: 
--------------------------------------------------------------------------------
  46:         return self.front.data
  47:     
  48:     def clear(self):
  49:         self.size = 0
- 50:         self.front = None
+ 50:         pass
  51:         self.back = None
  52: 
  53: class QueueNode(object):
  54:     def __init__(self, item):
--------------------------------------------------------------------------------
[0.09426 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue1.Queue'
        assert len(var_1) == 1
        var_2 = queue_0.enqueue(queue_0)
        assert len(queue_0) == 2
        assert len(var_1) == 2
        var_3 = queue_0.__str__()
        var_4 = queue_0.__str__()
        var_5 = var_3.__str__()
        var_6 = var_1.clear()
        assert len(queue_0) == 0
        assert len(var_1) == 0
        var_7 = queue_0.__len__()
        assert var_7 == 0
>       with pytest.raises(ValueError):
E       Failed: DID NOT RAISE <class 'ValueError'>

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_MIO.py:48: Failed

   - [#  50] SVD queue1: 
--------------------------------------------------------------------------------
  19:         return self.size
  20:     
  21:     def enqueue(self, item):
  22:         
- 23:         if self.front is None:
+ 23:         if front is None:
  24:             new_node = QueueNode(item)
  25:             self.front = new_node
  26:             self.back = new_node
  27:         else:
--------------------------------------------------------------------------------
[0.09797 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
>       var_1 = queue_0.enqueue(queue_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b09df90>
item = <queue1.Queue object at 0x7f389b09df90>

>   ???
E   NameError: name 'front' is not defined

queue1:23: NameError

   - [#  53] SVD queue1: 
--------------------------------------------------------------------------------
  25:             self.front = new_node
  26:             self.back = new_node
  27:         else:
  28:             new_back = QueueNode(item)
- 29:             self.back.next = new_back
+ 29:             back.next = new_back
  30:             self.back = new_back
  31:         
  32:         self.size += 1
  33:     
--------------------------------------------------------------------------------
[0.10474 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_7

def test_case_7():
        str_0 = '\\=BToYP3(\rYl?ol$]='
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
>       var_1 = queue_0.enqueue(var_0)

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:67: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389af8a470>, item = None

>   ???
E   NameError: name 'back' is not defined

queue1:29: NameError
