   - [#  56] SVD queue1: 
--------------------------------------------------------------------------------
  31:         
  32:         self.size += 1
  33:     
  34:     def dequeue(self):
- 35:         if self.front is None:
+ 35:         if front is None:
  36:             raise ValueError()
  37:         else:
  38:             front_node = self.front
  39:             self.front = self.front.next
--------------------------------------------------------------------------------
[0.10000 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        with pytest.raises(ValueError):
>           queue_0.dequeue()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389af55330>

>   ???
E   NameError: name 'front' is not defined

queue1:35: NameError

   - [#  57] SVD queue1: 
--------------------------------------------------------------------------------
  34:     def dequeue(self):
  35:         if self.front is None:
  36:             raise ValueError()
  37:         else:
- 38:             front_node = self.front
+ 38:             front_node = front
  39:             self.front = self.front.next
  40:             self.size -= 1
  41:             return front_node.data
  42:     
--------------------------------------------------------------------------------
[0.08282 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
>       var_2 = queue_0.dequeue()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b026bf0>

>   ???
E   NameError: name 'front' is not defined

queue1:38: NameError

   - [#  59] SVD queue1: 
--------------------------------------------------------------------------------
  35:         if self.front is None:
  36:             raise ValueError()
  37:         else:
  38:             front_node = self.front
- 39:             self.front = self.front.next
+ 39:             self.front = front.next
  40:             self.size -= 1
  41:             return front_node.data
  42:     
  43:     def peek(self):
--------------------------------------------------------------------------------
[0.08324 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
>       var_2 = queue_0.dequeue()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b12d450>

>   ???
E   NameError: name 'front' is not defined

queue1:39: NameError

   - [#  61] SVD queue1: 
--------------------------------------------------------------------------------
  40:             self.size -= 1
  41:             return front_node.data
  42:     
  43:     def peek(self):
- 44:         if self.front is None:
+ 44:         if front is None:
  45:             return None
  46:         return self.front.data
  47:     
  48:     def clear(self):
--------------------------------------------------------------------------------
[0.09728 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
>       var_0 = queue_0.peek()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b09fdc0>

>   ???
E   NameError: name 'front' is not defined

queue1:44: NameError

   - [#  62] SVD queue1: 
--------------------------------------------------------------------------------
  42:     
  43:     def peek(self):
  44:         if self.front is None:
  45:             return None
- 46:         return self.front.data
+ 46:         return front.data
  47:     
  48:     def clear(self):
  49:         self.size = 0
  50:         self.front = None
--------------------------------------------------------------------------------
[0.09298 s] killed by DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py::test_case_3

def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
>       var_1 = queue_0.peek()

DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue1_DYNAMOSA.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue1.Queue object at 0x7f389b09c0a0>

>   ???
E   NameError: name 'front' is not defined

queue1:46: NameError
