1 : Job ID 3c98184637494f70ae4e241c4e2cc740
test outcome: killed
queue2.py, start pos: (21, 18), end pos: (21, 20)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 != p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - assert True is False
========================= 7 failed, 50 passed in 0.09s =========================

2 : Job ID 85e4223c031d45669d947399a2e55e8c
test outcome: killed
queue2.py, start pos: (48, 23), end pos: (48, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if n.value != value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................FF..F...F...     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F....F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case

3 : Job ID 9b5f583d2ebe4aa0acfc1046a23030ed
test outcome: killed
queue2.py, start pos: (21, 18), end pos: (21, 20)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 < p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - TypeError: '<' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - TypeError: '<' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - TypeError: '<' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - TypeError: '<' not s...
========================= 7 failed, 50 passed in 0.09s =========================

4 : Job ID 2710614cea1847bfa9311f00ec932225
test outcome: killed
queue2.py, start pos: (48, 23), end pos: (48, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if n.value < value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................FF..F..FF...     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F....F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - TypeError: '<' no...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - TypeError: '<' n...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - TypeError: '<' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - TypeError: '<' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::te

5 : Job ID 2e4db432eae24211aa62912bc3912673
test outcome: killed
queue2.py, start pos: (21, 18), end pos: (21, 20)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 <= p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - TypeError: '<=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - TypeError: '<=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - TypeError: '<=' not ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - TypeError: '<=' not ...
========================= 7 failed, 50 passed in 0.09s =========================

6 : Job ID afe8aac05b384d4598b97bb2489d7400
test outcome: killed
queue2.py, start pos: (48, 23), end pos: (48, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if n.value <= value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................FF..F..FF...     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.......F....F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - TypeError: '<=' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - TypeError: '<=' ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - TypeError: '<=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - TypeError: '<=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - TypeError: '<=' not ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.p

7 : Job ID 0b9c2cb21d284fc7a722d4e436a450f9
test outcome: killed
queue2.py, start pos: (21, 18), end pos: (21, 20)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 > p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - TypeError: '>' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - TypeError: '>' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - TypeError: '>' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - TypeError: '>' not s...
========================= 7 failed, 50 passed in 0.09s =========================

8 : Job ID db7f8c738ff5474faea37c258ef30734
test outcome: killed
queue2.py, start pos: (48, 23), end pos: (48, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if n.value > value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................FF..F..FF...     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F....F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - TypeError: '>' no...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - TypeError: '>' n...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - TypeError: '>' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - TypeError: '>' not su...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::te

9 : Job ID 7755710fe5b54303b2af3c16f4bcca14
test outcome: killed
queue2.py, start pos: (21, 18), end pos: (21, 20)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 >= p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - TypeError: '>=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - TypeError: '>=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - TypeError: '>=' not ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - TypeError: '>=' not ...
========================= 7 failed, 50 passed in 0.09s =========================

10 : Job ID 84565e4a2f16430d81d3130092ab2188
test outcome: killed
queue2.py, start pos: (48, 23), end pos: (48, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if n.value >= value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................FF..F..FF...     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.......F....F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - TypeError: '>=' n...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - TypeError: '>=' ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - TypeError: '>=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - TypeError: '>=' not s...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - TypeError: '>=' not ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.

11 : Job ID 4a6b3ef2409f4ec8bc698b890668b74b
SURVIVED
test outcome: survived
queue2.py, start pos: (21, 18), end pos: (21, 20)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 is p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.09s ==============================

12 : Job ID 31c0b00a36c348feb065e291a0f06f6d
SURVIVED
test outcome: survived
queue2.py, start pos: (48, 23), end pos: (48, 25)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if n.value is value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================

13 : Job ID cd4f18a7d2734925b4bc883da255c272
test outcome: killed
queue2.py, start pos: (16, 23), end pos: (16, 25)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -13,7 +13,7 @@
         """Check whether infinite loop via next."""
         p1 = p2 = self
         while p1 != None and p2 != None:
-            if p2.next == None: return False
+            if p2.next is not None: return False
             p1 = p1.next
             p2 = p2.next.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py F.F...........F............F..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py F....F............F.FF.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_0 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_2 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_0 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_18 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_20 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - AttributeError: 'Non...
=======

14 : Job ID 29cffd53174b426a85f6f91b0162eb96
test outcome: killed
queue2.py, start pos: (21, 18), end pos: (21, 20)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 is not p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - assert True is False
========================= 7 failed, 50 passed in 0.08s =========================

15 : Job ID 64a72b758b4f4fd2954ebf558bb19b81
test outcome: killed
queue2.py, start pos: (48, 23), end pos: (48, 25)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 2
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if n.value is not value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................FF..F...F...     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F....F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test

16 : Job ID cc45c94714bc40f79c9f4c508cb14f1e
test outcome: killed
queue2.py, start pos: (49, 24), end pos: (49, 26)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 3
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -46,7 +46,7 @@
         last = None
         while n != None:
             if n.value == value:
-                if last == None:
+                if last is not None:
                     self.head = self.head.next
                 else:
                     last.next = n.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................F......F....     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F.......F.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - AttributeError: 'Non...
========================= 8 failed, 49 passed in 0.08s =========================

17 : Job ID 3232a2e74aa1444f90d4899b805dfd81
test outcome: killed
queue2.py, start pos: (99, 25), end pos: (99, 27)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 4
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -96,7 +96,7 @@
     def isEmpty(self):
         """Determine if queue is empty."""
-        return self.head == None
+        return self.head is not None
     def pop(self):
         """Remove first value from queue."""
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............F...FF.FF...FF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...............F.F....F....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_17 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_22 - assert False is True
=

18 : Job ID d1229e731a814dc2a4c4af4c40c97e6b
SURVIVED
test outcome: survived
queue2.py, start pos: (15, 17), end pos: (15, 19)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -12,7 +12,7 @@
     def checkInfinite(self):
         """Check whether infinite loop via next."""
         p1 = p2 = self
-        while p1 != None and p2 != None:
+        while p1 is None and p2 != None:
             if p2.next == None: return False
             p1 = p1.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================

19 : Job ID 7e47713c65a6448882fd16f0db707d53
SURVIVED
test outcome: survived
queue2.py, start pos: (15, 32), end pos: (15, 34)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -12,7 +12,7 @@
     def checkInfinite(self):
         """Check whether infinite loop via next."""
         p1 = p2 = self
-        while p1 != None and p2 != None:
+        while p1 != None and p2 is None:
             if p2.next == None: return False
             p1 = p1.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================

20 : Job ID f854932dc13b4c81a1ce04445b140999
test outcome: killed
queue2.py, start pos: (47, 16), end pos: (47, 18)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 2
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -44,7 +44,7 @@
         """Remove value from list."""
         n = self.head
         last = None
-        while n != None:
+        while n is None:
             if n.value == value:
                 if last == None:
                     self.head = self.head.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F...F............F......F.F..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F.......F.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_5 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::

21 : Job ID 6be718f2e6764869872229e07ef38efc
test outcome: killed
queue2.py, start pos: (60, 16), end pos: (60, 18)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 3
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -57,7 +57,7 @@
     def __iter__(self):
         """Iterator of values in the list."""
         n = self.head
-        while n != None:
+        while n is None:
             yield n.value
             n = n.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .......F...........FF.FF......     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .F......F..................            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_20 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_23 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_1 - AssertionError: asser...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_8 - AttributeError: 'None...
========================= 7 failed, 50 passed in 0.09s =========================

22 : Job ID ebfec20476b04929b303cd3479636f18
test outcome: killed
queue2.py, start pos: (75, 16), end pos: (75, 18)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 4
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -72,7 +72,7 @@
         """Count values in list."""
         n = self.head
         count = 0
-        while n != None:
+        while n is None:
             count += 1
             n = n.next
         return count
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .FFFFFFFF....FF...FFF.FFFFFF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .FFFFFFFF..F.F.FF.F..FFFF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert 0 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_2 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_3 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_5 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_6 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_8 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AttributeError: ...
FAIL

25 : Job ID 9a0554305dcf4ac1ad566e118d061a49
test outcome: killed
queue2.py, start pos: (37, 21), end pos: (37, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -34,7 +34,7 @@
     def pop(self):
         """Remove first value in list."""
-        if self.head is None:
+        if self.head is not None:
             raise Exception ("Linked list is empty.")
         val = self.head.value
         self.head = self.head.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ....F.........................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ....F.................F....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - Exception: Linked...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - Exception: Linked lis...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_22 - Exception: Linked li...
========================= 3 failed, 54 passed in 0.08s =========================
