26 : Job ID e1a54f95b60f4733a5cc35285d4f5388
test outcome: killed
queue2.py, start pos: (66, 21), end pos: (66, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -63,7 +63,7 @@
     def __repr__(self):
         """String representation of linked list."""
-        if self.head is None:
+        if self.head is not None:
             return 'link:[]'
         return 'link:[{0:s}]'.format(','.join(map(str,self)))
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ...................F..FF......     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .F.........................            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_23 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_1 - AssertionError: asser...
========================= 4 failed, 53 passed in 0.08s =========================

27 : Job ID 95157beca74a4e94a2590dc4dbb9ea09
test outcome: killed
queue2.py, start pos: (91, 21), end pos: (91, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -88,7 +88,7 @@
     def append(self, value):
         """Add value to end of queue."""
         newNode = LinkedNode(value, None)
-        if self.head is None:
+        if self.head is not None:
             self.head = self.tail = newNode
         else:
             self.tail.next = newNode
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ...........F.FF..F.F.F.....F.F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ....FF.....FF..F..F.FFFF...            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_11 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_17 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - AttributeError: 'None...

28 : Job ID d357fd3fa2c14ce48fdd39d24dc48313
test outcome: killed
queue2.py, start pos: (103, 21), end pos: (103, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -100,7 +100,7 @@
     def pop(self):
         """Remove first value from queue."""
-        if self.head is None:
+        if self.head is not None:
             raise Exception ("Queue is empty.")
         val = self.head.value
         self.head = self.head.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.....F..........     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .....F......F.....F..F.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - Exception: Queue...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - Exception: Queue...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - Exception: Queue is e...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_12 - Exception: Queue is ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_18 - Exception: Queue is ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - Exception: Queue is ...
========================= 6 failed, 51 passed in 0.08s =========================

29 : Job ID 89f231cda6fd4fbbb0bcee0ddf34f4c6
SURVIVED
test outcome: survived
queue2.py, start pos: (107, 21), end pos: (107, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 4
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -104,7 +104,7 @@
             raise Exception ("Queue is empty.")
         val = self.head.value
         self.head = self.head.next
-        if self.head is None:
+        if self.head is not None:
             self.tail = None
         return val
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================

30 : Job ID f99d501b114e40cf93fa41e5b8d01476
test outcome: killed
queue2.py, start pos: (120, 21), end pos: (120, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 5
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -117,7 +117,7 @@
     def __repr__(self):
         """String representation of queue."""
-        if self.head is None:
+        if self.head is not None:
             return 'queue:[]'
         return 'queue:[{0:s}]'.format(','.join(map(str,self)))
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...............F...........            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - AssertionError: asse...
========================= 1 failed, 56 passed in 0.08s =========================

31 : Job ID a6115b9603184df3b4d64704b89549ad
SURVIVED
test outcome: survived
queue2.py, start pos: (15, 14), end pos: (15, 39)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -12,7 +12,7 @@
     def checkInfinite(self):
         """Check whether infinite loop via next."""
         p1 = p2 = self
-        while p1 != None and p2 != None:
+        while not p1 != None and p2 != None:
             if p2.next == None: return False
             p1 = p1.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================

32 : Job ID 1244b1e154e6400bbee46115cb585186
test outcome: killed
queue2.py, start pos: (16, 15), end pos: (16, 30)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -13,7 +13,7 @@
         """Check whether infinite loop via next."""
         p1 = p2 = self
         while p1 != None and p2 != None:
-            if p2.next == None: return False
+            if not p2.next == None: return False
             p1 = p1.next
             p2 = p2.next.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py F.F...........F............F..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py F....F............F.FF.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_0 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_2 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_0 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_18 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_20 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - AttributeError: 'Non...
========================= 9 failed,

33 : Job ID 7a6eab5c34834c82b5b910ef67254630
test outcome: killed
queue2.py, start pos: (21, 15), end pos: (21, 23)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if not p1 == p2: return True
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - assert True is False
========================= 7 failed, 50 passed in 0.10s =========================

34 : Job ID f4579d55cd47469680261b5e684c9f3f
test outcome: killed
queue2.py, start pos: (37, 11), end pos: (37, 28)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -34,7 +34,7 @@
     def pop(self):
         """Remove first value in list."""
-        if self.head is None:
+        if not self.head is None:
             raise Exception ("Linked list is empty.")
         val = self.head.value
         self.head = self.head.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ....F.........................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ....F.................F....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - Exception: Linked...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - Exception: Linked lis...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_22 - Exception: Linked li...
========================= 3 failed, 54 passed in 0.09s =========================

35 : Job ID cea2088551c74c5f88981c4fe4b0624a
test outcome: killed
queue2.py, start pos: (47, 14), end pos: (47, 23)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -44,7 +44,7 @@
         """Remove value from list."""
         n = self.head
         last = None
-        while n != None:
+        while not n != None:
             if n.value == value:
                 if last == None:
                     self.head = self.head.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F...F............F......F.F..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F.......F.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_5 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - assert Fa

36 : Job ID 4a468a8aa5e14c34bfc8bec0ac870694
test outcome: killed
queue2.py, start pos: (48, 15), end pos: (48, 31)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -45,7 +45,7 @@
         n = self.head
         last = None
         while n != None:
-            if n.value == value:
+            if not n.value == value:
                 if last == None:
                     self.head = self.head.next
                 else:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................FF..F...F...     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F....F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_18 - assert True is Fa

37 : Job ID 995bf242590a443d88cf2335662fb713
test outcome: killed
queue2.py, start pos: (49, 19), end pos: (49, 31)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -46,7 +46,7 @@
         last = None
         while n != None:
             if n.value == value:
-                if last == None:
+                if not last == None:
                     self.head = self.head.next
                 else:
                     last.next = n.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................F......F....     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F.......F.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - AttributeError: 'Non...
========================= 8 failed, 49 passed in 0.09s =========================

38 : Job ID e2e472385feb4504aca92e2882de141c
test outcome: killed
queue2.py, start pos: (60, 14), end pos: (60, 23)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -57,7 +57,7 @@
     def __iter__(self):
         """Iterator of values in the list."""
         n = self.head
-        while n != None:
+        while not n != None:
             yield n.value
             n = n.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .......F...........FF.FF......     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .F......F..................            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_20 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_23 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_1 - AssertionError: asser...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_8 - AttributeError: 'None...
========================= 7 failed, 50 passed in 0.09s =========================

39 : Job ID a1162972d0b54abfa88f4003801a47e7
test outcome: killed
queue2.py, start pos: (66, 11), end pos: (66, 28)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -63,7 +63,7 @@
     def __repr__(self):
         """String representation of linked list."""
-        if self.head is None:
+        if not self.head is None:
             return 'link:[]'
         return 'link:[{0:s}]'.format(','.join(map(str,self)))
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ...................F..FF......     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .F.........................            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_23 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_1 - AssertionError: asser...
========================= 4 failed, 53 passed in 0.09s =========================

40 : Job ID d9f2fcfc637e4e6fb93fb8ed528350a7
test outcome: killed
queue2.py, start pos: (75, 14), end pos: (75, 23)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -72,7 +72,7 @@
         """Count values in list."""
         n = self.head
         count = 0
-        while n != None:
+        while not n != None:
             count += 1
             n = n.next
         return count
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .FFFFFFFF....FF...FFF.FFFFFF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .FFFFFFFF..F.F.FF.F..FFFF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert 0 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_2 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_3 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_5 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_6 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_8 - AttributeError: '...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_qu

41 : Job ID d1d6af593d364b0ea2ef06e45e704fcc
test outcome: killed
queue2.py, start pos: (91, 11), end pos: (91, 28)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -88,7 +88,7 @@
     def append(self, value):
         """Add value to end of queue."""
         newNode = LinkedNode(value, None)
-        if self.head is None:
+        if not self.head is None:
             self.head = self.tail = newNode
         else:
             self.tail.next = newNode
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ...........F.FF..F.F.F.....F.F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ....FF.....FF..F..F.FFFF...            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_11 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_17 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_q

42 : Job ID ff378898aede4e999ede077339e2a0ca
test outcome: killed
queue2.py, start pos: (103, 11), end pos: (103, 28)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -100,7 +100,7 @@
     def pop(self):
         """Remove first value from queue."""
-        if self.head is None:
+        if not self.head is None:
             raise Exception ("Queue is empty.")
         val = self.head.value
         self.head = self.head.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.....F..........     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .....F......F.....F..F.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - Exception: Queue...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - Exception: Queue...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - Exception: Queue is e...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_12 - Exception: Queue is ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_18 - Exception: Queue is ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - Exception: Queue is ...
========================= 6 failed, 51 passed in 0.08s =========================

43 : Job ID 426001b98c5244a0b04ab0920f537fe7
SURVIVED
test outcome: survived
queue2.py, start pos: (107, 11), end pos: (107, 28)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -104,7 +104,7 @@
             raise Exception ("Queue is empty.")
         val = self.head.value
         self.head = self.head.next
-        if self.head is None:
+        if not self.head is None:
             self.tail = None
         return val
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================

45 : Job ID 437920b2cedc4d79acd8e2dd498fce35
test outcome: killed
queue2.py, start pos: (120, 11), end pos: (120, 28)
operator: core/AddNot, occurrence: 14
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -117,7 +117,7 @@
     def __repr__(self):
         """String representation of queue."""
-        if self.head is None:
+        if not self.head is None:
             return 'queue:[]'
         return 'queue:[{0:s}]'.format(','.join(map(str,self)))
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...............F...........            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - AssertionError: asse...
========================= 1 failed, 56 passed in 0.09s =========================

47 : Job ID 57db01bfba0b429c9236a64c0b11a86c
SURVIVED
test outcome: survived
queue2.py, start pos: (21, 32), end pos: (21, 36)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -18,7 +18,7 @@
             p1 = p1.next
             p2 = p2.next.next
-            if p1 == p2: return True
+            if p1 == p2: return False
         return False
 class LinkedList:
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================

48 : Job ID f91e20c9a62340cf8ece9e6da07e6f16
test outcome: killed
queue2.py, start pos: (53, 23), end pos: (53, 27)
operator: core/ReplaceTrueWithFalse, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -50,7 +50,7 @@
                     self.head = self.head.next
                 else:
                     last.next = n.next
-                return True
+                return False
             n = n.next
         return False
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F................F......F....     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ..F..F.....F.F.......F.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - assert False is ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_2 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_11 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_13 - assert False is True
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - assert False is True
========================= 8 failed, 49 passed in 0.09s =========================

49 : Job ID 9d9a76dfdc9741bcb6820235a2073e69
test outcome: killed
queue2.py, start pos: (16, 39), end pos: (16, 44)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -13,7 +13,7 @@
         """Check whether infinite loop via next."""
         p1 = p2 = self
         while p1 != None and p2 != None:
-            if p2.next == None: return False
+            if p2.next == None: return True
             p1 = p1.next
             p2 = p2.next.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py F.F...........F............F..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py F....F............F.FF.....            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_0 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_2 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_0 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_18 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_20 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - assert True is False
========================= 9 failed, 48 pass

50 : Job ID eaf30bccfeb045f599f3d44b7abc97a6
test outcome: killed
queue2.py, start pos: (22, 15), end pos: (22, 20)
operator: core/ReplaceFalseWithTrue, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -19,7 +19,7 @@
             p2 = p2.next.next
             if p1 == p2: return True
-        return False
+        return True
 class LinkedList:
     def __init__(self, *start):
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - assert True is False
========================= 7 failed, 50 passed in 0.08s =========================

51 : Job ID 855d1a026b1b41a29cf4a5b98f2689c7
test outcome: killed
queue2.py, start pos: (55, 15), end pos: (55, 20)
operator: core/ReplaceFalseWithTrue, occurrence: 2
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -52,7 +52,7 @@
                     last.next = n.next
                 return True
             n = n.next
-        return False
+        return True
     def __iter__(self):
         """Iterator of values in the list."""
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .....F.............F..F...FF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .....F............F..F.FF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_5 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_26 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - assert True is F...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_5 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_18 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_21 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_23 - assert True is False
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_24 - assert True is False
====================
