52 : Job ID 9a24f4fbf0a34d899faf761805fbeaf1
test outcome: killed
queue2.py, start pos: (15, 25), end pos: (15, 28)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -12,7 +12,7 @@
     def checkInfinite(self):
         """Check whether infinite loop via next."""
         p1 = p2 = self
-        while p1 != None and p2 != None:
+        while p1 != None or p2 != None:
             if p2.next == None: return False
             p1 = p1.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .............F.......F.......F     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...FF..........F.........F.            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_21 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_29 - AttributeError: ...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_3 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - AttributeError: 'None...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_15 - AttributeError: 'Non...
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_25 - AttributeError: 'Non...
========================= 7 failed, 50 passed in 0.08s =========================

53 : Job ID 71dcab7fcd6e4f3f94ea3b4922ddbf46
test outcome: killed
queue2.py, start pos: (74, 16), end pos: (74, 17)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -71,7 +71,7 @@
     def __len__(self):
         """Count values in list."""
         n = self.head
-        count = 0
+        count = 1
         while n != None:
             count += 1
             n = n.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .FFFFFFFF....FF...FFF.FFFFFF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .FFFFFFFF..F.F.FF.F..FFFF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert 3 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_2 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_3 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_5 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_6 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_8 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - assert 1 == 0
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert 3 == 2
FAILED DYNAMOSA

54 : Job ID 814192b52856469da47248491076d3d4
test outcome: killed
queue2.py, start pos: (74, 16), end pos: (74, 17)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -71,7 +71,7 @@
     def __len__(self):
         """Count values in list."""
         n = self.head
-        count = 0
+        count = -1
         while n != None:
             count += 1
             n = n.next
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .FFFFFFFF....FF...FFF.FFFFFF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .FFFFFFFF..F.F.FF.F..FFFF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert 1 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_2 - ValueError: __len...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_3 - ValueError: __len...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - ValueError: __len...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_5 - ValueError: __len...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_6 - ValueError: __len...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - ValueError: __len...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_8 - ValueError: __len...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - ValueError: __le...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - ValueError: __le...
FAILED DYNAMOSA-MOSA/test_qu

55 : Job ID 98e43ab65cdd4a9ead9e51d2f1c868a2
test outcome: killed
queue2.py, start pos: (76, 21), end pos: (76, 22)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -73,7 +73,7 @@
         n = self.head
         count = 0
         while n != None:
-            count += 1
+            count += 2
             n = n.next
         return count
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F..F..F.....FF...FFF.FFFFFF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .FF.FF.F...F.F.F..F..FFFF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert 4 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - AssertionError: a...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - assert 2 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - assert 2 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert 4 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - assert 2 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_20 - assert 2 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - assert 2 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_23 - assert 6 == 3
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_24 - assert 6 == 3
FAILED DYNAMOSA-MOSA/test_queue

56 : Job ID 0cb3469f9fe64dcca01954c5e13c937c
test outcome: killed
queue2.py, start pos: (76, 21), end pos: (76, 22)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -73,7 +73,7 @@
         n = self.head
         count = 0
         while n != None:
-            count += 1
+            count += 0
             n = n.next
         return count
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F..F..F.....FF...FFF.FFFFFF..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .FF.FF.F...F.F.F..F..FFFF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert 0 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_4 - AssertionError: a...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_13 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - AssertionError: ...
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert 0 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_19 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_20 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_22 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_23 - assert 0 == 3
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_24 - assert 0 == 3
FAILED DYNAMOSA-MOSA/test_queue

61 : Job ID 028d448779c4462db08f1ce18690bf77
test outcome: killed
queue2.py, start pos: (28, 17), end pos: (28, 22)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -25,7 +25,7 @@
     def __init__(self, *start):
         """Demonstrate linked lists in Python."""
         self.head  = None
-        for _ in start:
+        for _ in []:
             self.prepend(_)
     def prepend(self, value):
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py .F.....F......F...F....FFF.F..     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py .F..F..F...F...F..F..FFFF..            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_1 - assert 0 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_7 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_14 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_18 - assert 0 == 2
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_23 - assert 0 == 3
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_24 - assert 0 == 3
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_25 - assert 0 == 4
FAILED DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py::test_case_27 - assert 0 == 2
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_1 - assert 0 == 3
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_4 - assert 0 == 1
FAILED DYNAMOSA-MOSA/test_queue2_MOSA.py::test_case_7 - assert 0 =

62 : Job ID 9997a6680bae4efca2a748d9fbb33ecd
SURVIVED
test outcome: survived
queue2.py, start pos: (85, 17), end pos: (85, 22)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- aqueue2.py
+++ bqueue2.py
@@ -82,7 +82,7 @@
         """Demonstrate queue using linked list in Python."""
         self.head = None
         self.tail = None
-        for _ in start:
+        for _ in []:
             self.add(_)
     def append(self, value):
DYNAMOSA-MOSA/test_queue2_DYNAMOSA.py ..............................     [ 52%]
DYNAMOSA-MOSA/test_queue2_MOSA.py ...........................            [100%]
============================== 57 passed in 0.08s ==============================
