   - [#  11] CDI queue2: 
--------------------------------------------------------------------------------
   67:             return 'link:[]'
   68:         
   69:         return 'link:[{0:s}]'.format(','.join(map(str, self)))
   70:     
-  71:     def __len__(self):
-  72:         '''Count values in list.'''
-  73:         n = self.head
-  74:         count = 0
-  75:         while n != None:
-  76:             count += 1
-  77:             n = n.next
-  78:         return count
-  79: 
+  71:     @classmethod
+  72:     def __len__(self):
+  73:         '''Count values in list.'''
+  74:         n = self.head
+  75:         count = 0
+  76:         while n != None:
+  77:             count += 1
+  78:             n = n.next
+  79:         return count
   80: class QueueLinkedList:
   81:     def __init__(self, *start):
   82:         '''Demonstrate queue using linked list in Python.'''
   83:         self.head = None
--------------------------------------------------------------------------------
[0.07808 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_4

def test_case_4():
        bytes_0 = b'\x87V\xbbe\nR'
        linked_list_0 = module_0.LinkedList(*bytes_0)
>       assert len(linked_list_0) == 6

MIO-MOSA/test_queue2_MIO.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue2.LinkedList'>

>   ???
E   AttributeError: type object 'LinkedList' has no attribute 'head'

queue2:74: AttributeError

   - [#  12] CDI queue2: 
--------------------------------------------------------------------------------
   77:             n = n.next
   78:         return count
   79: 
   80: class QueueLinkedList:
-  81:     def __init__(self, *start):
-  82:         '''Demonstrate queue using linked list in Python.'''
-  83:         self.head = None
-  84:         self.tail = None
-  85:         for _ in start:
-  86:             self.add(_)
-  87:     
+  81:     @classmethod
+  82:     def __init__(self, *start):
+  83:         '''Demonstrate queue using linked list in Python.'''
+  84:         self.head = None
+  85:         self.tail = None
+  86:         for _ in start:
+  87:             self.add(_)
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
   91:         if self.head is None:
--------------------------------------------------------------------------------
[0.08418 s] survived

   - [#  13] CDI queue2: 
--------------------------------------------------------------------------------
   84:         self.tail = None
   85:         for _ in start:
   86:             self.add(_)
   87:     
-  88:     def append(self, value):
-  89:         '''Add value to end of queue.'''
-  90:         newNode = LinkedNode(value, None)
-  91:         if self.head is None:
-  92:             self.head = self.tail = newNode
-  93:         else:
-  94:             self.tail.next = newNode
-  95:             self.tail = newNode
-  96:     
+  88:     @classmethod
+  89:     def append(self, value):
+  90:         '''Add value to end of queue.'''
+  91:         newNode = LinkedNode(value, None)
+  92:         if self.head is None:
+  93:             self.head = self.tail = newNode
+  94:         else:
+  95:             self.tail.next = newNode
+  96:             self.tail = newNode
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
   99:         return self.head == None
  100:     
--------------------------------------------------------------------------------
[0.08471 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_19

def test_case_19():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
>       var_0 = queue_linked_list_0.append(queue_linked_list_0)

MIO-MOSA/test_queue2_MIO.py:130: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue2.QueueLinkedList'>, value = queue:[]

>   ???
E   AttributeError: type object 'QueueLinkedList' has no attribute 'head'

queue2:92: AttributeError

   - [#  14] CDI queue2: 
--------------------------------------------------------------------------------
   93:         else:
   94:             self.tail.next = newNode
   95:             self.tail = newNode
   96:     
-  97:     def isEmpty(self):
-  98:         '''Determine if queue is empty.'''
-  99:         return self.head == None
- 100:     
+  97:     @classmethod
+  98:     def isEmpty(self):
+  99:         '''Determine if queue is empty.'''
+ 100:         return self.head == None
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
  104:             raise Exception('Queue is empty.')
--------------------------------------------------------------------------------
[0.09424 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_33

def test_case_33():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
>       var_0 = queue_linked_list_0.isEmpty()

MIO-MOSA/test_queue2_MIO.py:232: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue2.QueueLinkedList'>

>   ???
E   AttributeError: type object 'QueueLinkedList' has no attribute 'head'

queue2:100: AttributeError

   - [#  15] CDI queue2: 
--------------------------------------------------------------------------------
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
   99:         return self.head == None
  100:     
- 101:     def pop(self):
- 102:         '''Remove first value from queue.'''
- 103:         if self.head is None:
- 104:             raise Exception('Queue is empty.')
- 105:         val = self.head.value
- 106:         self.head = self.head.next
- 107:         if self.head is None:
- 108:             self.tail = None
- 109:         return val
- 110:     
+ 101:     @classmethod
+ 102:     def pop(self):
+ 103:         '''Remove first value from queue.'''
+ 104:         if self.head is None:
+ 105:             raise Exception('Queue is empty.')
+ 106:         val = self.head.value
+ 107:         self.head = self.head.next
+ 108:         if self.head is None:
+ 109:             self.tail = None
+ 110:         return val
  111:     def __iter__(self):
  112:         '''Iterator of values in queue.'''
  113:         n = self.head
  114:         while n != None:
--------------------------------------------------------------------------------
[0.08702 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_21

def test_case_21():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.pop()

MIO-MOSA/test_queue2_MIO.py:146: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue2.QueueLinkedList'>

   - [#  16] CDI queue2: 
--------------------------------------------------------------------------------
  107:         if self.head is None:
  108:             self.tail = None
  109:         return val
  110:     
- 111:     def __iter__(self):
- 112:         '''Iterator of values in queue.'''
- 113:         n = self.head
- 114:         while n != None:
- 115:             yield n.value
- 116:             n = n.next
- 117:     
+ 111:     @classmethod
+ 112:     def __iter__(self):
+ 113:         '''Iterator of values in queue.'''
+ 114:         n = self.head
+ 115:         while n != None:
+ 116:             yield n.value
+ 117:             n = n.next
  118:     def __repr__(self):
  119:         '''String representation of queue.'''
  120:         if self.head is None:
  121:             return 'queue:[]'
--------------------------------------------------------------------------------
[0.10866 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.__repr__()

MIO-MOSA/test_queue2_MIO.py:183: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue2:123: in __repr__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue2.QueueLinkedList'>

>   ???
E   AttributeError: type object 'QueueLinkedList' has no attribute 'head'

   - [#  17] CDI queue2: 
--------------------------------------------------------------------------------
  114:         while n != None:
  115:             yield n.value
  116:             n = n.next
  117:     
- 118:     def __repr__(self):
- 119:         '''String representation of queue.'''
- 120:         if self.head is None:
- 121:             return 'queue:[]'
- 122:         
- 123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
- 124:     
+ 118:     @classmethod
+ 119:     def __repr__(self):
+ 120:         '''String representation of queue.'''
+ 121:         if self.head is None:
+ 122:             return 'queue:[]'
+ 123:         
+ 124:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  125:     def __len__(self):
  126:         '''Count values in queue.'''
  127:         n = self.head
  128:         count = 0
--------------------------------------------------------------------------------
[0.08928 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.__repr__()

MIO-MOSA/test_queue2_MIO.py:183: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue2.QueueLinkedList'>

>   ???
E   AttributeError: type object 'QueueLinkedList' has no attribute 'head'

queue2:121: AttributeError

   - [#  18] CDI queue2: 
--------------------------------------------------------------------------------
  121:             return 'queue:[]'
  122:         
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
- 125:     def __len__(self):
- 126:         '''Count values in queue.'''
- 127:         n = self.head
- 128:         count = 0
- 129:         while n != None:
- 130:             count += 1
- 131:             n = n.next
- 132:         return count
+ 125:     @classmethod
+ 126:     def __len__(self):
+ 127:         '''Count values in queue.'''
+ 128:         n = self.head
+ 129:         count = 0
+ 130:         while n != None:
+ 131:             count += 1
+ 132:             n = n.next
+ 133:         return count
--------------------------------------------------------------------------------
[0.08749 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_18

def test_case_18():
        queue_linked_list_0 = module_0.QueueLinkedList()
>       assert len(queue_linked_list_0) == 0

MIO-MOSA/test_queue2_MIO.py:125: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue2.QueueLinkedList'>

>   ???
E   AttributeError: type object 'QueueLinkedList' has no attribute 'head'

queue2:128: AttributeError

   - [#  29] COI queue2: 
--------------------------------------------------------------------------------
   87:     
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
-  91:         if self.head is None:
+  91:         if not (self.head is None):
   92:             self.head = self.tail = newNode
   93:         else:
   94:             self.tail.next = newNode
   95:             self.tail = newNode
--------------------------------------------------------------------------------
[0.09065 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_19

def test_case_19():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
>       var_0 = queue_linked_list_0.append(queue_linked_list_0)

MIO-MOSA/test_queue2_MIO.py:130: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[], value = queue:[]

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue2:94: AttributeError

   - [#  30] COI queue2: 
--------------------------------------------------------------------------------
   99:         return self.head == None
  100:     
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
- 103:         if self.head is None:
+ 103:         if not (self.head is None):
  104:             raise Exception('Queue is empty.')
  105:         val = self.head.value
  106:         self.head = self.head.next
  107:         if self.head is None:
--------------------------------------------------------------------------------
[0.08952 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_21

def test_case_21():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.pop()

MIO-MOSA/test_queue2_MIO.py:146: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] QueueLinkedList object at 0x7f094ec73d60>

>   ???
E   Exception: Queue is empty.

queue2:104: Exception

   - [#  31] COI queue2: 
--------------------------------------------------------------------------------
  103:         if self.head is None:
  104:             raise Exception('Queue is empty.')
  105:         val = self.head.value
  106:         self.head = self.head.next
- 107:         if self.head is None:
+ 107:         if not (self.head is None):
  108:             self.tail = None
  109:         return val
  110:     
  111:     def __iter__(self):
--------------------------------------------------------------------------------
[0.08466 s] survived

   - [#  33] COI queue2: 
--------------------------------------------------------------------------------
  116:             n = n.next
  117:     
  118:     def __repr__(self):
  119:         '''String representation of queue.'''
- 120:         if self.head is None:
+ 120:         if not (self.head is None):
  121:             return 'queue:[]'
  122:         
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
--------------------------------------------------------------------------------
[0.10763 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
        var_1 = queue_linked_list_0.__repr__()
>       assert var_1 == 'queue:[True]'
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:184: AssertionError

   - [#  45] CRP queue2: 
--------------------------------------------------------------------------------
  100:     
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
- 104:             raise Exception('Queue is empty.')
+ 104:             raise Exception('mutpy')
  105:         val = self.head.value
  106:         self.head = self.head.next
  107:         if self.head is None:
  108:             self.tail = None
--------------------------------------------------------------------------------
[0.08399 s] survived

   - [#  46] CRP queue2: 
--------------------------------------------------------------------------------
  100:     
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
- 104:             raise Exception('Queue is empty.')
+ 104:             raise Exception('')
  105:         val = self.head.value
  106:         self.head = self.head.next
  107:         if self.head is None:
  108:             self.tail = None
--------------------------------------------------------------------------------
[0.08275 s] survived

   - [#  47] CRP queue2: 
--------------------------------------------------------------------------------
  117:     
  118:     def __repr__(self):
  119:         '''String representation of queue.'''
  120:         if self.head is None:
- 121:             return 'queue:[]'
+ 121:             return 'mutpy'
  122:         
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
  125:     def __len__(self):
--------------------------------------------------------------------------------
[0.09258 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_28

def test_case_28():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.__repr__()
>       assert var_0 == 'queue:[]'
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:203: AssertionError

   - [#  48] CRP queue2: 
--------------------------------------------------------------------------------
  117:     
  118:     def __repr__(self):
  119:         '''String representation of queue.'''
  120:         if self.head is None:
- 121:             return 'queue:[]'
+ 121:             return ''
  122:         
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
  125:     def __len__(self):
--------------------------------------------------------------------------------
[0.09375 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_28

def test_case_28():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.__repr__()
>       assert var_0 == 'queue:[]'
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:203: AssertionError

   - [#  49] CRP queue2: 
--------------------------------------------------------------------------------
  119:         '''String representation of queue.'''
  120:         if self.head is None:
  121:             return 'queue:[]'
  122:         
- 123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
+ 123:         return 'mutpy'.format(','.join(map(str, self)))
  124:     
  125:     def __len__(self):
  126:         '''Count values in queue.'''
  127:         n = self.head
--------------------------------------------------------------------------------
[0.08979 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
        var_1 = queue_linked_list_0.__repr__()
>       assert var_1 == 'queue:[True]'
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:184: AssertionError

   - [#  50] CRP queue2: 
--------------------------------------------------------------------------------
  119:         '''String representation of queue.'''
  120:         if self.head is None:
  121:             return 'queue:[]'
  122:         
- 123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
+ 123:         return ''.format(','.join(map(str, self)))
  124:     
  125:     def __len__(self):
  126:         '''Count values in queue.'''
  127:         n = self.head
--------------------------------------------------------------------------------
[0.10694 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
        var_1 = queue_linked_list_0.__repr__()
>       assert var_1 == 'queue:[True]'
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:184: AssertionError

   - [#  51] CRP queue2: 
--------------------------------------------------------------------------------
  119:         '''String representation of queue.'''
  120:         if self.head is None:
  121:             return 'queue:[]'
  122:         
- 123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
+ 123:         return 'queue:[{0:s}]'.format('mutpy'.join(map(str, self)))
  124:     
  125:     def __len__(self):
  126:         '''Count values in queue.'''
  127:         n = self.head
--------------------------------------------------------------------------------
[0.08567 s] survived

   - [#  52] CRP queue2: 
--------------------------------------------------------------------------------
  119:         '''String representation of queue.'''
  120:         if self.head is None:
  121:             return 'queue:[]'
  122:         
- 123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
+ 123:         return 'queue:[{0:s}]'.format(''.join(map(str, self)))
  124:     
  125:     def __len__(self):
  126:         '''Count values in queue.'''
  127:         n = self.head
--------------------------------------------------------------------------------
[0.08257 s] survived

   - [#  60] OIL queue2: 
--------------------------------------------------------------------------------
   74:         count = 0
   75:         while n != None:
   76:             count += 1
   77:             n = n.next
-  78:         return count
-  79: 
+  78:             break
+  79:         return count
   80: class QueueLinkedList:
   81:     def __init__(self, *start):
   82:         '''Demonstrate queue using linked list in Python.'''
   83:         self.head = None
--------------------------------------------------------------------------------
[0.07956 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_4

def test_case_4():
        bytes_0 = b'\x87V\xbbe\nR'
        linked_list_0 = module_0.LinkedList(*bytes_0)
>       assert len(linked_list_0) == 6
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:31: AssertionError

   - [#  61] OIL queue2: 
--------------------------------------------------------------------------------
   83:         self.head = None
   84:         self.tail = None
   85:         for _ in start:
   86:             self.add(_)
-  87:     
+  87:             break
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
   91:         if self.head is None:
--------------------------------------------------------------------------------
[0.08324 s] survived

   - [#  65] RIL queue2: 
--------------------------------------------------------------------------------
   81:     def __init__(self, *start):
   82:         '''Demonstrate queue using linked list in Python.'''
   83:         self.head = None
   84:         self.tail = None
-  85:         for _ in start:
+  85:         for _ in reversed(start):
   86:             self.add(_)
   87:     
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
--------------------------------------------------------------------------------
[0.08429 s] survived

   - [#  75] ROR queue2: 
--------------------------------------------------------------------------------
   95:             self.tail = newNode
   96:     
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
-  99:         return self.head == None
+  99:         return self.head != None
  100:     
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
--------------------------------------------------------------------------------
[0.11009 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_33

def test_case_33():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.isEmpty()
>       assert var_0 is True
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:233: AssertionError

   - [# 124] SDL queue2: 
--------------------------------------------------------------------------------
   79: 
   80: class QueueLinkedList:
   81:     def __init__(self, *start):
   82:         '''Demonstrate queue using linked list in Python.'''
-  83:         self.head = None
+  83:         pass
   84:         self.tail = None
   85:         for _ in start:
   86:             self.add(_)
   87:     
--------------------------------------------------------------------------------
[0.08761 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_18

def test_case_18():
        queue_linked_list_0 = module_0.QueueLinkedList()
>       assert len(queue_linked_list_0) == 0

MIO-MOSA/test_queue2_MIO.py:125: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'QueueLinkedList' object has no attribute 'head'") raised in repr()] QueueLinkedList object at 0x7f094eca5270>

>   ???
E   AttributeError: 'QueueLinkedList' object has no attribute 'head'

queue2:127: AttributeError

   - [# 126] SDL queue2: 
--------------------------------------------------------------------------------
   82:         '''Demonstrate queue using linked list in Python.'''
   83:         self.head = None
   84:         self.tail = None
   85:         for _ in start:
-  86:             self.add(_)
+  86:             pass
   87:     
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
--------------------------------------------------------------------------------
[0.08381 s] survived

   - [# 127] SDL queue2: 
--------------------------------------------------------------------------------
   86:             self.add(_)
   87:     
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
-  90:         newNode = LinkedNode(value, None)
+  90:         pass
   91:         if self.head is None:
   92:             self.head = self.tail = newNode
   93:         else:
   94:             self.tail.next = newNode
--------------------------------------------------------------------------------
[0.08627 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_19

def test_case_19():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
>       var_0 = queue_linked_list_0.append(queue_linked_list_0)

MIO-MOSA/test_queue2_MIO.py:130: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[], value = queue:[]

>   ???
E   NameError: name 'newNode' is not defined

queue2:92: NameError

   - [# 128] SDL queue2: 
--------------------------------------------------------------------------------
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
   91:         if self.head is None:
-  92:             self.head = self.tail = newNode
+  92:             pass
   93:         else:
   94:             self.tail.next = newNode
   95:             self.tail = newNode
   96:     
--------------------------------------------------------------------------------
[0.08994 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_19

def test_case_19():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
>       assert len(queue_linked_list_0) == 1
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:131: AssertionError

   - [# 129] SDL queue2: 
--------------------------------------------------------------------------------
   90:         newNode = LinkedNode(value, None)
   91:         if self.head is None:
   92:             self.head = self.tail = newNode
   93:         else:
-  94:             self.tail.next = newNode
+  94:             pass
   95:             self.tail = newNode
   96:     
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
--------------------------------------------------------------------------------
[0.09074 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_20

def test_case_20():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
        var_1 = queue_linked_list_0.append(var_0)
>       assert len(queue_linked_list_0) == 2
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:139: AssertionError

   - [# 130] SDL queue2: 
--------------------------------------------------------------------------------
   91:         if self.head is None:
   92:             self.head = self.tail = newNode
   93:         else:
   94:             self.tail.next = newNode
-  95:             self.tail = newNode
+  95:             pass
   96:     
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
   99:         return self.head == None
--------------------------------------------------------------------------------
[0.08516 s] survived
