   - [# 131] SDL queue2: 
--------------------------------------------------------------------------------
   95:             self.tail = newNode
   96:     
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
-  99:         return self.head == None
+  99:         pass
  100:     
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
--------------------------------------------------------------------------------
[0.09339 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_33

def test_case_33():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.isEmpty()
>       assert var_0 is True
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:233: AssertionError

   - [# 132] SDL queue2: 
--------------------------------------------------------------------------------
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
  104:             raise Exception('Queue is empty.')
- 105:         val = self.head.value
+ 105:         pass
  106:         self.head = self.head.next
  107:         if self.head is None:
  108:             self.tail = None
  109:         return val
--------------------------------------------------------------------------------
[0.08734 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_21

def test_case_21():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.pop()

MIO-MOSA/test_queue2_MIO.py:146: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[]

>   ???
E   NameError: name 'val' is not defined

queue2:109: NameError

   - [# 134] SDL queue2: 
--------------------------------------------------------------------------------
  104:             raise Exception('Queue is empty.')
  105:         val = self.head.value
  106:         self.head = self.head.next
  107:         if self.head is None:
- 108:             self.tail = None
+ 108:             pass
  109:         return val
  110:     
  111:     def __iter__(self):
  112:         '''Iterator of values in queue.'''
--------------------------------------------------------------------------------
[0.08493 s] survived

   - [# 135] SDL queue2: 
--------------------------------------------------------------------------------
  105:         val = self.head.value
  106:         self.head = self.head.next
  107:         if self.head is None:
  108:             self.tail = None
- 109:         return val
+ 109:         pass
  110:     
  111:     def __iter__(self):
  112:         '''Iterator of values in queue.'''
  113:         n = self.head
--------------------------------------------------------------------------------
[0.08748 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_21

def test_case_21():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
        var_1 = queue_linked_list_0.pop()
        assert len(queue_linked_list_0) == 0
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue2.QueueLinkedList'
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:148: AssertionError

   - [# 136] SDL queue2: 
--------------------------------------------------------------------------------
  109:         return val
  110:     
  111:     def __iter__(self):
  112:         '''Iterator of values in queue.'''
- 113:         n = self.head
+ 113:         pass
  114:         while n != None:
  115:             yield n.value
  116:             n = n.next
  117:     
--------------------------------------------------------------------------------
[0.09128 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.__repr__()

MIO-MOSA/test_queue2_MIO.py:183: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue2:123: in __repr__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[UnboundLocalError("local variable 'n' referenced before assignment") raised in repr()] QueueLinkedList object at 0x7f094ef5cca0>

>   ???
E   UnboundLocalError: local variable 'n' referenced before assignment

queue2:114: UnboundLocalError

   - [# 139] SDL queue2: 
--------------------------------------------------------------------------------
  117:     
  118:     def __repr__(self):
  119:         '''String representation of queue.'''
  120:         if self.head is None:
- 121:             return 'queue:[]'
+ 121:             pass
  122:         
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
  125:     def __len__(self):
--------------------------------------------------------------------------------
[0.08336 s] survived

   - [# 140] SDL queue2: 
--------------------------------------------------------------------------------
  119:         '''String representation of queue.'''
  120:         if self.head is None:
  121:             return 'queue:[]'
  122:         
- 123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
+ 123:         pass
  124:     
  125:     def __len__(self):
  126:         '''Count values in queue.'''
  127:         n = self.head
--------------------------------------------------------------------------------
[0.08900 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
        var_1 = queue_linked_list_0.__repr__()
>       assert var_1 == 'queue:[True]'
E       AssertionError

MIO-MOSA/test_queue2_MIO.py:184: AssertionError

   - [# 141] SDL queue2: 
--------------------------------------------------------------------------------
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
  125:     def __len__(self):
  126:         '''Count values in queue.'''
- 127:         n = self.head
+ 127:         pass
  128:         count = 0
  129:         while n != None:
  130:             count += 1
  131:             n = n.next
--------------------------------------------------------------------------------
[0.08872 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_18

def test_case_18():
        queue_linked_list_0 = module_0.QueueLinkedList()
>       assert len(queue_linked_list_0) == 0

MIO-MOSA/test_queue2_MIO.py:125: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[]

>   ???
E   UnboundLocalError: local variable 'n' referenced before assignment

queue2:129: UnboundLocalError

   - [# 163] SVD queue2: 
--------------------------------------------------------------------------------
   82:         '''Demonstrate queue using linked list in Python.'''
   83:         self.head = None
   84:         self.tail = None
   85:         for _ in start:
-  86:             self.add(_)
+  86:             add(_)
   87:     
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
--------------------------------------------------------------------------------
[0.08358 s] survived

   - [# 164] SVD queue2: 
--------------------------------------------------------------------------------
   87:     
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
-  91:         if self.head is None:
+  91:         if head is None:
   92:             self.head = self.tail = newNode
   93:         else:
   94:             self.tail.next = newNode
   95:             self.tail = newNode
--------------------------------------------------------------------------------
[0.08720 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_19

def test_case_19():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
>       var_0 = queue_linked_list_0.append(queue_linked_list_0)

MIO-MOSA/test_queue2_MIO.py:130: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[], value = queue:[]

>   ???
E   NameError: name 'head' is not defined

queue2:91: NameError

   - [# 167] SVD queue2: 
--------------------------------------------------------------------------------
   90:         newNode = LinkedNode(value, None)
   91:         if self.head is None:
   92:             self.head = self.tail = newNode
   93:         else:
-  94:             self.tail.next = newNode
+  94:             tail.next = newNode
   95:             self.tail = newNode
   96:     
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
--------------------------------------------------------------------------------
[0.08780 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_20

def test_case_20():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.append(var_0)

MIO-MOSA/test_queue2_MIO.py:138: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] QueueLinkedList object at 0x7f094ede4dc0>
value = None

>   ???
E   NameError: name 'tail' is not defined

queue2:94: NameError

   - [# 169] SVD queue2: 
--------------------------------------------------------------------------------
   95:             self.tail = newNode
   96:     
   97:     def isEmpty(self):
   98:         '''Determine if queue is empty.'''
-  99:         return self.head == None
+  99:         return head == None
  100:     
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
--------------------------------------------------------------------------------
[0.09404 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_33

def test_case_33():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
>       var_0 = queue_linked_list_0.isEmpty()

MIO-MOSA/test_queue2_MIO.py:232: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[]

>   ???
E   NameError: name 'head' is not defined

queue2:99: NameError

   - [# 170] SVD queue2: 
--------------------------------------------------------------------------------
   99:         return self.head == None
  100:     
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
- 103:         if self.head is None:
+ 103:         if head is None:
  104:             raise Exception('Queue is empty.')
  105:         val = self.head.value
  106:         self.head = self.head.next
  107:         if self.head is None:
--------------------------------------------------------------------------------
[0.08675 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_21

def test_case_21():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.pop()

MIO-MOSA/test_queue2_MIO.py:146: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] QueueLinkedList object at 0x7f094ef5dab0>

>   ???
E   NameError: name 'head' is not defined

queue2:103: NameError

   - [# 171] SVD queue2: 
--------------------------------------------------------------------------------
  101:     def pop(self):
  102:         '''Remove first value from queue.'''
  103:         if self.head is None:
  104:             raise Exception('Queue is empty.')
- 105:         val = self.head.value
+ 105:         val = head.value
  106:         self.head = self.head.next
  107:         if self.head is None:
  108:             self.tail = None
  109:         return val
--------------------------------------------------------------------------------
[0.08987 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_21

def test_case_21():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.pop()

MIO-MOSA/test_queue2_MIO.py:146: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[RecursionError('maximum recursion depth exceeded while calling a Python object') raised in repr()] QueueLinkedList object at 0x7f094ef5d240>

>   ???
E   NameError: name 'head' is not defined

queue2:105: NameError

   - [# 174] SVD queue2: 
--------------------------------------------------------------------------------
  103:         if self.head is None:
  104:             raise Exception('Queue is empty.')
  105:         val = self.head.value
  106:         self.head = self.head.next
- 107:         if self.head is None:
+ 107:         if head is None:
  108:             self.tail = None
  109:         return val
  110:     
  111:     def __iter__(self):
--------------------------------------------------------------------------------
[0.08741 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_21

def test_case_21():
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(queue_linked_list_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.pop()

MIO-MOSA/test_queue2_MIO.py:146: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[]

>   ???
E   NameError: name 'head' is not defined

queue2:107: NameError

   - [# 176] SVD queue2: 
--------------------------------------------------------------------------------
  109:         return val
  110:     
  111:     def __iter__(self):
  112:         '''Iterator of values in queue.'''
- 113:         n = self.head
+ 113:         n = head
  114:         while n != None:
  115:             yield n.value
  116:             n = n.next
  117:     
--------------------------------------------------------------------------------
[0.10866 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.__repr__()

MIO-MOSA/test_queue2_MIO.py:183: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue2:123: in __repr__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'head' is not defined") raised in repr()] QueueLinkedList object at 0x7f094ec47f10>

>   ???
E   NameError: name 'head' is not defined

queue2:113: NameError

   - [# 177] SVD queue2: 
--------------------------------------------------------------------------------
  116:             n = n.next
  117:     
  118:     def __repr__(self):
  119:         '''String representation of queue.'''
- 120:         if self.head is None:
+ 120:         if head is None:
  121:             return 'queue:[]'
  122:         
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
--------------------------------------------------------------------------------
[0.08990 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_25

def test_case_25():
        bool_0 = True
        queue_linked_list_0 = module_0.QueueLinkedList()
        assert len(queue_linked_list_0) == 0
        var_0 = queue_linked_list_0.append(bool_0)
        assert len(queue_linked_list_0) == 1
>       var_1 = queue_linked_list_0.__repr__()

MIO-MOSA/test_queue2_MIO.py:183: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'head' is not defined") raised in repr()] QueueLinkedList object at 0x7f094f090f70>

>   ???
E   NameError: name 'head' is not defined

queue2:120: NameError

   - [# 178] SVD queue2: 
--------------------------------------------------------------------------------
  123:         return 'queue:[{0:s}]'.format(','.join(map(str, self)))
  124:     
  125:     def __len__(self):
  126:         '''Count values in queue.'''
- 127:         n = self.head
+ 127:         n = head
  128:         count = 0
  129:         while n != None:
  130:             count += 1
  131:             n = n.next
--------------------------------------------------------------------------------
[0.08867 s] killed by MIO-MOSA/test_queue2_MIO.py::test_case_18

def test_case_18():
        queue_linked_list_0 = module_0.QueueLinkedList()
>       assert len(queue_linked_list_0) == 0

MIO-MOSA/test_queue2_MIO.py:125: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = queue:[]

>   ???
E   NameError: name 'head' is not defined

queue2:127: NameError

   - [# 184] ZIL queue2: 
--------------------------------------------------------------------------------
   82:         '''Demonstrate queue using linked list in Python.'''
   83:         self.head = None
   84:         self.tail = None
   85:         for _ in start:
-  86:             self.add(_)
+  86:             break
   87:     
   88:     def append(self, value):
   89:         '''Add value to end of queue.'''
   90:         newNode = LinkedNode(value, None)
--------------------------------------------------------------------------------
[0.08479 s] survived
