1 : Job ID 130f0abce84d437abc20fdb119272721
test outcome: killed
queue3.py, start pos: (25, 23), end pos: (25, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if self.__size != 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F......F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.13s =========================

2 : Job ID d1a97109a6d44f6aaf7116c32751d318
test outcome: killed
queue3.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if self.__size != 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .................F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ................FF.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py F......F..F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.11s =========================

3 : Job ID cc7f1903df4940f1abcb02786c400b13
test outcome: killed
queue3.py, start pos: (61, 23), end pos: (61, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if self.__size != 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.F.......F.F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...F.F.F.....FFFFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FF.FF..FFF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_3 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_7 - Attribute..

4 : Job ID 16cf9d2f29ff4435aa36d3db65646a97
test outcome: killed
queue3.py, start pos: (63, 25), end pos: (63, 27)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 3
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -60,7 +60,7 @@
         if self.__size == 0:
             return None
-        elif self.__size == 1:
+        elif self.__size != 1:
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.........F....FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............FFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FF.....F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_

5 : Job ID 1f7a0e3bcdd94b26ba7d071f167e7a62
test outcome: killed
queue3.py, start pos: (83, 23), end pos: (83, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 4
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if self.__size != 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ....F........F.FFF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....F........FF..F.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F...FFFF         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_4 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert 1...
FAI

7 : Job ID c59078f6ce9f4265980fdba825be5f68
test outcome: killed
queue3.py, start pos: (106, 35), end pos: (106, 37)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 6
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size != 0 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .....F.....F..F...     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .....F...........FFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFF.F..FF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_14 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - assert Fa...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - as...
FAILED DYNAMOSA-MOSA-WHO

8 : Job ID f717603d296049598521de93b04c604c
test outcome: killed
queue3.py, start pos: (112, 23), end pos: (112, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 7
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if self.__size != 0:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..F..FF.....F..F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FF...F....FF.FFFFFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .FFF.FFFF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_12 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_2 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_6 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_11 - Attribut..

9 : Job ID 58ddeb72012e468390e7b3ca3829733b
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 8
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ != "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

10 : Job ID 7df43f4800cb4e69b80b4db194af9fee
test outcome: killed
queue3.py, start pos: (25, 23), end pos: (25, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if self.__size < 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F...F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F.......         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
========================= 5 failed, 44 passed in 0.11s =========================

11 : Job ID c45953bef3e7409ab8f95902eb5b7da2
test outcome: killed
queue3.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if self.__size < 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .......F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
========================= 1 failed, 48 passed in 0.10s =========================

12 : Job ID aca62eca02614b05a9afb2053b435222
test outcome: killed
queue3.py, start pos: (61, 23), end pos: (61, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if self.__size < 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ...F.........F....     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...F.F.F.....FF.....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...FF...FF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_3 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_7 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_4 - At...
F

13 : Job ID 622f57200fb049af9445fb3092326d9c
test outcome: killed
queue3.py, start pos: (63, 25), end pos: (63, 27)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 3
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -60,7 +60,7 @@
         if self.__size == 0:
             return None
-        elif self.__size == 1:
+        elif self.__size < 1:
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.........F....F.     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............F....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .F.....F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
========================= 6 failed, 43 passed in 0.11s =========================

14 : Job ID 95a721feb7f54a90b7e3bd393100b1d5
test outcome: killed
queue3.py, start pos: (83, 23), end pos: (83, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 4
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if self.__size < 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ....F..........F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....F.........F.....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F...F.F.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_4 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_9 - At...
========================= 7 failed, 42 passed in 0.11s =========================

16 : Job ID bb55a020710e4f9fba063d3c8d77d778
test outcome: killed
queue3.py, start pos: (106, 35), end pos: (106, 37)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 6
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size < 0 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .....F............     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .....F..............       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFF.F..FF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - assert Fa...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_4 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8 - as...
========================= 8 failed, 41 passed in 0.11s =========================

17 : Job ID d99013b933fb4a5a8f79e497ba91074a
test outcome: killed
queue3.py, start pos: (112, 23), end pos: (112, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 7
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if self.__size < 0:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..F..FF.....F.....     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FF...F....FF.FFFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .F.F.FFFF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_12 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_2 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_6 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_11 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_12 - Attribut...
F

18 : Job ID 4b6169b42cbd4a9580aadd168f627587
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 8
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ < "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

19 : Job ID 6b7818eaaf5c4e0bb93b5c0ab91ae3cd
SURVIVED
test outcome: survived
queue3.py, start pos: (25, 23), end pos: (25, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if self.__size <= 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

20 : Job ID f796f7bb053a4010a89fd656e37ac50b
SURVIVED
test outcome: survived
queue3.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if self.__size <= 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.11s ==============================

21 : Job ID 2209868f06ba4472b8632f25b76c5204
SURVIVED
test outcome: survived
queue3.py, start pos: (61, 23), end pos: (61, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if self.__size <= 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.11s ==============================

22 : Job ID d5090c9501794e6da46311c8174fe9c7
SURVIVED
test outcome: survived
queue3.py, start pos: (63, 25), end pos: (63, 27)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 3
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -60,7 +60,7 @@
         if self.__size == 0:
             return None
-        elif self.__size == 1:
+        elif self.__size <= 1:
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.13s ==============================

23 : Job ID 4b675016d0f643c3b8c531e862ae6b74
SURVIVED
test outcome: survived
queue3.py, start pos: (83, 23), end pos: (83, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 4
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if self.__size <= 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

25 : Job ID 6473c3cb62054506872cb6c68d0780ac
SURVIVED
test outcome: survived
queue3.py, start pos: (106, 35), end pos: (106, 37)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 6
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size <= 0 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.15s ==============================

26 : Job ID 64c7365ab393408daf62186ba3db2a7d
SURVIVED
test outcome: survived
queue3.py, start pos: (112, 23), end pos: (112, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 7
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if self.__size <= 0:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

27 : Job ID f76585bb164646eba11f689802cfd8e3
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 8
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ <= "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

28 : Job ID 7db2831dcd7341d796305c5e741135b3
test outcome: killed
queue3.py, start pos: (25, 23), end pos: (25, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if self.__size > 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F......F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.11s =========================
