29 : Job ID 921947eb5775402eade0ee1187379a79
test outcome: killed
queue3.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if self.__size > 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .................F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ................FF.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py F......F..F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.11s =========================

30 : Job ID e28d2e9bb8ea46fa9cec0870d894d6aa
test outcome: killed
queue3.py, start pos: (61, 23), end pos: (61, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if self.__size > 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.F.......F.F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...F.F.F.....FFFFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FF.FF..FFF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_3 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_7 - Attribute...
F

31 : Job ID 04605dc9694b4d559b4aa094bfc93bb4
test outcome: killed
queue3.py, start pos: (63, 25), end pos: (63, 27)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 3
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -60,7 +60,7 @@
         if self.__size == 0:
             return None
-        elif self.__size == 1:
+        elif self.__size > 1:
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.........F....FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............FFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FF.....F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_que

32 : Job ID b64b901c4eb0427fb588cd4963eba2e3
test outcome: killed
queue3.py, start pos: (83, 23), end pos: (83, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 4
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if self.__size > 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ....F........F.FFF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....F........FF..F.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F...FFFF         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_4 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert 1...
FAILED

34 : Job ID 83d1a1e07cb74167a83d3679de454cb0
test outcome: killed
queue3.py, start pos: (106, 35), end pos: (106, 37)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 6
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size > 0 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .....F.....F..F...     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .....F...........FFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFF.F..FF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_14 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - assert Fa...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - as...
FAILED DYNAMOSA-MOSA-WHOLE_

35 : Job ID cfa409e8cad546a89d80d9154439f31a
test outcome: killed
queue3.py, start pos: (112, 23), end pos: (112, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 7
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if self.__size > 0:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..F..FF.....F..F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FF...F....FF.FFFFFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .FFF.FFFF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_12 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_2 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_6 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_11 - Attribut...
F

36 : Job ID 8a6e710b861b4e5d841522a78cf9d896
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 8
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ > "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

37 : Job ID d273bb30909b4605997f3bc9540d7653
test outcome: killed
queue3.py, start pos: (25, 23), end pos: (25, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if self.__size >= 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ................FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..........F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 3 failed, 46 passed in 0.11s =========================

38 : Job ID 1b5b3525ba3942149a8d873a02d082dc
test outcome: killed
queue3.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if self.__size >= 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .................F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ................FF.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py F.........F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 6 failed, 43 passed in 0.11s =========================

39 : Job ID b11d23a3c5464977b2e2cbd5f63f3286
test outcome: killed
queue3.py, start pos: (61, 23), end pos: (61, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if self.__size >= 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.........F....FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............FFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FF.....F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - assert 2...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert 2...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - As...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - As...

40 : Job ID e540e7a8efc54645bb5fe7a35cb424f0
test outcome: killed
queue3.py, start pos: (63, 25), end pos: (63, 27)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 3
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -60,7 +60,7 @@
         if self.__size == 0:
             return None
-        elif self.__size == 1:
+        elif self.__size >= 1:
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .................F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ................FF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py F..........         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
========================= 4 failed, 45 passed in 0.11s =========================

41 : Job ID 73b53e49fa2842c68552d6560f7548e2
test outcome: killed
queue3.py, start pos: (83, 23), end pos: (83, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 4
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if self.__size >= 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .............F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .............F...F.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ........FFF         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert 2...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_9 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - a...
====

43 : Job ID 357c622bc31c4bcd9fe43bc581a51e16
test outcome: killed
queue3.py, start pos: (106, 35), end pos: (106, 37)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 6
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size >= 0 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ...........F..F...     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .................FFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..F........         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_14 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2 - as...
========================= 6 failed, 43 passed in 0.12s =========================

44 : Job ID 4d7a02b5b0214bc68997a5863e22a3b8
test outcome: killed
queue3.py, start pos: (112, 23), end pos: (112, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 7
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if self.__size >= 0:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ...............F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .................FFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..F....F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - Assertio...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - Assertio...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - Assertio...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2 - As...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - As...
========================= 6 failed, 43 passed in 0.11s =========================

45 : Job ID 89e1531c19584e22a24666cd94234903
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 8
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ >= "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.10s ==============================

46 : Job ID 548364f0e43a42f59c9c89d3115efd9b
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ is "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
=============================== warnings summary ===============================
queue3.py:193
  /home/auri/temp/lucca/python_experiments/queue3/queue3.py:193: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if __name__ is "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 49 passed, 1 warning in 0.10s =========================

47 : Job ID b375d5f72e374394abedf8ef2a609e33
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ is not "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
=============================== warnings summary ===============================
queue3.py:193
  /home/auri/temp/lucca/python_experiments/queue3/queue3.py:193: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if __name__ is not "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 49 passed, 1 warning in 0.10s =========================

48 : Job ID 99232c4832f64490be1281aa5bba8fbe
test outcome: killed
queue3.py, start pos: (25, 11), end pos: (25, 27)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if not self.__size == 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F......F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.11s =========================

49 : Job ID 84fddd264b2947aaa8f7c74246e7aece
test outcome: killed
queue3.py, start pos: (44, 11), end pos: (44, 27)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if not self.__size == 0:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .................F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ................FF.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py F......F..F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.10s =========================

50 : Job ID 99d77856a14944a48e9c3c838ca7b213
test outcome: killed
queue3.py, start pos: (61, 11), end pos: (61, 27)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if not self.__size == 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.F.......F.F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...F.F.F.....FFFFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FF.FF..FFF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_3 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_7 - Attribute...
FAILED DYNAMOSA-MOSA-

51 : Job ID 03609fad7e2b45558bc2f2b35e033616
test outcome: killed
queue3.py, start pos: (83, 11), end pos: (83, 27)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if not self.__size == 0:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ....F........F.FFF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....F........FF..F.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F...FFFF         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_4 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE

52 : Job ID 95d354c2c5234e808118e1e777f46e1c
test outcome: killed
queue3.py, start pos: (106, 23), end pos: (106, 39)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if not self.__size == 0 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .....F.....F..F...     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .....F...........FFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFF.F..FF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_14 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - assert Fa...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WH
