53 : Job ID c48709dbd9144ecbb801de393181a4c3
test outcome: killed
queue3.py, start pos: (112, 11), end pos: (112, 27)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if not self.__size == 0:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..F..FF.....F..F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FF...F....FF.FFFFFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .FFF.FFFF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_12 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_2 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_6 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_11 - Attribut...
FAILED DYNAMOSA-MOSA-

54 : Job ID 9d16d189ee3c4505bb8a6261d434a493
test outcome: killed
queue3.py, start pos: (141, 14), end pos: (141, 21)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -138,7 +138,7 @@
         arr = []
         current = self.__head.next
-        while current:
+        while not current:
             arr.append(current.value)
             current = current.next
         return str(arr)
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F....F......FFFF.     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .......F....FFFFF...       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py F..F...FFF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_14 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_7 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_12 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - Attribut...
FAILED DYNAMOSA-M

55 : Job ID 60c2fe2961e849b7938aed494ffa9976
SURVIVED
test outcome: survived
queue3.py, start pos: (193, 3), end pos: (193, 25)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if not __name__ == "__main__":
     pass
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...........         [100%]
============================== 49 passed in 0.11s ==============================

56 : Job ID e6764383e46b4803bbbf5adcf2933f02
test outcome: killed
queue3.py, start pos: (106, 15), end pos: (106, 19)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return False if self.__size == 0 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .....F............     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .....F..............       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFF.F..FF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - assert Fa...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_4 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8 - as...
========================= 8 failed, 41 passed in 0.11s =========================

57 : Job ID d0d64f37f6b0483091a0b24d622e51fd
test outcome: killed
queue3.py, start pos: (106, 45), end pos: (106, 50)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size == 0 else True
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ...........F..F...     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .................FFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..F........         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_14 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2 - as...
========================= 6 failed, 43 passed in 0.11s =========================

58 : Job ID 2288cd81d147418981566584a1670ed4
test outcome: killed
queue3.py, start pos: (19, 22), end pos: (19, 23)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -16,7 +16,7 @@
         self.__sentinel = Node(None)
         self.__head = self.__sentinel
         self.__tail = self.__sentinel
-        self.__size = 0
+        self.__size = 1
     def addAtHead(self, value: T) -> None:
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py FFFFFFF.FF.FFFFFFF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FFFFFFFFF.FFFFFFFFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFFFFFFFFFF         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_0 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_8 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_9 - asser...
FAILED DY

59 : Job ID d8d3db2693a44ec2b65e0b123bc081a2
test outcome: killed
queue3.py, start pos: (19, 22), end pos: (19, 23)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -16,7 +16,7 @@
         self.__sentinel = Node(None)
         self.__head = self.__sentinel
         self.__tail = self.__sentinel
-        self.__size = 0
+        self.__size = -1
     def addAtHead(self, value: T) -> None:
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py FFFFFFF.FF.FFFFFFF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FFFFFFFFF.FFFFFFFFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFFFFFFFFFF         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_0 - Value...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Value...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - Value...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - Value...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Value...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_8 - Value...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_9 - Value...
FAILED D

60 : Job ID 5859a12808ac4177bcdc40272c6d01c1
test outcome: killed
queue3.py, start pos: (25, 26), end pos: (25, 27)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if self.__size == 1:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F..FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F......F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.12s =========================

61 : Job ID 05dacdd12c394e078c353392ff2d7f65
test outcome: killed
queue3.py, start pos: (25, 26), end pos: (25, 27)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -22,7 +22,7 @@
         """Add node at head end."""
-        if self.__size == 0:
+        if self.__size == -1:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F...F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F.......         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
========================= 5 failed, 44 passed in 0.11s =========================

62 : Job ID b25af35da0bd442489727a88d3c91224
test outcome: killed
queue3.py, start pos: (30, 27), end pos: (30, 28)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -27,7 +27,7 @@
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
             self.__tail = newNode
-            self.__size += 1
+            self.__size += 2
         else:
             newNode = Node(value)
             nextNode = self.__sentinel.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F...F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F.......         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - assert 2 ...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - as...
========================= 5 failed, 44 passed in 0.13s =========================

63 : Job ID 5c20de12ccfb4caca45cd2e930335728
test outcome: killed
queue3.py, start pos: (30, 27), end pos: (30, 28)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -27,7 +27,7 @@
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
             self.__tail = newNode
-            self.__size += 1
+            self.__size += 0
         else:
             newNode = Node(value)
             nextNode = self.__sentinel.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F...........F...F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .F..................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F.......         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - assert 0 ...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - as...
========================= 5 failed, 44 passed in 0.13s =========================

64 : Job ID 7127273687424dc798186561bfd0e08e
test outcome: killed
queue3.py, start pos: (38, 27), end pos: (38, 28)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -35,7 +35,7 @@
             newNode.prev = self.__sentinel
             newNode.next = nextNode
             nextNode.prev = newNode
-            self.__size += 1
+            self.__size += 2
     def addAtTail(self, value: T) -> None:
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ................FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ..................F.       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..........F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - assert 3...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 45 passed in 0.15s =========================

65 : Job ID 23e8cbda817d4654aa59b2dc11e8f9e1
test outcome: killed
queue3.py, start pos: (38, 27), end pos: (38, 28)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -35,7 +35,7 @@
             newNode.prev = self.__sentinel
             newNode.next = nextNode
             nextNode.prev = newNode
-            self.__size += 1
+            self.__size += 0
     def addAtTail(self, value: T) -> None:
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ................FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ..................F.       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..........F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_18 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 45 passed in 0.14s =========================

66 : Job ID c230ba98572340fea7291e564b04c26a
test outcome: killed
queue3.py, start pos: (44, 26), end pos: (44, 27)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if self.__size == 1:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .................F     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ................FF.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py F......F..F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - A...
========================= 7 failed, 42 passed in 0.11s =========================

67 : Job ID 5f780dadac5d4cf3a4f8d244da6635f8
test outcome: killed
queue3.py, start pos: (44, 26), end pos: (44, 27)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -41,7 +41,7 @@
         """Add node at tail end."""
-        if self.__size == 0:
+        if self.__size == -1:
             newNode = Node(value)
             self.__sentinel.next = newNode
             newNode.prev = self.__sentinel
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..................     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....................       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .......F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
========================= 1 failed, 48 passed in 0.11s =========================

72 : Job ID c7785b96167f490fa1eaf288dae9151c
test outcome: killed
queue3.py, start pos: (61, 26), end pos: (61, 27)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if self.__size == 1:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.F.......F.F..F.     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...F.F.F.....FFF....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .F.FF..FFF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_3 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_7 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - Attribut...
FAILED DYNAMOSA-

73 : Job ID 741b2b61e7ea44149413b0464b4563d5
test outcome: killed
queue3.py, start pos: (61, 26), end pos: (61, 27)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -58,7 +58,7 @@
         """Remove node at head end."""
-        if self.__size == 0:
+        if self.__size == -1:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ...F.........F....     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...F.F.F.....FF.....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...FF...FF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_3 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_3 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_7 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_4 - At...
FAILED DYNAMOSA

74 : Job ID e10ce4bb4ac14711977dd6a46cc46bd5
test outcome: killed
queue3.py, start pos: (63, 28), end pos: (63, 29)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -60,7 +60,7 @@
         if self.__size == 0:
             return None
-        elif self.__size == 1:
+        elif self.__size == 2:
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.........F....FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............FFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FF.....F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_16 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert <...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE

75 : Job ID b9627a5194d54933a1b0ac85b3f89061
test outcome: killed
queue3.py, start pos: (63, 28), end pos: (63, 29)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -60,7 +60,7 @@
         if self.__size == 0:
             return None
-        elif self.__size == 1:
+        elif self.__size == 0:
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F.........F....F.     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............F....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .F.....F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
========================= 6 failed, 43 passed in 0.14s =========================

76 : Job ID ca6895124f2b42c3bc5fd6536894d28c
test outcome: killed
queue3.py, start pos: (67, 27), end pos: (67, 28)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -64,7 +64,7 @@
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
-            self.__size -= 1
+            self.__size -= 2
             return nodeToRemove
         else:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F..............F.     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............F....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .......F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - Value...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - Valu...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - ValueErr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - Va...
========================= 4 failed, 45 passed in 0.14s =========================

77 : Job ID 667bdaf1d32047899b59ab8b28d85124
test outcome: killed
queue3.py, start pos: (67, 27), end pos: (67, 28)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -64,7 +64,7 @@
             nodeToRemove = self.__head.next
             self.__sentinel.next = None
             nodeToRemove.prev = None
-            self.__size -= 1
+            self.__size -= 0
             return nodeToRemove
         else:
             nodeToRemove = self.__head.next
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .F..............F.     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...............F....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .......F...         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_1 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_15 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - as...
========================= 4 failed, 45 passed in 0.15s =========================

80 : Job ID 3b8b04c9cb2e44258795d0caa4b058cd
test outcome: killed
queue3.py, start pos: (83, 26), end pos: (83, 27)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if self.__size == 1:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ....F........F.F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....F........FF..F..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F...FFF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_4 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
FAILED DYNAMOSA-MOSA-
