81 : Job ID bb1350193a53488fb0527a4819e05d08
test outcome: killed
queue3.py, start pos: (83, 26), end pos: (83, 27)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -80,7 +80,7 @@
         """Remove node at tail end."""
-        if self.__size == 0:
+        if self.__size == -1:
             return None
         elif self.__size == 1:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ....F..........F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ....F.........F.....       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ...F...F.F.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_4 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_4 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_14 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - At...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_9 - At...
========================= 7 failed, 42 passed in 0.12s =========================

84 : Job ID 7070bcbc6d1940d39089d9340bd2bfd6
test outcome: killed
queue3.py, start pos: (91, 27), end pos: (91, 28)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -88,7 +88,7 @@
             self.__sentinel.next = None
             self.__head = self.__sentinel
             self.__tail = self.__sentinel
-            self.__size -= 1
+            self.__size -= 2
             return nodeToRemove
         else:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .............F....     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .............F...F..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ........FF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - Valu...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - ValueErr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - ValueErr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8 - Va...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_9 - Va...
========================= 5 failed, 44 passed in 0.11s =========================

85 : Job ID f3d1a50584904688a1360aa9301c0de9
test outcome: killed
queue3.py, start pos: (91, 27), end pos: (91, 28)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -88,7 +88,7 @@
             self.__sentinel.next = None
             self.__head = self.__sentinel
             self.__tail = self.__sentinel
-            self.__size -= 1
+            self.__size -= 0
             return nodeToRemove
         else:
             nodeToRemove = self.__tail
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .............F....     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .............F...F..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ........FF.         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_13 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_13 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert 1...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_9 - as...
========================= 5 failed, 44 passed in 0.11s =========================

86 : Job ID cffd1e01b78e45229f8ff3cc1c265485
test outcome: killed
queue3.py, start pos: (99, 27), end pos: (99, 28)
operator: core/NumberReplacer, occurrence: 28
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -96,7 +96,7 @@
             nodeToRemove.prev = None
             previous.next = None
             self.__tail = previous
-            self.__size -= 1
+            self.__size -= 2
             return nodeToRemove
     def isEmpty(self) -> bool:
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ................FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...................F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..........F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert 0...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 45 passed in 0.10s =========================

87 : Job ID 4200437e04804b94a23b81faed746ee2
test outcome: killed
queue3.py, start pos: (99, 27), end pos: (99, 28)
operator: core/NumberReplacer, occurrence: 29
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -96,7 +96,7 @@
             nodeToRemove.prev = None
             previous.next = None
             self.__tail = previous
-            self.__size -= 1
+            self.__size -= 0
             return nodeToRemove
     def isEmpty(self) -> bool:
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ................FF     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py ...................F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py ..........F         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_16 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_17 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert 2...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10 - a...
========================= 4 failed, 45 passed in 0.11s =========================

88 : Job ID 1aad9e12909140c5b7b14260c186996f
test outcome: killed
queue3.py, start pos: (106, 38), end pos: (106, 39)
operator: core/NumberReplacer, occurrence: 30
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size == 1 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .....F.....F..F...     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .....F...........F.F       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFF.F..FF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_11 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_14 - asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - assert Fa...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_17 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_19 - assert T...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queu

89 : Job ID 196699f189d946b9978c1e9377d7dffc
test outcome: killed
queue3.py, start pos: (106, 38), end pos: (106, 39)
operator: core/NumberReplacer, occurrence: 31
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -103,7 +103,7 @@
         """Check if linkedlist is empty"""
-        return True if self.__size == 0 else False
+        return True if self.__size == -1 else False
     def getHead(self):
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py .....F............     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .....F..............       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py FFF.F..FF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - asser...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_5 - assert Fa...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_4 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7 - as...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8 - as...
========================= 8 failed, 41 passed in 0.12s =========================

90 : Job ID b9f8c5afd3524f778dfea16ad17a4a5b
test outcome: killed
queue3.py, start pos: (112, 26), end pos: (112, 27)
operator: core/NumberReplacer, occurrence: 32
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if self.__size == 1:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..F..FF.....F..F..     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FF...F....FF.FFFFFF       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .FFF.FFFF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_12 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_15 - Asse...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_2 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_6 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_11 - Attribut...
FAILED DYNAMOSA-

91 : Job ID 5577aa9853cd454eb06b98c2c0480d22
test outcome: killed
queue3.py, start pos: (112, 26), end pos: (112, 27)
operator: core/NumberReplacer, occurrence: 33
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -109,7 +109,7 @@
         """Get value at the front end of the list."""
-        if self.__size == 0:
+        if self.__size == -1:
             return None
         else:
             return self.__head.next.value
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py ..F..FF.....F.....     [ 36%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py .FF...F....FF.FFFF..       [ 77%]
DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py .F.F.FFFF..         [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_2 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_5 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_6 - Attri...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_DYNAMOSA.py::test_case_12 - Attr...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_1 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_2 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_6 - Attribute...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_11 - Attribut...
FAILED DYNAMOSA-MOSA-WHOLE_SUITE/test_queue3_MOSA.py::test_case_12 - Attribut...
FAILED DYNAMOSA
