   - [#   1] ASR queue3: 
--------------------------------------------------------------------------------
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
-  30:             self.__size += 1
+  30:             self.__size -= 1
   31:         else:
   32:             newNode = Node(value)
   33:             nextNode = self.__sentinel.next
   34:             self.__sentinel.next = newNode
--------------------------------------------------------------------------------
[0.07468 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
        none_type_0 = doubly_linked_list_0.addAtHead(var_2)
>       assert len(doubly_linked_list_0) == 1
E       ValueError: __len__() should return >= 0

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:72: ValueError

   - [#   2] ASR queue3: 
--------------------------------------------------------------------------------
   34:             self.__sentinel.next = newNode
   35:             newNode.prev = self.__sentinel
   36:             newNode.next = nextNode
   37:             nextNode.prev = newNode
-  38:             self.__size += 1
+  38:             self.__size -= 1
   39:     
   40:     def addAtTail(self, value: T) -> None:
   41:         
   42:         '''Add node at tail end.'''
--------------------------------------------------------------------------------
[0.08001 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
        assert var_1.prev is None
        none_type_3 = doubly_linked_list_1.addAtHead(str_0)
>       assert len(doubly_linked_list_1) == 2
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:215: AssertionError

   - [#   5] ASR queue3: 
--------------------------------------------------------------------------------
   63:         elif self.__size == 1:
   64:             nodeToRemove = self.__head.next
   65:             self.__sentinel.next = None
   66:             nodeToRemove.prev = None
-  67:             self.__size -= 1
+  67:             self.__size += 1
   68:             return nodeToRemove
   69:         else:
   70:             nodeToRemove = self.__head.next
   71:             nextNode = nodeToRemove.next
--------------------------------------------------------------------------------
[0.07757 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7

def test_case_7():
        bool_0 = False
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = queue_0.enqueue(bool_0)
        str_1 = queue_0.__str__()
        assert str_1 == '[False]'
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_1 = doubly_linked_list_0.addAtTail(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_0 = doubly_linked_list_0.removeAtHead()
>       assert len(doubly_linked_list_0) == 0
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:111: AssertionError

   - [#   7] ASR queue3: 
--------------------------------------------------------------------------------
   87:             nodeToRemove.prev = None
   88:             self.__sentinel.next = None
   89:             self.__head = self.__sentinel
   90:             self.__tail = self.__sentinel
-  91:             self.__size -= 1
+  91:             self.__size += 1
   92:             return nodeToRemove
   93:         else:
   94:             nodeToRemove = self.__tail
   95:             previous = nodeToRemove.prev
--------------------------------------------------------------------------------
[0.10044 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8

def test_case_8():
        bool_0 = True
        queue_0 = module_0.Queue()
        var_0 = queue_0.dequeue()
        none_type_0 = queue_0.enqueue(bool_0)
        str_0 = queue_0.__str__()
        assert str_0 == '[True]'
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        none_type_1 = doubly_linked_list_0.addAtTail(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.getTail()
        assert len(var_1) == 1
        var_2 = doubly_linked_list_0.getTail()
        assert len(var_2) == 1
        var_3 = doubly_linked_list_0.removeAtTail()
>       assert len(doubly_linked_list_0) == 0
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:152: AssertionError

   - [#   8] ASR queue3: 
--------------------------------------------------------------------------------
   95:             previous = nodeToRemove.prev
   96:             nodeToRemove.prev = None
   97:             previous.next = None
   98:             self.__tail = previous
-  99:             self.__size -= 1
+  99:             self.__size += 1
  100:             return nodeToRemove
  101:     
  102:     def isEmpty(self) -> bool:
  103:         
--------------------------------------------------------------------------------
[0.07902 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
>       assert len(doubly_linked_list_1) == 1
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:209: AssertionError

   - [#   9] CDI queue3: 
--------------------------------------------------------------------------------
    4: 
    5: T = TypeVar('T')
    6: 
    7: class Node:
-   8:     def __init__(self, value: T):
-   9:         self.value = value
-  10:         self.next = None
-  11:         self.prev = None
-  12: 
+   8:     @classmethod
+   9:     def __init__(self, value: T):
+  10:         self.value = value
+  11:         self.next = None
+  12:         self.prev = None
   13: 
   14: class DoublyLinkedList:
   15:     def __init__(self):
   16:         self.__sentinel = Node(None)
--------------------------------------------------------------------------------
[0.07469 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
        var_2 = queue_0.dequeue()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Node'
>       assert f'{type(var_2.value).__module__}.{type(var_2.value).__qualname__}' == 'builtins.dict'
E       AssertionError

   - [#  10] CDI queue3: 
--------------------------------------------------------------------------------
   11:         self.prev = None
   12: 
   13: 
   14: class DoublyLinkedList:
-  15:     def __init__(self):
-  16:         self.__sentinel = Node(None)
-  17:         self.__head = self.__sentinel
-  18:         self.__tail = self.__sentinel
-  19:         self.__size = 0
-  20:     
+  15:     @classmethod
+  16:     def __init__(self):
+  17:         self.__sentinel = Node(None)
+  18:         self.__head = self.__sentinel
+  19:         self.__tail = self.__sentinel
+  20:         self.__size = 0
   21:     def addAtHead(self, value: T) -> None:
   22:         
   23:         '''Add node at head end.'''
   24:         
--------------------------------------------------------------------------------
[0.07658 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
        bool_0 = queue_1.isEmpty()
        assert bool_0 is True
        none_type_0 = None
        none_type_1 = queue_1.enqueue(none_type_0)
        none_type_2 = queue_0.enqueue(queue_1)
        var_1 = queue_1.dequeue()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
>       assert var_1.value is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:42: AssertionError

   - [#  11] CDI queue3: 
--------------------------------------------------------------------------------
   17:         self.__head = self.__sentinel
   18:         self.__tail = self.__sentinel
   19:         self.__size = 0
   20:     
-  21:     def addAtHead(self, value: T) -> None:
-  22:         
-  23:         '''Add node at head end.'''
-  24:         
-  25:         if self.__size == 0:
-  26:             newNode = Node(value)
-  27:             self.__sentinel.next = newNode
-  28:             newNode.prev = self.__sentinel
-  29:             self.__tail = newNode
-  30:             self.__size += 1
-  31:         else:
-  32:             newNode = Node(value)
-  33:             nextNode = self.__sentinel.next
-  34:             self.__sentinel.next = newNode
-  35:             newNode.prev = self.__sentinel
-  36:             newNode.next = nextNode
-  37:             nextNode.prev = newNode
-  38:             self.__size += 1
-  39:     
+  21:     @classmethod
+  22:     def addAtHead(self, value: T) -> None:
+  23:         
+  24:         '''Add node at head end.'''
+  25:         
+  26:         if self.__size == 0:
+  27:             newNode = Node(value)
+  28:             self.__sentinel.next = newNode
+  29:             newNode.prev = self.__sentinel
+  30:             self.__tail = newNode
+  31:             self.__size += 1
+  32:         else:
+  33:             newNode = Node(value)
+  34:             nextNode = self.__sentinel.next
+  35:             self.__sentinel.next = newNode
+  36:             newNode.prev = self.__sentinel
+  37:             newNode.next = nextNode
+  38:             nextNode.prev = newNode
+  39:             self.__size += 1
   40:     def addAtTail(self, value: T) -> None:

   - [#  12] CDI queue3: 
--------------------------------------------------------------------------------
   36:             newNode.next = nextNode
   37:             nextNode.prev = newNode
   38:             self.__size += 1
   39:     
-  40:     def addAtTail(self, value: T) -> None:
-  41:         
-  42:         '''Add node at tail end.'''
-  43:         
-  44:         if self.__size == 0:
-  45:             newNode = Node(value)
-  46:             self.__sentinel.next = newNode
-  47:             newNode.prev = self.__sentinel
-  48:             self.__tail = newNode
-  49:             self.__size += 1
-  50:         else:
-  51:             newNode = Node(value)
-  52:             self.__tail.next = newNode
-  53:             newNode.prev = self.__tail
-  54:             self.__tail = newNode
-  55:             self.__size += 1
-  56:     
+  40:     @classmethod
+  41:     def addAtTail(self, value: T) -> None:
+  42:         
+  43:         '''Add node at tail end.'''
+  44:         
+  45:         if self.__size == 0:
+  46:             newNode = Node(value)
+  47:             self.__sentinel.next = newNode
+  48:             newNode.prev = self.__sentinel
+  49:             self.__tail = newNode
+  50:             self.__size += 1
+  51:         else:
+  52:             newNode = Node(value)
+  53:             self.__tail.next = newNode
+  54:             newNode.prev = self.__tail
+  55:             self.__tail = newNode
+  56:             self.__size += 1
   57:     def removeAtHead(self):
   58:         
   59:         '''Remove node at head end.'''
   60:         
--------------------------------------------------------------------------------

   - [#  13] CDI queue3: 
--------------------------------------------------------------------------------
   53:             newNode.prev = self.__tail
   54:             self.__tail = newNode
   55:             self.__size += 1
   56:     
-  57:     def removeAtHead(self):
-  58:         
-  59:         '''Remove node at head end.'''
-  60:         
-  61:         if self.__size == 0:
-  62:             return None
-  63:         elif self.__size == 1:
-  64:             nodeToRemove = self.__head.next
-  65:             self.__sentinel.next = None
-  66:             nodeToRemove.prev = None
-  67:             self.__size -= 1
-  68:             return nodeToRemove
-  69:         else:
-  70:             nodeToRemove = self.__head.next
-  71:             nextNode = nodeToRemove.next
-  72:             self.__sentinel.next = nextNode
-  73:             nextNode.prev = self.__sentinel
-  74:             nodeToRemove.next = None
-  75:             nodeToRemove.prev = None
-  76:             self.__size -= 1
-  77:             return nodeToRemove
-  78:     
+  57:     @classmethod
+  58:     def removeAtHead(self):
+  59:         
+  60:         '''Remove node at head end.'''
+  61:         
+  62:         if self.__size == 0:
+  63:             return None
+  64:         elif self.__size == 1:
+  65:             nodeToRemove = self.__head.next
+  66:             self.__sentinel.next = None
+  67:             nodeToRemove.prev = None
+  68:             self.__size -= 1
+  69:             return nodeToRemove
+  70:         else:
+  71:             nodeToRemove = self.__head.next
+  72:             nextNode = nodeToRemove.next
+  73:             self.__sentinel.next = nextNode

   - [#  14] CDI queue3: 
--------------------------------------------------------------------------------
   75:             nodeToRemove.prev = None
   76:             self.__size -= 1
   77:             return nodeToRemove
   78:     
-  79:     def removeAtTail(self):
-  80:         
-  81:         '''Remove node at tail end.'''
-  82:         
-  83:         if self.__size == 0:
-  84:             return None
-  85:         elif self.__size == 1:
-  86:             nodeToRemove = self.__tail
-  87:             nodeToRemove.prev = None
-  88:             self.__sentinel.next = None
-  89:             self.__head = self.__sentinel
-  90:             self.__tail = self.__sentinel
-  91:             self.__size -= 1
-  92:             return nodeToRemove
-  93:         else:
-  94:             nodeToRemove = self.__tail
-  95:             previous = nodeToRemove.prev
-  96:             nodeToRemove.prev = None
-  97:             previous.next = None
-  98:             self.__tail = previous
-  99:             self.__size -= 1
- 100:             return nodeToRemove
- 101:     
+  79:     @classmethod
+  80:     def removeAtTail(self):
+  81:         
+  82:         '''Remove node at tail end.'''
+  83:         
+  84:         if self.__size == 0:
+  85:             return None
+  86:         elif self.__size == 1:
+  87:             nodeToRemove = self.__tail
+  88:             nodeToRemove.prev = None
+  89:             self.__sentinel.next = None
+  90:             self.__head = self.__sentinel
+  91:             self.__tail = self.__sentinel
+  92:             self.__size -= 1
+  93:             return nodeToRemove
+  94:         else:

   - [#  15] CDI queue3: 
--------------------------------------------------------------------------------
   98:             self.__tail = previous
   99:             self.__size -= 1
  100:             return nodeToRemove
  101:     
- 102:     def isEmpty(self) -> bool:
- 103:         
- 104:         '''Check if linkedlist is empty'''
- 105:         
- 106:         return True if self.__size == 0 else False
- 107:     
+ 102:     @classmethod
+ 103:     def isEmpty(self) -> bool:
+ 104:         
+ 105:         '''Check if linkedlist is empty'''
+ 106:         
+ 107:         return True if self.__size == 0 else False
  108:     def getHead(self):
  109:         
  110:         '''Get value at the front end of the list.'''
  111:         
--------------------------------------------------------------------------------
[0.07502 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
>       bool_0 = doubly_linked_list_0.isEmpty()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.DoublyLinkedList'>

>   ???
E   AttributeError: type object 'DoublyLinkedList' has no attribute '_DoublyLinkedList__size'

   - [#  16] CDI queue3: 
--------------------------------------------------------------------------------
  104:         '''Check if linkedlist is empty'''
  105:         
  106:         return True if self.__size == 0 else False
  107:     
- 108:     def getHead(self):
- 109:         
- 110:         '''Get value at the front end of the list.'''
- 111:         
- 112:         if self.__size == 0:
- 113:             return None
- 114:         else:
- 115:             return self.__head.next.value
- 116:     
+ 108:     @classmethod
+ 109:     def getHead(self):
+ 110:         
+ 111:         '''Get value at the front end of the list.'''
+ 112:         
+ 113:         if self.__size == 0:
+ 114:             return None
+ 115:         else:
+ 116:             return self.__head.next.value
  117:     def getTail(self) -> T:
  118:         
  119:         '''Get value at the tail of the list.'''
  120:         
--------------------------------------------------------------------------------
[0.07527 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
>       var_0 = queue_0.getHead()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:154: in getHead
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.DoublyLinkedList'>

   - [#  17] CDI queue3: 
--------------------------------------------------------------------------------
  113:             return None
  114:         else:
  115:             return self.__head.next.value
  116:     
- 117:     def getTail(self) -> T:
- 118:         
- 119:         '''Get value at the tail of the list.'''
- 120:         
- 121:         return self.__tail.value
- 122:     
+ 117:     @classmethod
+ 118:     def getTail(self) -> T:
+ 119:         
+ 120:         '''Get value at the tail of the list.'''
+ 121:         
+ 122:         return self.__tail.value
  123:     def getSize(self) -> int:
  124:         
  125:         '''Get length of the linked list.'''
  126:         
--------------------------------------------------------------------------------
[0.07476 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
>       var_0 = doubly_linked_list_0.getTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.DoublyLinkedList'>

>   ???
E   AttributeError: type object 'DoublyLinkedList' has no attribute '_DoublyLinkedList__tail'

queue3:122: AttributeError

   - [#  18] CDI queue3: 
--------------------------------------------------------------------------------
  119:         '''Get value at the tail of the list.'''
  120:         
  121:         return self.__tail.value
  122:     
- 123:     def getSize(self) -> int:
- 124:         
- 125:         '''Get length of the linked list.'''
- 126:         
- 127:         return self.__size
- 128:     
+ 123:     @classmethod
+ 124:     def getSize(self) -> int:
+ 125:         
+ 126:         '''Get length of the linked list.'''
+ 127:         
+ 128:         return self.__size
  129:     def __len__(self) -> int:
  130:         
  131:         '''Get length of the linked list.'''
  132:         
--------------------------------------------------------------------------------
[0.07950 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_5

def test_case_5():
        none_type_0 = None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       int_0 = queue_0.getSize()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:178: in getSize
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.DoublyLinkedList'>

>   ???
E   AttributeError: type object 'DoublyLinkedList' has no attribute '_DoublyLinkedList__size'

queue3:128: AttributeError

   - [#  19] CDI queue3: 
--------------------------------------------------------------------------------
  125:         '''Get length of the linked list.'''
  126:         
  127:         return self.__size
  128:     
- 129:     def __len__(self) -> int:
- 130:         
- 131:         '''Get length of the linked list.'''
- 132:         
- 133:         return self.__size
- 134:     
+ 129:     @classmethod
+ 130:     def __len__(self) -> int:
+ 131:         
+ 132:         '''Get length of the linked list.'''
+ 133:         
+ 134:         return self.__size
  135:     def __str__(self) -> str:
  136:         
  137:         '''Return String representation of linkedlist values.'''
  138:         
--------------------------------------------------------------------------------
[0.07473 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.DoublyLinkedList'>

>   ???
E   AttributeError: type object 'DoublyLinkedList' has no attribute '_DoublyLinkedList__size'

queue3:134: AttributeError

   - [#  20] CDI queue3: 
--------------------------------------------------------------------------------
  131:         '''Get length of the linked list.'''
  132:         
  133:         return self.__size
  134:     
- 135:     def __str__(self) -> str:
- 136:         
- 137:         '''Return String representation of linkedlist values.'''
- 138:         
- 139:         arr = []
- 140:         current = self.__head.next
- 141:         while current:
- 142:             arr.append(current.value)
- 143:             current = current.next
- 144:         return str(arr)
- 145: 
+ 135:     @classmethod
+ 136:     def __str__(self) -> str:
+ 137:         
+ 138:         '''Return String representation of linkedlist values.'''
+ 139:         
+ 140:         arr = []
+ 141:         current = self.__head.next
+ 142:         while current:
+ 143:             arr.append(current.value)
+ 144:             current = current.next
+ 145:         return str(arr)
  146: class Queue:
  147:     def __init__(self):
  148:         self.__queue = DoublyLinkedList()
  149:     
--------------------------------------------------------------------------------
[0.07491 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:190: in __str__
    ???

   - [#  21] CDI queue3: 
--------------------------------------------------------------------------------
  143:             current = current.next
  144:         return str(arr)
  145: 
  146: class Queue:
- 147:     def __init__(self):
- 148:         self.__queue = DoublyLinkedList()
- 149:     
+ 147:     @classmethod
+ 148:     def __init__(self):
+ 149:         self.__queue = DoublyLinkedList()
  150:     def getHead(self) -> T:
  151:         
  152:         '''View first element in the queue.'''
  153:         
--------------------------------------------------------------------------------
[0.07549 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        none_type_0 = queue_0.enqueue(queue_0)
        queue_1 = module_0.Queue()
        var_0 = queue_1.getTail()
        node_0 = module_0.Node(queue_0)
        var_1 = queue_0.getHead()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Queue'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:53: AssertionError

   - [#  22] CDI queue3: 
--------------------------------------------------------------------------------
  146: class Queue:
  147:     def __init__(self):
  148:         self.__queue = DoublyLinkedList()
  149:     
- 150:     def getHead(self) -> T:
- 151:         
- 152:         '''View first element in the queue.'''
- 153:         
- 154:         return self.__queue.getHead()
- 155:     
+ 150:     @classmethod
+ 151:     def getHead(self) -> T:
+ 152:         
+ 153:         '''View first element in the queue.'''
+ 154:         
+ 155:         return self.__queue.getHead()
  156:     def getTail(self):
  157:         
  158:         '''View last element in the queue.'''
  159:         
--------------------------------------------------------------------------------
[0.07692 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
>       var_0 = queue_0.getHead()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_Queue__queue'

queue3:155: AttributeError
