   - [#  23] CDI queue3: 
--------------------------------------------------------------------------------
  152:         '''View first element in the queue.'''
  153:         
  154:         return self.__queue.getHead()
  155:     
- 156:     def getTail(self):
- 157:         
- 158:         '''View last element in the queue.'''
- 159:         
- 160:         return self.__queue.getTail()
- 161:     
+ 156:     @classmethod
+ 157:     def getTail(self):
+ 158:         
+ 159:         '''View last element in the queue.'''
+ 160:         
+ 161:         return self.__queue.getTail()
  162:     def dequeue(self) -> T:
  163:         
  164:         '''Remove element from the queue.'''
  165:         
--------------------------------------------------------------------------------
[0.07546 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
>       var_1 = queue_0.getTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:22:

   - [#  24] CDI queue3: 
--------------------------------------------------------------------------------
  158:         '''View last element in the queue.'''
  159:         
  160:         return self.__queue.getTail()
  161:     
- 162:     def dequeue(self) -> T:
- 163:         
- 164:         '''Remove element from the queue.'''
- 165:         
- 166:         return self.__queue.removeAtHead()
- 167:     
+ 162:     @classmethod
+ 163:     def dequeue(self) -> T:
+ 164:         
+ 165:         '''Remove element from the queue.'''
+ 166:         
+ 167:         return self.__queue.removeAtHead()
  168:     def enqueue(self, value: T) -> None:
  169:         
  170:         '''Add element to queue.'''
  171:         
--------------------------------------------------------------------------------
[0.07653 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

   - [#  25] CDI queue3: 
--------------------------------------------------------------------------------
  164:         '''Remove element from the queue.'''
  165:         
  166:         return self.__queue.removeAtHead()
  167:     
- 168:     def enqueue(self, value: T) -> None:
- 169:         
- 170:         '''Add element to queue.'''
- 171:         
- 172:         self.__queue.addAtTail(value)
- 173:     
+ 168:     @classmethod
+ 169:     def enqueue(self, value: T) -> None:
+ 170:         
+ 171:         '''Add element to queue.'''
+ 172:         
+ 173:         self.__queue.addAtTail(value)
  174:     def getSize(self) -> int:
  175:         
  176:         '''Get size of the queue.'''
  177:         
--------------------------------------------------------------------------------
[0.07532 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
>       none_type_1 = queue_0.enqueue(dict_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.Queue'>
value = {<queue3.Queue object at 0x7f33a3b72410>: <queue3.Queue object at 0x7f33a3b72410>, None: <queue3.Queue object at 0x7f33a3b72410>, '[]': <queue3.Queue object at 0x7f33a3b72410>}

>   ???
E   AttributeError: type object 'Queue' has no attribute '_Queue__queue'

queue3:173: AttributeError

   - [#  26] CDI queue3: 
--------------------------------------------------------------------------------
  170:         '''Add element to queue.'''
  171:         
  172:         self.__queue.addAtTail(value)
  173:     
- 174:     def getSize(self) -> int:
- 175:         
- 176:         '''Get size of the queue.'''
- 177:         
- 178:         return self.__queue.getSize()
- 179:     
+ 174:     @classmethod
+ 175:     def getSize(self) -> int:
+ 176:         
+ 177:         '''Get size of the queue.'''
+ 178:         
+ 179:         return self.__queue.getSize()
  180:     def isEmpty(self) -> bool:
  181:         
  182:         '''Check if queue is empty.'''
  183:         
--------------------------------------------------------------------------------
[0.09899 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_5

def test_case_5():
        none_type_0 = None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       int_0 = queue_0.getSize()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_Queue__queue'

queue3:179: AttributeError

   - [#  27] CDI queue3: 
--------------------------------------------------------------------------------
  176:         '''Get size of the queue.'''
  177:         
  178:         return self.__queue.getSize()
  179:     
- 180:     def isEmpty(self) -> bool:
- 181:         
- 182:         '''Check if queue is empty.'''
- 183:         
- 184:         return self.__queue.isEmpty()
- 185:     
+ 180:     @classmethod
+ 181:     def isEmpty(self) -> bool:
+ 182:         
+ 183:         '''Check if queue is empty.'''
+ 184:         
+ 185:         return self.__queue.isEmpty()
  186:     def __str__(self) -> str:
  187:         
  188:         '''Get string representation of the queue.'''
  189:         
--------------------------------------------------------------------------------
[0.07598 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
>       bool_0 = queue_1.isEmpty()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_Queue__queue'

queue3:185: AttributeError

   - [#  28] CDI queue3: 
--------------------------------------------------------------------------------
  182:         '''Check if queue is empty.'''
  183:         
  184:         return self.__queue.isEmpty()
  185:     
- 186:     def __str__(self) -> str:
- 187:         
- 188:         '''Get string representation of the queue.'''
- 189:         
- 190:         return self.__queue.__str__()
- 191: 
+ 186:     @classmethod
+ 187:     def __str__(self) -> str:
+ 188:         
+ 189:         '''Get string representation of the queue.'''
+ 190:         
+ 191:         return self.__queue.__str__()
  192: 
  193: if __name__ == '__main__':
  194:     pass
--------------------------------------------------------------------------------
[0.07545 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue3.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_Queue__queue'

queue3:191: AttributeError

   - [#  29] COI queue3: 
--------------------------------------------------------------------------------
   21:     def addAtHead(self, value: T) -> None:
   22:         
   23:         '''Add node at head end.'''
   24:         
-  25:         if self.__size == 0:
+  25:         if not (self.__size == 0):
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
--------------------------------------------------------------------------------
[0.07584 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
>       none_type_0 = doubly_linked_list_0.addAtHead(var_2)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3b61960>, value = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

queue3:37: AttributeError

   - [#  32] COI queue3: 
--------------------------------------------------------------------------------
   59:         '''Remove node at head end.'''
   60:         
   61:         if self.__size == 0:
   62:             return None
-  63:         elif self.__size == 1:
+  63:         elif not (self.__size == 1):
   64:             nodeToRemove = self.__head.next
   65:             self.__sentinel.next = None
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
--------------------------------------------------------------------------------
[0.07476 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
        var_2 = queue_0.dequeue()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Node'
        assert f'{type(var_2.value).__module__}.{type(var_2.value).__qualname__}' == 'builtins.dict'
        assert len(var_2.value) == 3
>       assert var_2.next is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:27: AssertionError

   - [#  37] COI queue3: 
--------------------------------------------------------------------------------
  189:         
  190:         return self.__queue.__str__()
  191: 
  192: 
- 193: if __name__ == '__main__':
+ 193: if not (__name__ == '__main__'):
  194:     pass
--------------------------------------------------------------------------------
[0.06583 s] survived

   - [#  38] CRP queue3: 
--------------------------------------------------------------------------------
    1: '''In computer science, a queue is a collection of entities that are maintained in a sequence and can be modified by the addition of entities at one end of the sequence and the removal of entities from the other end of the sequence.'''
    2: 
    3: from typing import TypeVar
    4: 
-   5: T = TypeVar('T')
+   5: T = TypeVar('mutpy')
    6: 
    7: class Node:
    8:     def __init__(self, value: T):
    9:         self.value = value
--------------------------------------------------------------------------------
[0.06529 s] survived

   - [#  39] CRP queue3: 
--------------------------------------------------------------------------------
    1: '''In computer science, a queue is a collection of entities that are maintained in a sequence and can be modified by the addition of entities at one end of the sequence and the removal of entities from the other end of the sequence.'''
    2: 
    3: from typing import TypeVar
    4: 
-   5: T = TypeVar('T')
+   5: T = TypeVar('')
    6: 
    7: class Node:
    8:     def __init__(self, value: T):
    9:         self.value = value
--------------------------------------------------------------------------------
[0.08896 s] survived

   - [#  41] CRP queue3: 
--------------------------------------------------------------------------------
   21:     def addAtHead(self, value: T) -> None:
   22:         
   23:         '''Add node at head end.'''
   24:         
-  25:         if self.__size == 0:
+  25:         if self.__size == 1:
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
--------------------------------------------------------------------------------
[0.07490 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
>       none_type_0 = doubly_linked_list_0.addAtHead(var_2)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a4183f10>, value = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

queue3:37: AttributeError

   - [#  55] CRP queue3: 
--------------------------------------------------------------------------------
  102:     def isEmpty(self) -> bool:
  103:         
  104:         '''Check if linkedlist is empty'''
  105:         
- 106:         return True if self.__size == 0 else False
+ 106:         return True if self.__size == 1 else False
  107:     
  108:     def getHead(self):
  109:         
  110:         '''Get value at the front end of the list.'''
--------------------------------------------------------------------------------
[0.07382 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
>       assert bool_0 is True
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:16: AssertionError

   - [#  59] OIL queue3: 
--------------------------------------------------------------------------------
  140:         current = self.__head.next
  141:         while current:
  142:             arr.append(current.value)
  143:             current = current.next
- 144:         return str(arr)
- 145: 
+ 144:             break
+ 145:         return str(arr)
  146: class Queue:
  147:     def __init__(self):
  148:         self.__queue = DoublyLinkedList()
  149:     
--------------------------------------------------------------------------------
[0.06360 s] survived

   - [#  60] ROR queue3: 
--------------------------------------------------------------------------------
   21:     def addAtHead(self, value: T) -> None:
   22:         
   23:         '''Add node at head end.'''
   24:         
-  25:         if self.__size == 0:
+  25:         if self.__size != 0:
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
--------------------------------------------------------------------------------
[0.07489 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
>       none_type_0 = doubly_linked_list_0.addAtHead(var_2)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a4222020>, value = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

queue3:37: AttributeError

   - [#  66] ROR queue3: 
--------------------------------------------------------------------------------
  102:     def isEmpty(self) -> bool:
  103:         
  104:         '''Check if linkedlist is empty'''
  105:         
- 106:         return True if self.__size == 0 else False
+ 106:         return True if self.__size != 0 else False
  107:     
  108:     def getHead(self):
  109:         
  110:         '''Get value at the front end of the list.'''
--------------------------------------------------------------------------------
[0.07436 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
>       assert bool_0 is True
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:16: AssertionError

   - [#  68] ROR queue3: 
--------------------------------------------------------------------------------
  189:         
  190:         return self.__queue.__str__()
  191: 
  192: 
- 193: if __name__ == '__main__':
+ 193: if __name__ != '__main__':
  194:     pass
--------------------------------------------------------------------------------
[0.06515 s] survived

   - [#  90] SDL queue3: 
--------------------------------------------------------------------------------
    5: T = TypeVar('T')
    6: 
    7: class Node:
    8:     def __init__(self, value: T):
-   9:         self.value = value
+   9:         pass
   10:         self.next = None
   11:         self.prev = None
   12: 
   13: 
--------------------------------------------------------------------------------
[0.07475 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
>       var_0 = doubly_linked_list_0.getTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3ce6aa0>

>   ???
E   AttributeError: 'Node' object has no attribute 'value'

queue3:121: AttributeError

   - [#  91] SDL queue3: 
--------------------------------------------------------------------------------
    6: 
    7: class Node:
    8:     def __init__(self, value: T):
    9:         self.value = value
-  10:         self.next = None
+  10:         pass
   11:         self.prev = None
   12: 
   13: 
   14: class DoublyLinkedList:
--------------------------------------------------------------------------------
[0.09677 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:190: in __str__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3e111b0>

>   ???
E   AttributeError: 'Node' object has no attribute 'next'

queue3:140: AttributeError

   - [#  92] SDL queue3: 
--------------------------------------------------------------------------------
    7: class Node:
    8:     def __init__(self, value: T):
    9:         self.value = value
   10:         self.next = None
-  11:         self.prev = None
+  11:         pass
   12: 
   13: 
   14: class DoublyLinkedList:
   15:     def __init__(self):
--------------------------------------------------------------------------------
[0.06535 s] survived

   - [#  93] SDL queue3: 
--------------------------------------------------------------------------------
   12: 
   13: 
   14: class DoublyLinkedList:
   15:     def __init__(self):
-  16:         self.__sentinel = Node(None)
+  16:         pass
   17:         self.__head = self.__sentinel
   18:         self.__tail = self.__sentinel
   19:         self.__size = 0
   20:     
--------------------------------------------------------------------------------
[0.07367 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
>       doubly_linked_list_0 = module_0.DoublyLinkedList()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:6: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3ded300>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute '_DoublyLinkedList__sentinel'

queue3:17: AttributeError

   - [#  94] SDL queue3: 
--------------------------------------------------------------------------------
   13: 
   14: class DoublyLinkedList:
   15:     def __init__(self):
   16:         self.__sentinel = Node(None)
-  17:         self.__head = self.__sentinel
+  17:         pass
   18:         self.__tail = self.__sentinel
   19:         self.__size = 0
   20:     
   21:     def addAtHead(self, value: T) -> None:
--------------------------------------------------------------------------------
[0.10683 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:190: in __str__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fc52d0>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute '_DoublyLinkedList__head'. Did you mean: '_DoublyLinkedList__size'?

queue3:140: AttributeError

   - [#  95] SDL queue3: 
--------------------------------------------------------------------------------
   14: class DoublyLinkedList:
   15:     def __init__(self):
   16:         self.__sentinel = Node(None)
   17:         self.__head = self.__sentinel
-  18:         self.__tail = self.__sentinel
+  18:         pass
   19:         self.__size = 0
   20:     
   21:     def addAtHead(self, value: T) -> None:
   22:         
--------------------------------------------------------------------------------
[0.07216 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
>       var_0 = doubly_linked_list_0.getTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3d78730>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute '_DoublyLinkedList__tail'. Did you mean: '_DoublyLinkedList__head'?

queue3:121: AttributeError

   - [#  96] SDL queue3: 
--------------------------------------------------------------------------------
   15:     def __init__(self):
   16:         self.__sentinel = Node(None)
   17:         self.__head = self.__sentinel
   18:         self.__tail = self.__sentinel
-  19:         self.__size = 0
+  19:         pass
   20:     
   21:     def addAtHead(self, value: T) -> None:
   22:         
   23:         '''Add node at head end.'''
--------------------------------------------------------------------------------
[0.07232 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3eb96f0>

>   ???
E   AttributeError: 'DoublyLinkedList' object has no attribute '_DoublyLinkedList__size'. Did you mean: '_DoublyLinkedList__head'?

queue3:133: AttributeError

   - [#  97] SDL queue3: 
--------------------------------------------------------------------------------
   22:         
   23:         '''Add node at head end.'''
   24:         
   25:         if self.__size == 0:
-  26:             newNode = Node(value)
+  26:             pass
   27:             self.__sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
   30:             self.__size += 1
--------------------------------------------------------------------------------
[0.07587 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
>       none_type_0 = doubly_linked_list_0.addAtHead(var_2)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3d05c30>, value = None

>   ???
E   UnboundLocalError: local variable 'newNode' referenced before assignment

queue3:27: UnboundLocalError
