   - [#  98] SDL queue3: 
--------------------------------------------------------------------------------
   23:         '''Add node at head end.'''
   24:         
   25:         if self.__size == 0:
   26:             newNode = Node(value)
-  27:             self.__sentinel.next = newNode
+  27:             pass
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
   30:             self.__size += 1
   31:         else:
--------------------------------------------------------------------------------
[0.07822 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
        none_type_0 = doubly_linked_list_0.addAtHead(var_2)
        assert len(doubly_linked_list_0) == 1
>       var_3 = doubly_linked_list_0.getHead()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:73: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a4182200>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

queue3:115: AttributeError

   - [#  99] SDL queue3: 
--------------------------------------------------------------------------------
   24:         
   25:         if self.__size == 0:
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
-  28:             newNode.prev = self.__sentinel
+  28:             pass
   29:             self.__tail = newNode
   30:             self.__size += 1
   31:         else:
   32:             newNode = Node(value)
--------------------------------------------------------------------------------
[0.06465 s] survived

   - [# 100] SDL queue3: 
--------------------------------------------------------------------------------
   25:         if self.__size == 0:
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
-  29:             self.__tail = newNode
+  29:             pass
   30:             self.__size += 1
   31:         else:
   32:             newNode = Node(value)
   33:             nextNode = self.__sentinel.next
--------------------------------------------------------------------------------
[0.08329 s] killed by MIO-WHOLE_SUITE/test_queue3_MIO.py::test_case_8

def test_case_8():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        none_type_0 = doubly_linked_list_0.addAtHead(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_0 = doubly_linked_list_0.removeAtTail()
        assert len(doubly_linked_list_0) == 0
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'queue3.Node'
>       assert f'{type(var_0.value).__module__}.{type(var_0.value).__qualname__}' == 'queue3.DoublyLinkedList'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_MIO.py:62: AssertionError

   - [# 101] SDL queue3: 
--------------------------------------------------------------------------------
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
   30:             self.__size += 1
   31:         else:
-  32:             newNode = Node(value)
+  32:             pass
   33:             nextNode = self.__sentinel.next
   34:             self.__sentinel.next = newNode
   35:             newNode.prev = self.__sentinel
   36:             newNode.next = nextNode
--------------------------------------------------------------------------------
[0.08061 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
        assert var_1.prev is None
>       none_type_3 = doubly_linked_list_1.addAtHead(str_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:214: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3

   - [# 102] SDL queue3: 
--------------------------------------------------------------------------------
   29:             self.__tail = newNode
   30:             self.__size += 1
   31:         else:
   32:             newNode = Node(value)
-  33:             nextNode = self.__sentinel.next
+  33:             pass
   34:             self.__sentinel.next = newNode
   35:             newNode.prev = self.__sentinel
   36:             newNode.next = nextNode
   37:             nextNode.prev = newNode
--------------------------------------------------------------------------------
[0.08080 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
        assert var_1.prev is None
>       none_type_3 = doubly_linked_list_1.addAtHead(str_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:214: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Doubly

   - [# 103] SDL queue3: 
--------------------------------------------------------------------------------
   30:             self.__size += 1
   31:         else:
   32:             newNode = Node(value)
   33:             nextNode = self.__sentinel.next
-  34:             self.__sentinel.next = newNode
+  34:             pass
   35:             newNode.prev = self.__sentinel
   36:             newNode.next = nextNode
   37:             nextNode.prev = newNode
   38:             self.__size += 1
--------------------------------------------------------------------------------
[0.06695 s] survived

   - [# 105] SDL queue3: 
--------------------------------------------------------------------------------
   32:             newNode = Node(value)
   33:             nextNode = self.__sentinel.next
   34:             self.__sentinel.next = newNode
   35:             newNode.prev = self.__sentinel
-  36:             newNode.next = nextNode
+  36:             pass
   37:             nextNode.prev = newNode
   38:             self.__size += 1
   39:     
   40:     def addAtTail(self, value: T) -> None:
--------------------------------------------------------------------------------
[0.06479 s] survived

   - [# 106] SDL queue3: 
--------------------------------------------------------------------------------
   33:             nextNode = self.__sentinel.next
   34:             self.__sentinel.next = newNode
   35:             newNode.prev = self.__sentinel
   36:             newNode.next = nextNode
-  37:             nextNode.prev = newNode
+  37:             pass
   38:             self.__size += 1
   39:     
   40:     def addAtTail(self, value: T) -> None:
   41:         
--------------------------------------------------------------------------------
[0.06702 s] survived

   - [# 112] SDL queue3: 
--------------------------------------------------------------------------------
   48:             self.__tail = newNode
   49:             self.__size += 1
   50:         else:
   51:             newNode = Node(value)
-  52:             self.__tail.next = newNode
+  52:             pass
   53:             newNode.prev = self.__tail
   54:             self.__tail = newNode
   55:             self.__size += 1
   56:     
--------------------------------------------------------------------------------
[0.07475 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3ebcd00>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

   - [# 113] SDL queue3: 
--------------------------------------------------------------------------------
   49:             self.__size += 1
   50:         else:
   51:             newNode = Node(value)
   52:             self.__tail.next = newNode
-  53:             newNode.prev = self.__tail
+  53:             pass
   54:             self.__tail = newNode
   55:             self.__size += 1
   56:     
   57:     def removeAtHead(self):
--------------------------------------------------------------------------------
[0.07969 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
>       var_1 = doubly_linked_list_1.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:208: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3d6bdc0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue3:97: AttributeError

   - [# 114] SDL queue3: 
--------------------------------------------------------------------------------
   50:         else:
   51:             newNode = Node(value)
   52:             self.__tail.next = newNode
   53:             newNode.prev = self.__tail
-  54:             self.__tail = newNode
+  54:             pass
   55:             self.__size += 1
   56:     
   57:     def removeAtHead(self):
   58:         
--------------------------------------------------------------------------------
[0.08082 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
>       assert var_1.value is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:211: AssertionError

   - [# 115] SDL queue3: 
--------------------------------------------------------------------------------
   58:         
   59:         '''Remove node at head end.'''
   60:         
   61:         if self.__size == 0:
-  62:             return None
+  62:             pass
   63:         elif self.__size == 1:
   64:             nodeToRemove = self.__head.next
   65:             self.__sentinel.next = None
   66:             nodeToRemove.prev = None
--------------------------------------------------------------------------------
[0.06533 s] survived

   - [# 116] SDL queue3: 
--------------------------------------------------------------------------------
   60:         
   61:         if self.__size == 0:
   62:             return None
   63:         elif self.__size == 1:
-  64:             nodeToRemove = self.__head.next
+  64:             pass
   65:             self.__sentinel.next = None
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
   68:             return nodeToRemove
--------------------------------------------------------------------------------
[0.07588 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
        bool_0 = queue_1.isEmpty()
        assert bool_0 is True
        none_type_0 = None
        none_type_1 = queue_1.enqueue(none_type_0)
        none_type_2 = queue_0.enqueue(queue_1)
>       var_1 = queue_1.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3f08c40>

>   ???
E   UnboundLocalError: local variable 'nodeToRemove' referenced before assignment

queue3:66: UnboundLocalError

   - [# 117] SDL queue3: 
--------------------------------------------------------------------------------
   61:         if self.__size == 0:
   62:             return None
   63:         elif self.__size == 1:
   64:             nodeToRemove = self.__head.next
-  65:             self.__sentinel.next = None
+  65:             pass
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
   68:             return nodeToRemove
   69:         else:
--------------------------------------------------------------------------------
[0.06633 s] survived

   - [# 118] SDL queue3: 
--------------------------------------------------------------------------------
   62:             return None
   63:         elif self.__size == 1:
   64:             nodeToRemove = self.__head.next
   65:             self.__sentinel.next = None
-  66:             nodeToRemove.prev = None
+  66:             pass
   67:             self.__size -= 1
   68:             return nodeToRemove
   69:         else:
   70:             nodeToRemove = self.__head.next
--------------------------------------------------------------------------------
[0.07733 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
        bool_0 = queue_1.isEmpty()
        assert bool_0 is True
        none_type_0 = None
        none_type_1 = queue_1.enqueue(none_type_0)
        none_type_2 = queue_0.enqueue(queue_1)
        var_1 = queue_1.dequeue()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
>       assert var_1.prev is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:44: AssertionError

   - [# 119] SDL queue3: 
--------------------------------------------------------------------------------
   64:             nodeToRemove = self.__head.next
   65:             self.__sentinel.next = None
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
-  68:             return nodeToRemove
+  68:             pass
   69:         else:
   70:             nodeToRemove = self.__head.next
   71:             nextNode = nodeToRemove.next
   72:             self.__sentinel.next = nextNode
--------------------------------------------------------------------------------
[0.07463 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
        bool_0 = queue_1.isEmpty()
        assert bool_0 is True
        none_type_0 = None
        none_type_1 = queue_1.enqueue(none_type_0)
        none_type_2 = queue_0.enqueue(queue_1)
        var_1 = queue_1.dequeue()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:41: AssertionError

   - [# 120] SDL queue3: 
--------------------------------------------------------------------------------
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
   68:             return nodeToRemove
   69:         else:
-  70:             nodeToRemove = self.__head.next
+  70:             pass
   71:             nextNode = nodeToRemove.next
   72:             self.__sentinel.next = nextNode
   73:             nextNode.prev = self.__sentinel
   74:             nodeToRemove.next = None
--------------------------------------------------------------------------------
[0.07481 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fd5060>

>   ???
E   UnboundLocalError: local variable 'nodeToRemov

   - [# 121] SDL queue3: 
--------------------------------------------------------------------------------
   67:             self.__size -= 1
   68:             return nodeToRemove
   69:         else:
   70:             nodeToRemove = self.__head.next
-  71:             nextNode = nodeToRemove.next
+  71:             pass
   72:             self.__sentinel.next = nextNode
   73:             nextNode.prev = self.__sentinel
   74:             nodeToRemove.next = None
   75:             nodeToRemove.prev = None
--------------------------------------------------------------------------------
[0.07403 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3b6e170>

>   ???
E   NameError: name 'nextNode' is not defined

   - [# 122] SDL queue3: 
--------------------------------------------------------------------------------
   68:             return nodeToRemove
   69:         else:
   70:             nodeToRemove = self.__head.next
   71:             nextNode = nodeToRemove.next
-  72:             self.__sentinel.next = nextNode
+  72:             pass
   73:             nextNode.prev = self.__sentinel
   74:             nodeToRemove.next = None
   75:             nodeToRemove.prev = None
   76:             self.__size -= 1
--------------------------------------------------------------------------------
[0.06476 s] survived

   - [# 123] SDL queue3: 
--------------------------------------------------------------------------------
   69:         else:
   70:             nodeToRemove = self.__head.next
   71:             nextNode = nodeToRemove.next
   72:             self.__sentinel.next = nextNode
-  73:             nextNode.prev = self.__sentinel
+  73:             pass
   74:             nodeToRemove.next = None
   75:             nodeToRemove.prev = None
   76:             self.__size -= 1
   77:             return nodeToRemove
--------------------------------------------------------------------------------
[0.06687 s] survived

   - [# 124] SDL queue3: 
--------------------------------------------------------------------------------
   70:             nodeToRemove = self.__head.next
   71:             nextNode = nodeToRemove.next
   72:             self.__sentinel.next = nextNode
   73:             nextNode.prev = self.__sentinel
-  74:             nodeToRemove.next = None
+  74:             pass
   75:             nodeToRemove.prev = None
   76:             self.__size -= 1
   77:             return nodeToRemove
   78:     
--------------------------------------------------------------------------------
[0.09315 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
        var_2 = queue_0.dequeue()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Node'
        assert f'{type(var_2.value).__module__}.{type(var_2.value).__qualname__}' == 'builtins.dict'
        assert len(var_2.value) == 3
>       assert var_2.next is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:27: AssertionError

   - [# 125] SDL queue3: 
--------------------------------------------------------------------------------
   71:             nextNode = nodeToRemove.next
   72:             self.__sentinel.next = nextNode
   73:             nextNode.prev = self.__sentinel
   74:             nodeToRemove.next = None
-  75:             nodeToRemove.prev = None
+  75:             pass
   76:             self.__size -= 1
   77:             return nodeToRemove
   78:     
   79:     def removeAtTail(self):
--------------------------------------------------------------------------------
[0.07706 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
        var_2 = queue_0.dequeue()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Node'
        assert f'{type(var_2.value).__module__}.{type(var_2.value).__qualname__}' == 'builtins.dict'
        assert len(var_2.value) == 3
        assert var_2.next is None
>       assert var_2.prev is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:28: AssertionError

   - [# 128] SDL queue3: 
--------------------------------------------------------------------------------
   82:         
   83:         if self.__size == 0:
   84:             return None
   85:         elif self.__size == 1:
-  86:             nodeToRemove = self.__tail
+  86:             pass
   87:             nodeToRemove.prev = None
   88:             self.__sentinel.next = None
   89:             self.__head = self.__sentinel
   90:             self.__tail = self.__sentinel
--------------------------------------------------------------------------------
[0.07849 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8

def test_case_8():
        bool_0 = True
        queue_0 = module_0.Queue()
        var_0 = queue_0.dequeue()
        none_type_0 = queue_0.enqueue(bool_0)
        str_0 = queue_0.__str__()
        assert str_0 == '[True]'
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        none_type_1 = doubly_linked_list_0.addAtTail(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.getTail()
        assert len(var_1) == 1
        var_2 = doubly_linked_list_0.getTail()
        assert len(var_2) == 1
>       var_3 = doubly_linked_list_0.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:151: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3c89210>

>   ???
E   UnboundLocalError: local variable 'nodeToRemove' referenced before assignment

queue3:87: UnboundLocalError
