   - [# 129] SDL queue3: 
--------------------------------------------------------------------------------
   83:         if self.__size == 0:
   84:             return None
   85:         elif self.__size == 1:
   86:             nodeToRemove = self.__tail
-  87:             nodeToRemove.prev = None
+  87:             pass
   88:             self.__sentinel.next = None
   89:             self.__head = self.__sentinel
   90:             self.__tail = self.__sentinel
   91:             self.__size -= 1
--------------------------------------------------------------------------------
[0.07942 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8

def test_case_8():
        bool_0 = True
        queue_0 = module_0.Queue()
        var_0 = queue_0.dequeue()
        none_type_0 = queue_0.enqueue(bool_0)
        str_0 = queue_0.__str__()
        assert str_0 == '[True]'
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        none_type_1 = doubly_linked_list_0.addAtTail(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.getTail()
        assert len(var_1) == 1
        var_2 = doubly_linked_list_0.getTail()
        assert len(var_2) == 1
        var_3 = doubly_linked_list_0.removeAtTail()
        assert len(doubly_linked_list_0) == 0
        assert len(var_1) == 0
        assert len(var_2) == 0
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'queue3.Node'
        assert f'{type(var_3.value).__module__}.{type(var_3.value).__qualname__}' == 'queue3.DoublyLinkedList'
        assert len(var_3.value) == 0
        assert var_3.next is None
>       assert var_3.prev is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:159: AssertionError

   - [# 130] SDL queue3: 
--------------------------------------------------------------------------------
   84:             return None
   85:         elif self.__size == 1:
   86:             nodeToRemove = self.__tail
   87:             nodeToRemove.prev = None
-  88:             self.__sentinel.next = None
+  88:             pass
   89:             self.__head = self.__sentinel
   90:             self.__tail = self.__sentinel
   91:             self.__size -= 1
   92:             return nodeToRemove
--------------------------------------------------------------------------------
[0.06552 s] survived

   - [# 131] SDL queue3: 
--------------------------------------------------------------------------------
   85:         elif self.__size == 1:
   86:             nodeToRemove = self.__tail
   87:             nodeToRemove.prev = None
   88:             self.__sentinel.next = None
-  89:             self.__head = self.__sentinel
+  89:             pass
   90:             self.__tail = self.__sentinel
   91:             self.__size -= 1
   92:             return nodeToRemove
   93:         else:
--------------------------------------------------------------------------------
[0.06474 s] survived

   - [# 134] SDL queue3: 
--------------------------------------------------------------------------------
   90:             self.__tail = self.__sentinel
   91:             self.__size -= 1
   92:             return nodeToRemove
   93:         else:
-  94:             nodeToRemove = self.__tail
+  94:             pass
   95:             previous = nodeToRemove.prev
   96:             nodeToRemove.prev = None
   97:             previous.next = None
   98:             self.__tail = previous
--------------------------------------------------------------------------------
[0.07922 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
>       var_1 = doubly_linked_list_1.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:208: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3e25420>

>   ???
E   UnboundLocalError: local variable 'nodeToRemove' referenced before assignment

queue3:95: UnboundLocalError

   - [# 135] SDL queue3: 
--------------------------------------------------------------------------------
   91:             self.__size -= 1
   92:             return nodeToRemove
   93:         else:
   94:             nodeToRemove = self.__tail
-  95:             previous = nodeToRemove.prev
+  95:             pass
   96:             nodeToRemove.prev = None
   97:             previous.next = None
   98:             self.__tail = previous
   99:             self.__size -= 1
--------------------------------------------------------------------------------
[0.08123 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
>       var_1 = doubly_linked_list_1.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:208: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a424bbe0>

>   ???
E   NameError: name 'previous' is not defined

queue3:97: NameError

   - [# 136] SDL queue3: 
--------------------------------------------------------------------------------
   92:             return nodeToRemove
   93:         else:
   94:             nodeToRemove = self.__tail
   95:             previous = nodeToRemove.prev
-  96:             nodeToRemove.prev = None
+  96:             pass
   97:             previous.next = None
   98:             self.__tail = previous
   99:             self.__size -= 1
  100:             return nodeToRemove
--------------------------------------------------------------------------------
[0.08038 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
>       assert var_1.prev is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:213: AssertionError

   - [# 137] SDL queue3: 
--------------------------------------------------------------------------------
   93:         else:
   94:             nodeToRemove = self.__tail
   95:             previous = nodeToRemove.prev
   96:             nodeToRemove.prev = None
-  97:             previous.next = None
+  97:             pass
   98:             self.__tail = previous
   99:             self.__size -= 1
  100:             return nodeToRemove
  101:     
--------------------------------------------------------------------------------
[0.06452 s] survived

   - [# 138] SDL queue3: 
--------------------------------------------------------------------------------
   94:             nodeToRemove = self.__tail
   95:             previous = nodeToRemove.prev
   96:             nodeToRemove.prev = None
   97:             previous.next = None
-  98:             self.__tail = previous
+  98:             pass
   99:             self.__size -= 1
  100:             return nodeToRemove
  101:     
  102:     def isEmpty(self) -> bool:
--------------------------------------------------------------------------------
[0.08003 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
        assert var_1.prev is None
        none_type_3 = doubly_linked_list_1.addAtHead(str_0)
        assert len(doubly_linked_list_1) == 2
        var_2 = doubly_linked_list_1.getTail()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.DoublyLink

   - [# 140] SDL queue3: 
--------------------------------------------------------------------------------
  102:     def isEmpty(self) -> bool:
  103:         
  104:         '''Check if linkedlist is empty'''
  105:         
- 106:         return True if self.__size == 0 else False
+ 106:         pass
  107:     
  108:     def getHead(self):
  109:         
  110:         '''Get value at the front end of the list.'''
--------------------------------------------------------------------------------
[0.07420 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
>       assert bool_0 is True
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:16: AssertionError

   - [# 142] SDL queue3: 
--------------------------------------------------------------------------------
  111:         
  112:         if self.__size == 0:
  113:             return None
  114:         else:
- 115:             return self.__head.next.value
+ 115:             pass
  116:     
  117:     def getTail(self) -> T:
  118:         
  119:         '''Get value at the tail of the list.'''
--------------------------------------------------------------------------------
[0.07533 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        none_type_0 = queue_0.enqueue(queue_0)
        queue_1 = module_0.Queue()
        var_0 = queue_1.getTail()
        node_0 = module_0.Node(queue_0)
        var_1 = queue_0.getHead()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Queue'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:53: AssertionError

   - [# 143] SDL queue3: 
--------------------------------------------------------------------------------
  117:     def getTail(self) -> T:
  118:         
  119:         '''Get value at the tail of the list.'''
  120:         
- 121:         return self.__tail.value
+ 121:         pass
  122:     
  123:     def getSize(self) -> int:
  124:         
  125:         '''Get length of the linked list.'''
--------------------------------------------------------------------------------
[0.07720 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        none_type_0 = queue_0.enqueue(queue_0)
        queue_1 = module_0.Queue()
        var_0 = queue_1.getTail()
        node_0 = module_0.Node(queue_0)
        var_1 = queue_0.getHead()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Queue'
        var_2 = var_1.getTail()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Queue'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:55: AssertionError

   - [# 144] SDL queue3: 
--------------------------------------------------------------------------------
  123:     def getSize(self) -> int:
  124:         
  125:         '''Get length of the linked list.'''
  126:         
- 127:         return self.__size
+ 127:         pass
  128:     
  129:     def __len__(self) -> int:
  130:         
  131:         '''Get length of the linked list.'''
--------------------------------------------------------------------------------
[0.09851 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_5

def test_case_5():
        none_type_0 = None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        int_0 = queue_0.getSize()
>       assert int_0 == 0
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:87: AssertionError

   - [# 146] SDL queue3: 
--------------------------------------------------------------------------------
  135:     def __str__(self) -> str:
  136:         
  137:         '''Return String representation of linkedlist values.'''
  138:         
- 139:         arr = []
+ 139:         pass
  140:         current = self.__head.next
  141:         while current:
  142:             arr.append(current.value)
  143:             current = current.next
--------------------------------------------------------------------------------
[0.07524 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:190: in __str__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fc54e0>

>   ???
E   NameError: name 'arr' is not defined

queue3:144: NameError

   - [# 147] SDL queue3: 
--------------------------------------------------------------------------------
  136:         
  137:         '''Return String representation of linkedlist values.'''
  138:         
  139:         arr = []
- 140:         current = self.__head.next
+ 140:         pass
  141:         while current:
  142:             arr.append(current.value)
  143:             current = current.next
  144:         return str(arr)
--------------------------------------------------------------------------------
[0.07492 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:190: in __str__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3b6df00>

>   ???
E   UnboundLocalError: local variable 'current' referenced before assignment

queue3:141: UnboundLocalError

   - [# 148] SDL queue3: 
--------------------------------------------------------------------------------
  138:         
  139:         arr = []
  140:         current = self.__head.next
  141:         while current:
- 142:             arr.append(current.value)
+ 142:             pass
  143:             current = current.next
  144:         return str(arr)
  145: 
  146: class Queue:
--------------------------------------------------------------------------------
[0.07782 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7

def test_case_7():
        bool_0 = False
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = queue_0.enqueue(bool_0)
        str_1 = queue_0.__str__()
>       assert str_1 == '[False]'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:105: AssertionError

   - [# 149] SDL queue3: 
--------------------------------------------------------------------------------
  139:         arr = []
  140:         current = self.__head.next
  141:         while current:
  142:             arr.append(current.value)
- 143:             current = current.next
+ 143:             pass
  144:         return str(arr)
  145: 
  146: class Queue:
  147:     def __init__(self):
--------------------------------------------------------------------------------
[5.00638 s] timeout

   - [# 150] SDL queue3: 
--------------------------------------------------------------------------------
  140:         current = self.__head.next
  141:         while current:
  142:             arr.append(current.value)
  143:             current = current.next
- 144:         return str(arr)
+ 144:         pass
  145: 
  146: class Queue:
  147:     def __init__(self):
  148:         self.__queue = DoublyLinkedList()
--------------------------------------------------------------------------------
[0.07408 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
>       assert str_0 == '[]'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:10: AssertionError

   - [# 151] SDL queue3: 
--------------------------------------------------------------------------------
  144:         return str(arr)
  145: 
  146: class Queue:
  147:     def __init__(self):
- 148:         self.__queue = DoublyLinkedList()
+ 148:         pass
  149:     
  150:     def getHead(self) -> T:
  151:         
  152:         '''View first element in the queue.'''
--------------------------------------------------------------------------------
[0.07540 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a4183f10>

>   ???
E   AttributeError: 'Queue' object has no attribute '_Queue__queue'

queue3:190: AttributeError

   - [# 152] SDL queue3: 
--------------------------------------------------------------------------------
  150:     def getHead(self) -> T:
  151:         
  152:         '''View first element in the queue.'''
  153:         
- 154:         return self.__queue.getHead()
+ 154:         pass
  155:     
  156:     def getTail(self):
  157:         
  158:         '''View last element in the queue.'''
--------------------------------------------------------------------------------
[0.07591 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        none_type_0 = queue_0.enqueue(queue_0)
        queue_1 = module_0.Queue()
        var_0 = queue_1.getTail()
        node_0 = module_0.Node(queue_0)
        var_1 = queue_0.getHead()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Queue'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:53: AssertionError

   - [# 153] SDL queue3: 
--------------------------------------------------------------------------------
  156:     def getTail(self):
  157:         
  158:         '''View last element in the queue.'''
  159:         
- 160:         return self.__queue.getTail()
+ 160:         pass
  161:     
  162:     def dequeue(self) -> T:
  163:         
  164:         '''Remove element from the queue.'''
--------------------------------------------------------------------------------
[0.07510 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        none_type_0 = queue_0.enqueue(queue_0)
        queue_1 = module_0.Queue()
        var_0 = queue_1.getTail()
        node_0 = module_0.Node(queue_0)
        var_1 = queue_0.getHead()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Queue'
        var_2 = var_1.getTail()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Queue'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:55: AssertionError

   - [# 154] SDL queue3: 
--------------------------------------------------------------------------------
  162:     def dequeue(self) -> T:
  163:         
  164:         '''Remove element from the queue.'''
  165:         
- 166:         return self.__queue.removeAtHead()
+ 166:         pass
  167:     
  168:     def enqueue(self, value: T) -> None:
  169:         
  170:         '''Add element to queue.'''
--------------------------------------------------------------------------------
[0.07403 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
        var_2 = queue_0.dequeue()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Node'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:24: AssertionError

   - [# 155] SDL queue3: 
--------------------------------------------------------------------------------
  168:     def enqueue(self, value: T) -> None:
  169:         
  170:         '''Add element to queue.'''
  171:         
- 172:         self.__queue.addAtTail(value)
+ 172:         pass
  173:     
  174:     def getSize(self) -> int:
  175:         
  176:         '''Get size of the queue.'''
--------------------------------------------------------------------------------
[0.07498 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
        var_2 = queue_0.dequeue()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue3.Node'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:24: AssertionError

   - [# 156] SDL queue3: 
--------------------------------------------------------------------------------
  174:     def getSize(self) -> int:
  175:         
  176:         '''Get size of the queue.'''
  177:         
- 178:         return self.__queue.getSize()
+ 178:         pass
  179:     
  180:     def isEmpty(self) -> bool:
  181:         
  182:         '''Check if queue is empty.'''
--------------------------------------------------------------------------------
[0.07667 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_5

def test_case_5():
        none_type_0 = None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        int_0 = queue_0.getSize()
>       assert int_0 == 0
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:87: AssertionError

   - [# 157] SDL queue3: 
--------------------------------------------------------------------------------
  180:     def isEmpty(self) -> bool:
  181:         
  182:         '''Check if queue is empty.'''
  183:         
- 184:         return self.__queue.isEmpty()
+ 184:         pass
  185:     
  186:     def __str__(self) -> str:
  187:         
  188:         '''Get string representation of the queue.'''
--------------------------------------------------------------------------------
[0.07468 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
        bool_0 = queue_1.isEmpty()
>       assert bool_0 is True
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:36: AssertionError

   - [# 158] SDL queue3: 
--------------------------------------------------------------------------------
  186:     def __str__(self) -> str:
  187:         
  188:         '''Get string representation of the queue.'''
  189:         
- 190:         return self.__queue.__str__()
+ 190:         pass
  191: 
  192: 
  193: if __name__ == '__main__':
  194:     pass
--------------------------------------------------------------------------------
[0.07374 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
>       assert str_0 == '[]'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:10: AssertionError

   - [# 164] SVD queue3: 
--------------------------------------------------------------------------------
   13: 
   14: class DoublyLinkedList:
   15:     def __init__(self):
   16:         self.__sentinel = Node(None)
-  17:         self.__head = self.__sentinel
+  17:         self.__head = __sentinel
   18:         self.__tail = self.__sentinel
   19:         self.__size = 0
   20:     
   21:     def addAtHead(self, value: T) -> None:
--------------------------------------------------------------------------------
[0.09391 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
>       doubly_linked_list_0 = module_0.DoublyLinkedList()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:6: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3b63010>

>   ???
E   NameError: name '_DoublyLinkedList__sentinel' is not defined

queue3:17: NameError

   - [# 166] SVD queue3: 
--------------------------------------------------------------------------------
   14: class DoublyLinkedList:
   15:     def __init__(self):
   16:         self.__sentinel = Node(None)
   17:         self.__head = self.__sentinel
-  18:         self.__tail = self.__sentinel
+  18:         self.__tail = __sentinel
   19:         self.__size = 0
   20:     
   21:     def addAtHead(self, value: T) -> None:
   22:         
--------------------------------------------------------------------------------
[0.07279 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
>       doubly_linked_list_0 = module_0.DoublyLinkedList()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:6: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3ed1210>

>   ???
E   NameError: name '_DoublyLinkedList__sentinel' is not defined

queue3:18: NameError
