   - [# 168] SVD queue3: 
--------------------------------------------------------------------------------
   21:     def addAtHead(self, value: T) -> None:
   22:         
   23:         '''Add node at head end.'''
   24:         
-  25:         if self.__size == 0:
+  25:         if __size == 0:
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
--------------------------------------------------------------------------------
[0.07539 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
>       none_type_0 = doubly_linked_list_0.addAtHead(var_2)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a400c310>, value = None

>   ???
E   NameError: name '_DoublyLinkedList__size' is not defined

queue3:25: NameError

   - [# 169] SVD queue3: 
--------------------------------------------------------------------------------
   23:         '''Add node at head end.'''
   24:         
   25:         if self.__size == 0:
   26:             newNode = Node(value)
-  27:             self.__sentinel.next = newNode
+  27:             __sentinel.next = newNode
   28:             newNode.prev = self.__sentinel
   29:             self.__tail = newNode
   30:             self.__size += 1
   31:         else:
--------------------------------------------------------------------------------
[0.07609 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
>       none_type_0 = doubly_linked_list_0.addAtHead(var_2)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3f3d8a0>, value = None

>   ???
E   NameError: name '_DoublyLinkedList__sentinel' is not defined

queue3:27: NameError

   - [# 170] SVD queue3: 
--------------------------------------------------------------------------------
   24:         
   25:         if self.__size == 0:
   26:             newNode = Node(value)
   27:             self.__sentinel.next = newNode
-  28:             newNode.prev = self.__sentinel
+  28:             newNode.prev = __sentinel
   29:             self.__tail = newNode
   30:             self.__size += 1
   31:         else:
   32:             newNode = Node(value)
--------------------------------------------------------------------------------
[0.07771 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_3

def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        str_0 = doubly_linked_list_0.__str__()
        assert str_0 == '[]'
        var_0 = doubly_linked_list_0.getHead()
        var_1 = doubly_linked_list_0.removeAtTail()
        var_2 = doubly_linked_list_0.removeAtHead()
>       none_type_0 = doubly_linked_list_0.addAtHead(var_2)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:71: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3d24c70>, value = None

>   ???
E   NameError: name '_DoublyLinkedList__sentinel' is not defined

queue3:28: NameError

   - [# 173] SVD queue3: 
--------------------------------------------------------------------------------
   29:             self.__tail = newNode
   30:             self.__size += 1
   31:         else:
   32:             newNode = Node(value)
-  33:             nextNode = self.__sentinel.next
+  33:             nextNode = __sentinel.next
   34:             self.__sentinel.next = newNode
   35:             newNode.prev = self.__sentinel
   36:             newNode.next = nextNode
   37:             nextNode.prev = newNode
--------------------------------------------------------------------------------
[0.07987 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
        assert var_1.prev is None
>       none_type_3 = doubly_linked_list_1.addAtHead(str_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:214: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [# 174] SVD queue3: 
--------------------------------------------------------------------------------
   30:             self.__size += 1
   31:         else:
   32:             newNode = Node(value)
   33:             nextNode = self.__sentinel.next
-  34:             self.__sentinel.next = newNode
+  34:             __sentinel.next = newNode
   35:             newNode.prev = self.__sentinel
   36:             newNode.next = nextNode
   37:             nextNode.prev = newNode
   38:             self.__size += 1
--------------------------------------------------------------------------------
[0.08051 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
        var_1 = doubly_linked_list_1.removeAtTail()
        assert len(doubly_linked_list_1) == 1
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue3.Node'
        assert var_1.value is None
        assert var_1.next is None
        assert var_1.prev is None
>       none_type_3 = doubly_linked_list_1.addAtHead(str_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:214: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self

   - [# 182] SVD queue3: 
--------------------------------------------------------------------------------
   48:             self.__tail = newNode
   49:             self.__size += 1
   50:         else:
   51:             newNode = Node(value)
-  52:             self.__tail.next = newNode
+  52:             __tail.next = newNode
   53:             newNode.prev = self.__tail
   54:             self.__tail = newNode
   55:             self.__size += 1
   56:     
--------------------------------------------------------------------------------
[0.07451 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
>       none_type_2 = queue_0.enqueue(none_type_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:172: in enqueue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3d6a710>, value = None

>   ???
E   NameError: name '_DoublyLinkedList__tail' is not defined

queue3:52: NameError

   - [# 183] SVD queue3: 
--------------------------------------------------------------------------------
   49:             self.__size += 1
   50:         else:
   51:             newNode = Node(value)
   52:             self.__tail.next = newNode
-  53:             newNode.prev = self.__tail
+  53:             newNode.prev = __tail
   54:             self.__tail = newNode
   55:             self.__size += 1
   56:     
   57:     def removeAtHead(self):
--------------------------------------------------------------------------------
[0.07461 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
>       none_type_2 = queue_0.enqueue(none_type_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:172: in enqueue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3d899c0>, value = None

>   ???
E   NameError: name '_DoublyLinkedList__tail' is not defined

queue3:53: NameError

   - [# 187] SVD queue3: 
--------------------------------------------------------------------------------
   59:         '''Remove node at head end.'''
   60:         
   61:         if self.__size == 0:
   62:             return None
-  63:         elif self.__size == 1:
+  63:         elif __size == 1:
   64:             nodeToRemove = self.__head.next
   65:             self.__sentinel.next = None
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
--------------------------------------------------------------------------------
[0.07483 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a4221ea0>

>   ???
E   NameError: name '_DoublyLinkedList__size' is not defined

   - [# 188] SVD queue3: 
--------------------------------------------------------------------------------
   60:         
   61:         if self.__size == 0:
   62:             return None
   63:         elif self.__size == 1:
-  64:             nodeToRemove = self.__head.next
+  64:             nodeToRemove = __head.next
   65:             self.__sentinel.next = None
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
   68:             return nodeToRemove
--------------------------------------------------------------------------------
[0.07528 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
        bool_0 = queue_1.isEmpty()
        assert bool_0 is True
        none_type_0 = None
        none_type_1 = queue_1.enqueue(none_type_0)
        none_type_2 = queue_0.enqueue(queue_1)
>       var_1 = queue_1.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fd77f0>

>   ???
E   NameError: name '_DoublyLinkedList__head' is not defined

queue3:64: NameError

   - [# 189] SVD queue3: 
--------------------------------------------------------------------------------
   61:         if self.__size == 0:
   62:             return None
   63:         elif self.__size == 1:
   64:             nodeToRemove = self.__head.next
-  65:             self.__sentinel.next = None
+  65:             __sentinel.next = None
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
   68:             return nodeToRemove
   69:         else:
--------------------------------------------------------------------------------
[0.07414 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
        bool_0 = queue_1.isEmpty()
        assert bool_0 is True
        none_type_0 = None
        none_type_1 = queue_1.enqueue(none_type_0)
        none_type_2 = queue_0.enqueue(queue_1)
>       var_1 = queue_1.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3aec700>

>   ???
E   NameError: name '_DoublyLinkedList__sentinel' is not defined

queue3:65: NameError

   - [# 191] SVD queue3: 
--------------------------------------------------------------------------------
   66:             nodeToRemove.prev = None
   67:             self.__size -= 1
   68:             return nodeToRemove
   69:         else:
-  70:             nodeToRemove = self.__head.next
+  70:             nodeToRemove = __head.next
   71:             nextNode = nodeToRemove.next
   72:             self.__sentinel.next = nextNode
   73:             nextNode.prev = self.__sentinel
   74:             nodeToRemove.next = None
--------------------------------------------------------------------------------
[0.07453 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fc69b0>

>   ???
E   NameError: name '_Doubly

   - [# 192] SVD queue3: 
--------------------------------------------------------------------------------
   68:             return nodeToRemove
   69:         else:
   70:             nodeToRemove = self.__head.next
   71:             nextNode = nodeToRemove.next
-  72:             self.__sentinel.next = nextNode
+  72:             __sentinel.next = nextNode
   73:             nextNode.prev = self.__sentinel
   74:             nodeToRemove.next = None
   75:             nodeToRemove.prev = None
   76:             self.__size -= 1
--------------------------------------------------------------------------------
[0.07490 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fc5570>

>   ???
E   NameError: name '_Doubly

   - [# 193] SVD queue3: 
--------------------------------------------------------------------------------
   69:         else:
   70:             nodeToRemove = self.__head.next
   71:             nextNode = nodeToRemove.next
   72:             self.__sentinel.next = nextNode
-  73:             nextNode.prev = self.__sentinel
+  73:             nextNode.prev = __sentinel
   74:             nodeToRemove.next = None
   75:             nodeToRemove.prev = None
   76:             self.__size -= 1
   77:             return nodeToRemove
--------------------------------------------------------------------------------
[0.07466 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:166: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3ea00d0>

>   ???
E   NameError: name '_Doubly

   - [# 197] SVD queue3: 
--------------------------------------------------------------------------------
   82:         
   83:         if self.__size == 0:
   84:             return None
   85:         elif self.__size == 1:
-  86:             nodeToRemove = self.__tail
+  86:             nodeToRemove = __tail
   87:             nodeToRemove.prev = None
   88:             self.__sentinel.next = None
   89:             self.__head = self.__sentinel
   90:             self.__tail = self.__sentinel
--------------------------------------------------------------------------------
[0.10099 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8

def test_case_8():
        bool_0 = True
        queue_0 = module_0.Queue()
        var_0 = queue_0.dequeue()
        none_type_0 = queue_0.enqueue(bool_0)
        str_0 = queue_0.__str__()
        assert str_0 == '[True]'
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        none_type_1 = doubly_linked_list_0.addAtTail(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.getTail()
        assert len(var_1) == 1
        var_2 = doubly_linked_list_0.getTail()
        assert len(var_2) == 1
>       var_3 = doubly_linked_list_0.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:151: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3addae0>

>   ???
E   NameError: name '_DoublyLinkedList__tail' is not defined

queue3:86: NameError

   - [# 198] SVD queue3: 
--------------------------------------------------------------------------------
   84:             return None
   85:         elif self.__size == 1:
   86:             nodeToRemove = self.__tail
   87:             nodeToRemove.prev = None
-  88:             self.__sentinel.next = None
+  88:             __sentinel.next = None
   89:             self.__head = self.__sentinel
   90:             self.__tail = self.__sentinel
   91:             self.__size -= 1
   92:             return nodeToRemove
--------------------------------------------------------------------------------
[0.07919 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8

def test_case_8():
        bool_0 = True
        queue_0 = module_0.Queue()
        var_0 = queue_0.dequeue()
        none_type_0 = queue_0.enqueue(bool_0)
        str_0 = queue_0.__str__()
        assert str_0 == '[True]'
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        none_type_1 = doubly_linked_list_0.addAtTail(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.getTail()
        assert len(var_1) == 1
        var_2 = doubly_linked_list_0.getTail()
        assert len(var_2) == 1
>       var_3 = doubly_linked_list_0.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:151: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3f4ad40>

>   ???
E   NameError: name '_DoublyLinkedList__sentinel' is not defined

queue3:88: NameError

   - [# 200] SVD queue3: 
--------------------------------------------------------------------------------
   85:         elif self.__size == 1:
   86:             nodeToRemove = self.__tail
   87:             nodeToRemove.prev = None
   88:             self.__sentinel.next = None
-  89:             self.__head = self.__sentinel
+  89:             self.__head = __sentinel
   90:             self.__tail = self.__sentinel
   91:             self.__size -= 1
   92:             return nodeToRemove
   93:         else:
--------------------------------------------------------------------------------
[0.07882 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_8

def test_case_8():
        bool_0 = True
        queue_0 = module_0.Queue()
        var_0 = queue_0.dequeue()
        none_type_0 = queue_0.enqueue(bool_0)
        str_0 = queue_0.__str__()
        assert str_0 == '[True]'
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        none_type_1 = doubly_linked_list_0.addAtTail(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.getTail()
        assert len(var_1) == 1
        var_2 = doubly_linked_list_0.getTail()
        assert len(var_2) == 1
>       var_3 = doubly_linked_list_0.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:151: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a40c8f70>

>   ???
E   NameError: name '_DoublyLinkedList__sentinel' is not defined

queue3:89: NameError

   - [# 204] SVD queue3: 
--------------------------------------------------------------------------------
   90:             self.__tail = self.__sentinel
   91:             self.__size -= 1
   92:             return nodeToRemove
   93:         else:
-  94:             nodeToRemove = self.__tail
+  94:             nodeToRemove = __tail
   95:             previous = nodeToRemove.prev
   96:             nodeToRemove.prev = None
   97:             previous.next = None
   98:             self.__tail = previous
--------------------------------------------------------------------------------
[0.09996 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_10

def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        none_type_0 = doubly_linked_list_1.addAtTail(doubly_linked_list_1)
        assert len(doubly_linked_list_1) == 1
        none_type_1 = None
        str_0 = doubly_linked_list_1.__str__()
        none_type_2 = doubly_linked_list_1.addAtTail(none_type_0)
        assert len(doubly_linked_list_1) == 2
        str_1 = doubly_linked_list_1.__str__()
        var_0 = doubly_linked_list_1.getTail()
>       var_1 = doubly_linked_list_1.removeAtTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:208: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a4180e80>

>   ???
E   NameError: name '_DoublyLinkedList__tail' is not defined

queue3:94: NameError

   - [# 207] SVD queue3: 
--------------------------------------------------------------------------------
  102:     def isEmpty(self) -> bool:
  103:         
  104:         '''Check if linkedlist is empty'''
  105:         
- 106:         return True if self.__size == 0 else False
+ 106:         return True if __size == 0 else False
  107:     
  108:     def getHead(self):
  109:         
  110:         '''Get value at the front end of the list.'''
--------------------------------------------------------------------------------
[0.07471 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
>       bool_0 = doubly_linked_list_0.isEmpty()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a4222770>

>   ???
E   NameError: name '_DoublyLinkedList__size' is not defined

queue3:106: NameError

   - [# 209] SVD queue3: 
--------------------------------------------------------------------------------
  111:         
  112:         if self.__size == 0:
  113:             return None
  114:         else:
- 115:             return self.__head.next.value
+ 115:             return __head.next.value
  116:     
  117:     def getTail(self) -> T:
  118:         
  119:         '''Get value at the tail of the list.'''
--------------------------------------------------------------------------------
[0.07589 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_2

def test_case_2():
        queue_0 = module_0.Queue()
        none_type_0 = queue_0.enqueue(queue_0)
        queue_1 = module_0.Queue()
        var_0 = queue_1.getTail()
        node_0 = module_0.Node(queue_0)
>       var_1 = queue_0.getHead()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:154: in getHead
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3d982b0>

>   ???
E   NameError: name '_DoublyLinkedList__head' is not defined

queue3:115: NameError
