   - [# 210] SVD queue3: 
--------------------------------------------------------------------------------
  117:     def getTail(self) -> T:
  118:         
  119:         '''Get value at the tail of the list.'''
  120:         
- 121:         return self.__tail.value
+ 121:         return __tail.value
  122:     
  123:     def getSize(self) -> int:
  124:         
  125:         '''Get length of the linked list.'''
--------------------------------------------------------------------------------
[0.07682 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
>       var_0 = doubly_linked_list_0.getTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fd76a0>

>   ???
E   NameError: name '_DoublyLinkedList__tail' is not defined

queue3:121: NameError

   - [# 211] SVD queue3: 
--------------------------------------------------------------------------------
  123:     def getSize(self) -> int:
  124:         
  125:         '''Get length of the linked list.'''
  126:         
- 127:         return self.__size
+ 127:         return __size
  128:     
  129:     def __len__(self) -> int:
  130:         
  131:         '''Get length of the linked list.'''
--------------------------------------------------------------------------------
[0.07739 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_5

def test_case_5():
        none_type_0 = None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       int_0 = queue_0.getSize()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:178: in getSize
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a3fd6ad0>

>   ???
E   NameError: name '_DoublyLinkedList__size' is not defined

queue3:127: NameError

   - [# 213] SVD queue3: 
--------------------------------------------------------------------------------
  136:         
  137:         '''Return String representation of linkedlist values.'''
  138:         
  139:         arr = []
- 140:         current = self.__head.next
+ 140:         current = __head.next
  141:         while current:
  142:             arr.append(current.value)
  143:             current = current.next
  144:         return str(arr)
--------------------------------------------------------------------------------
[0.07522 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue3:190: in __str__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.DoublyLinkedList object at 0x7f33a40cb070>

>   ???
E   NameError: name '_DoublyLinkedList__head' is not defined

queue3:140: NameError

   - [# 215] SVD queue3: 
--------------------------------------------------------------------------------
  150:     def getHead(self) -> T:
  151:         
  152:         '''View first element in the queue.'''
  153:         
- 154:         return self.__queue.getHead()
+ 154:         return __queue.getHead()
  155:     
  156:     def getTail(self):
  157:         
  158:         '''View last element in the queue.'''
--------------------------------------------------------------------------------
[0.07424 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
>       var_0 = queue_0.getHead()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a3a9edd0>

>   ???
E   NameError: name '_Queue__queue' is not defined

queue3:154: NameError

   - [# 216] SVD queue3: 
--------------------------------------------------------------------------------
  156:     def getTail(self):
  157:         
  158:         '''View last element in the queue.'''
  159:         
- 160:         return self.__queue.getTail()
+ 160:         return __queue.getTail()
  161:     
  162:     def dequeue(self) -> T:
  163:         
  164:         '''Remove element from the queue.'''
--------------------------------------------------------------------------------
[0.07507 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
>       var_1 = queue_0.getTail()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a3cac460>

>   ???
E   NameError: name '_Queue__queue' is not defined

queue3:160: NameError

   - [# 217] SVD queue3: 
--------------------------------------------------------------------------------
  162:     def dequeue(self) -> T:
  163:         
  164:         '''Remove element from the queue.'''
  165:         
- 166:         return self.__queue.removeAtHead()
+ 166:         return __queue.removeAtHead()
  167:     
  168:     def enqueue(self, value: T) -> None:
  169:         
  170:         '''Add element to queue.'''
--------------------------------------------------------------------------------
[0.09568 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
        none_type_1 = queue_0.enqueue(dict_0)
        var_0 = doubly_linked_list_0.getTail()
        bool_0 = doubly_linked_list_0.isEmpty()
        assert bool_0 is True
        none_type_2 = queue_0.enqueue(none_type_0)
        int_0 = doubly_linked_list_0.__len__()
        assert int_0 == 0
        bool_1 = doubly_linked_list_0.isEmpty()
        assert bool_1 is True
        var_1 = queue_0.getTail()
>       var_2 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a3f17550>

>   ???
E   NameError: name '_Queue__queue' is not defined

queue3:166: NameError

   - [# 218] SVD queue3: 
--------------------------------------------------------------------------------
  168:     def enqueue(self, value: T) -> None:
  169:         
  170:         '''Add element to queue.'''
  171:         
- 172:         self.__queue.addAtTail(value)
+ 172:         __queue.addAtTail(value)
  173:     
  174:     def getSize(self) -> int:
  175:         
  176:         '''Get size of the queue.'''
--------------------------------------------------------------------------------
[0.07514 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = None
        dict_0 = {queue_0: queue_0, none_type_0: queue_0, str_0: queue_0}
>       none_type_1 = queue_0.enqueue(dict_0)

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a4103fd0>
value = {<queue3.Queue object at 0x7f33a4103fd0>: <queue3.Queue object at 0x7f33a4103fd0>, None: <queue3.Queue object at 0x7f33a4103fd0>, '[]': <queue3.Queue object at 0x7f33a4103fd0>}

>   ???
E   NameError: name '_Queue__queue' is not defined

queue3:172: NameError

   - [# 219] SVD queue3: 
--------------------------------------------------------------------------------
  174:     def getSize(self) -> int:
  175:         
  176:         '''Get size of the queue.'''
  177:         
- 178:         return self.__queue.getSize()
+ 178:         return __queue.getSize()
  179:     
  180:     def isEmpty(self) -> bool:
  181:         
  182:         '''Check if queue is empty.'''
--------------------------------------------------------------------------------
[0.07700 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_5

def test_case_5():
        none_type_0 = None
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       int_0 = queue_0.getSize()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a424bca0>

>   ???
E   NameError: name '_Queue__queue' is not defined

queue3:178: NameError

   - [# 220] SVD queue3: 
--------------------------------------------------------------------------------
  180:     def isEmpty(self) -> bool:
  181:         
  182:         '''Check if queue is empty.'''
  183:         
- 184:         return self.__queue.isEmpty()
+ 184:         return __queue.isEmpty()
  185:     
  186:     def __str__(self) -> str:
  187:         
  188:         '''Get string representation of the queue.'''
--------------------------------------------------------------------------------
[0.07470 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        str_0 = '\x0c{xK\\BR?w'
        queue_1 = module_0.Queue()
        var_0 = queue_0.getHead()
>       bool_0 = queue_1.isEmpty()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a3b63c40>

>   ???
E   NameError: name '_Queue__queue' is not defined

queue3:184: NameError

   - [# 221] SVD queue3: 
--------------------------------------------------------------------------------
  186:     def __str__(self) -> str:
  187:         
  188:         '''Get string representation of the queue.'''
  189:         
- 190:         return self.__queue.__str__()
+ 190:         return __queue.__str__()
  191: 
  192: 
  193: if __name__ == '__main__':
  194:     pass
--------------------------------------------------------------------------------
[0.07468 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_0

def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        queue_0 = module_0.Queue()
>       str_0 = queue_0.__str__()

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue3.Queue object at 0x7f33a3b600d0>

>   ???
E   NameError: name '_Queue__queue' is not defined

queue3:190: NameError

   - [# 222] ZIL queue3: 
--------------------------------------------------------------------------------
  138:         
  139:         arr = []
  140:         current = self.__head.next
  141:         while current:
- 142:             arr.append(current.value)
- 143:             current = current.next
+ 142:             break
+ 143:         
  144:         return str(arr)
  145: 
  146: class Queue:
  147:     def __init__(self):
--------------------------------------------------------------------------------
[0.07792 s] killed by MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py::test_case_7

def test_case_7():
        bool_0 = False
        queue_0 = module_0.Queue()
        str_0 = queue_0.__str__()
        assert str_0 == '[]'
        none_type_0 = queue_0.enqueue(bool_0)
        str_1 = queue_0.__str__()
>       assert str_1 == '[False]'
E       AssertionError

MIO-WHOLE_SUITE/test_queue3_WHOLE_SUITE.py:105: AssertionError
