   - [#  91] SDI queue4: 
--------------------------------------------------------------------------------
  131:     If the queue is empty, returns None
  132:     size(): return the size of the queue. Returns 0 if the queue is empty.
  133:     '''
  134:     
- 135:     def __init__(self, data=None):
- 136:         '''Initialize queue data structure.'''
- 137:         self._container = DoubleLinkedList(data)
- 138:     
+ 135:     @staticmethod
+ 136:     def __init__(self, data=None):
+ 137:         '''Initialize queue data structure.'''
+ 138:         self._container = DoubleLinkedList(data)
  139:     def enqueue(self, val):
  140:         '''Add a value to the queue.'''
  141:         self._container.append(val)
  142:     
--------------------------------------------------------------------------------
[0.48674 s] killed by DYNAMOSA-MIO/test_queue4_DYNAMOSA.py::test_case_0

def test_case_0():
        complex_0 = 1256.54 - 1026.303899j
        float_0 = -335.0
        tuple_0 = (float_0,)
>       queue_0 = module_0.Queue(tuple_0)

DYNAMOSA-MIO/test_queue4_DYNAMOSA.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = (-335.0,), data = None

>   ???
E   AttributeError: 'tuple' object has no attribute '_container'

queue4:138: AttributeError
