87 : Job ID c05997d34bc74bc0aaf01e6933bf80e8
test outcome: killed
queue4.py, start pos: (151, 15), end pos: (151, 29)
operator: core/ExceptionReplacer, occurrence: 2
--- mutation diff ---
--- aqueue4.py
+++ bqueue4.py
@@ -148,7 +148,7 @@
         """Return the next value in the queue without dequing it."""
         try:
             return self._container.head.data
-        except AttributeError:
+        except CosmicRayTestingException:
             return None
     def size(self):
DYNAMOSA-WHOLE_SUITE/test_queue4_DYNAMOSA.py ........F...F..F....F       [ 61%]
DYNAMOSA-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py F............            [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-WHOLE_SUITE/test_queue4_DYNAMOSA.py::test_case_8 - NameError:...
FAILED DYNAMOSA-WHOLE_SUITE/test_queue4_DYNAMOSA.py::test_case_12 - NameError...
FAILED DYNAMOSA-WHOLE_SUITE/test_queue4_DYNAMOSA.py::test_case_15 - NameError...
FAILED DYNAMOSA-WHOLE_SUITE/test_queue4_DYNAMOSA.py::test_case_20 - NameError...
FAILED DYNAMOSA-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_0 - NameErr...
========================= 5 failed, 29 passed in 0.07s =========================
