   - [#   1] ASR queue4: 
--------------------------------------------------------------------------------
   46:         if old_head:
   47:             old_head.prev = self.head
   48:         if not (self.tail):
   49:             self.tail = self.head
-  50:         self._length += 1
+  50:         self._length -= 1
   51:     
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
   54:         to_return = self.head
--------------------------------------------------------------------------------
[0.07615 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
>       var_0 = double_linked_list_0.pop()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:78: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09977066b0>

>   ???
E   IndexError: Cannot pop from an empty list.

queue4:56: IndexError

   - [#   2] ASR queue4: 
--------------------------------------------------------------------------------
   58:         new_head = self.head.next
   59:         if new_head:
   60:             new_head.prev = None
   61:         self.head = new_head
-  62:         self._length -= 1
+  62:         self._length += 1
   63:         if self._length < 1:
   64:             self.tail = None
   65:         return to_return.data
   66:     
--------------------------------------------------------------------------------
[0.07501 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
        var_1 = queue_0.dequeue()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue4.Queue'
        var_2 = queue_0.size()
>       assert var_2 == 0
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:54: AssertionError

   - [#   3] ASR queue4: 
--------------------------------------------------------------------------------
   71:         if old_tail:
   72:             old_tail.next = self.tail
   73:         if self._length < 1:
   74:             self.head = self.tail
-  75:         self._length += 1
+  75:         self._length -= 1
   76:     
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
   79:         to_return = self.tail
--------------------------------------------------------------------------------
[0.07628 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997224b20>

>   ???
E   IndexError: Cannot pop from an empty list.

queue4:56: IndexError

   - [#   4] ASR queue4: 
--------------------------------------------------------------------------------
   83:         new_tail = self.tail.prev
   84:         if new_tail:
   85:             new_tail.next = None
   86:         self.tail = new_tail
-  87:         self._length -= 1
+  87:         self._length += 1
   88:         if self._length < 1:
   89:             self.tail = None
   90:         return to_return.data
   91:     
--------------------------------------------------------------------------------
[0.06865 s] survived

   - [#   5] ASR queue4: 
--------------------------------------------------------------------------------
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
- 105:                 self._length -= 1
+ 105:                 self._length += 1
  106:                 return
  107:             curr = curr.next
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
--------------------------------------------------------------------------------
[0.07019 s] survived

   - [#   7] CDI queue4: 
--------------------------------------------------------------------------------
    3: 
    4: class Node(object):
    5:     '''Node class for data storage.'''
    6:     
-   7:     def __init__(self, data=None, next_node=None, prev=None):
-   8:         '''Initialize Node.'''
-   9:         self.data = data
-  10:         self.next = next_node
-  11:         self.prev = prev
-  12:     
+   7:     @classmethod
+   8:     def __init__(self, data=None, next_node=None, prev=None):
+   9:         '''Initialize Node.'''
+  10:         self.data = data
+  11:         self.next = next_node
+  12:         self.prev = prev
   13:     def __repr__(self):
   14:         '''String representation.'''
   15:         return 'Value: {}'.format(self.data)
   16: 
--------------------------------------------------------------------------------
[0.07773 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
        var_0 = double_linked_list_0.pop()
>       assert var_0 == 189
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:79: AssertionError

   - [#   8] CDI queue4: 
--------------------------------------------------------------------------------
    9:         self.data = data
   10:         self.next = next_node
   11:         self.prev = prev
   12:     
-  13:     def __repr__(self):
-  14:         '''String representation.'''
-  15:         return 'Value: {}'.format(self.data)
-  16: 
+  13:     @classmethod
+  14:     def __repr__(self):
+  15:         '''String representation.'''
+  16:         return 'Value: {}'.format(self.data)
   17: 
   18: class DoubleLinkedList(object):
   19:     '''Double linked list impplementation.
   20: 
--------------------------------------------------------------------------------
[0.07517 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_4

def test_case_4():
        node_0 = module_0.Node()
        bool_0 = False
>       var_0 = node_0.__repr__()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:43: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue4.Node'>

>   ???
E   AttributeError: type object 'Node' has no attribute 'data'

queue4:16: AttributeError

   - [#  10] CDI queue4: 
--------------------------------------------------------------------------------
   38:         except TypeError:
   39:             if data:
   40:                 self.push(data)
   41:     
-  42:     def push(self, val):
-  43:         '''Add val to the head of the list.'''
-  44:         old_head = self.head
-  45:         self.head = Node(val, next_node=old_head)
-  46:         if old_head:
-  47:             old_head.prev = self.head
-  48:         if not (self.tail):
-  49:             self.tail = self.head
-  50:         self._length += 1
-  51:     
+  42:     @classmethod
+  43:     def push(self, val):
+  44:         '''Add val to the head of the list.'''
+  45:         old_head = self.head
+  46:         self.head = Node(val, next_node=old_head)
+  47:         if old_head:
+  48:             old_head.prev = self.head
+  49:         if not (self.tail):
+  50:             self.tail = self.head
+  51:         self._length += 1
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
   54:         to_return = self.head
   55:         if self._length < 1:
--------------------------------------------------------------------------------
[0.07352 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
>       var_0 = double_linked_list_0.push(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

   - [#  11] CDI queue4: 
--------------------------------------------------------------------------------
   48:         if not (self.tail):
   49:             self.tail = self.head
   50:         self._length += 1
   51:     
-  52:     def pop(self):
-  53:         '''Remove the val from the head of the list.'''
-  54:         to_return = self.head
-  55:         if self._length < 1:
-  56:             raise IndexError('Cannot pop from an empty list.')
-  57:         
-  58:         new_head = self.head.next
-  59:         if new_head:
-  60:             new_head.prev = None
-  61:         self.head = new_head
-  62:         self._length -= 1
-  63:         if self._length < 1:
-  64:             self.tail = None
-  65:         return to_return.data
-  66:     
+  52:     @classmethod
+  53:     def pop(self):
+  54:         '''Remove the val from the head of the list.'''
+  55:         to_return = self.head
+  56:         if self._length < 1:
+  57:             raise IndexError('Cannot pop from an empty list.')
+  58:         
+  59:         new_head = self.head.next
+  60:         if new_head:
+  61:             new_head.prev = None
+  62:         self.head = new_head
+  63:         self._length -= 1
+  64:         if self._length < 1:
+  65:             self.tail = None
+  66:         return to_return.data
   67:     def append(self, val):
   68:         '''Add val to the tail of the list.'''
   69:         old_tail = self.tail
   70:         self.tail = Node(val, prev=old_tail)
--------------------------------------------------------------------------------
[0.07652 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False

   - [#  12] CDI queue4: 
--------------------------------------------------------------------------------
   63:         if self._length < 1:
   64:             self.tail = None
   65:         return to_return.data
   66:     
-  67:     def append(self, val):
-  68:         '''Add val to the tail of the list.'''
-  69:         old_tail = self.tail
-  70:         self.tail = Node(val, prev=old_tail)
-  71:         if old_tail:
-  72:             old_tail.next = self.tail
-  73:         if self._length < 1:
-  74:             self.head = self.tail
-  75:         self._length += 1
-  76:     
+  67:     @classmethod
+  68:     def append(self, val):
+  69:         '''Add val to the tail of the list.'''
+  70:         old_tail = self.tail
+  71:         self.tail = Node(val, prev=old_tail)
+  72:         if old_tail:
+  73:             old_tail.next = self.tail
+  74:         if self._length < 1:
+  75:             self.head = self.tail
+  76:         self._length += 1
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
   79:         to_return = self.tail
   80:         if self._length < 1:
--------------------------------------------------------------------------------
[0.07736 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(bytes_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualna

   - [#  13] CDI queue4: 
--------------------------------------------------------------------------------
   73:         if self._length < 1:
   74:             self.head = self.tail
   75:         self._length += 1
   76:     
-  77:     def shift(self):
-  78:         '''Remove the val from the tail of the list.'''
-  79:         to_return = self.tail
-  80:         if self._length < 1:
-  81:             raise IndexError('Cannot shift from an empty list.')
-  82:         
-  83:         new_tail = self.tail.prev
-  84:         if new_tail:
-  85:             new_tail.next = None
-  86:         self.tail = new_tail
-  87:         self._length -= 1
-  88:         if self._length < 1:
-  89:             self.tail = None
-  90:         return to_return.data
-  91:     
+  77:     @classmethod
+  78:     def shift(self):
+  79:         '''Remove the val from the tail of the list.'''
+  80:         to_return = self.tail
+  81:         if self._length < 1:
+  82:             raise IndexError('Cannot shift from an empty list.')
+  83:         
+  84:         new_tail = self.tail.prev
+  85:         if new_tail:
+  86:             new_tail.next = None
+  87:         self.tail = new_tail
+  88:         self._length -= 1
+  89:         if self._length < 1:
+  90:             self.tail = None
+  91:         return to_return.data
   92:     def remove(self, val):
   93:         '''Remove first occurance of val from list.'''
   94:         curr = self.head
   95:         while curr:
--------------------------------------------------------------------------------
[0.07760 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_2

def test_case_2():
        none_type_0 = None

   - [#  14] CDI queue4: 
--------------------------------------------------------------------------------
   88:         if self._length < 1:
   89:             self.tail = None
   90:         return to_return.data
   91:     
-  92:     def remove(self, val):
-  93:         '''Remove first occurance of val from list.'''
-  94:         curr = self.head
-  95:         while curr:
-  96:             if curr.data is val:
-  97:                 if self._length == 1:
-  98:                     (self.head, self.tail) = (None, None)
-  99:                 elif (curr is not self.head and curr is not self.tail):
- 100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
- 101:                 elif curr is self.head:
- 102:                     (self.head, curr.next.prev) = (curr.next, None)
- 103:                 elif curr is self.tail:
- 104:                     (self.tail, curr.prev.next) = (curr.prev, None)
- 105:                 self._length -= 1
- 106:                 return
- 107:             curr = curr.next
- 108:         
- 109:         raise ValueError('{} is not in the list'.format(val))
- 110:     
+  92:     @classmethod
+  93:     def remove(self, val):
+  94:         '''Remove first occurance of val from list.'''
+  95:         curr = self.head
+  96:         while curr:
+  97:             if curr.data is val:
+  98:                 if self._length == 1:
+  99:                     (self.head, self.tail) = (None, None)
+ 100:                 elif (curr is not self.head and curr is not self.tail):
+ 101:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
+ 102:                 elif curr is self.head:
+ 103:                     (self.head, curr.next.prev) = (curr.next, None)
+ 104:                 elif curr is self

   - [#  15] CDI queue4: 
--------------------------------------------------------------------------------
  107:             curr = curr.next
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
- 111:     def _repr(self):
- 112:         '''Return list representation of dll.'''
- 113:         l = []
- 114:         while True:
- 115:             try:
- 116:                 popped_data = self.pop()
- 117:                 l.append(popped_data)
- 118:             except IndexError:
- 119:                 break
- 120:         return l
- 121: 
+ 111:     @classmethod
+ 112:     def _repr(self):
+ 113:         '''Return list representation of dll.'''
+ 114:         l = []
+ 115:         while True:
+ 116:             try:
+ 117:                 popped_data = self.pop()
+ 118:                 l.append(popped_data)
+ 119:             except IndexError:
+ 120:                 break
+ 121:         return l
  122: 
  123: class Queue(object):
  124:     '''Implementation of Queue.
  125: 
--------------------------------------------------------------------------------
[0.06918 s] survived

   - [#  16] CDI queue4: 
--------------------------------------------------------------------------------
  131:     If the queue is empty, returns None
  132:     size(): return the size of the queue. Returns 0 if the queue is empty.
  133:     '''
  134:     
- 135:     def __init__(self, data=None):
- 136:         '''Initialize queue data structure.'''
- 137:         self._container = DoubleLinkedList(data)
- 138:     
+ 135:     @classmethod
+ 136:     def __init__(self, data=None):
+ 137:         '''Initialize queue data structure.'''
+ 138:         self._container = DoubleLinkedList(data)
  139:     def enqueue(self, val):
  140:         '''Add a value to the queue.'''
  141:         self._container.append(val)
  142:     
--------------------------------------------------------------------------------
[0.06811 s] survived

   - [#  17] CDI queue4: 
--------------------------------------------------------------------------------
  135:     def __init__(self, data=None):
  136:         '''Initialize queue data structure.'''
  137:         self._container = DoubleLinkedList(data)
  138:     
- 139:     def enqueue(self, val):
- 140:         '''Add a value to the queue.'''
- 141:         self._container.append(val)
- 142:     
+ 139:     @classmethod
+ 140:     def enqueue(self, val):
+ 141:         '''Add a value to the queue.'''
+ 142:         self._container.append(val)
  143:     def dequeue(self):
  144:         '''Remove a value from the front of the queue.'''
  145:         return self._container.pop()
  146:     
--------------------------------------------------------------------------------
[0.07819 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
>       var_0 = queue_0.enqueue(queue_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue4.Queue'>, val = <queue4.Queue object at 0x7f0997705ff0>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_container'

queue4:142: AttributeError

   - [#  18] CDI queue4: 
--------------------------------------------------------------------------------
  139:     def enqueue(self, val):
  140:         '''Add a value to the queue.'''
  141:         self._container.append(val)
  142:     
- 143:     def dequeue(self):
- 144:         '''Remove a value from the front of the queue.'''
- 145:         return self._container.pop()
- 146:     
+ 143:     @classmethod
+ 144:     def dequeue(self):
+ 145:         '''Remove a value from the front of the queue.'''
+ 146:         return self._container.pop()
  147:     def peek(self):
  148:         '''Return the next value in the queue without dequing it.'''
  149:         try:
  150:             return self._container.head.data
--------------------------------------------------------------------------------
[0.07735 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue4.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_container'

queue4:146: AttributeError

   - [#  19] CDI queue4: 
--------------------------------------------------------------------------------
  143:     def dequeue(self):
  144:         '''Remove a value from the front of the queue.'''
  145:         return self._container.pop()
  146:     
- 147:     def peek(self):
- 148:         '''Return the next value in the queue without dequing it.'''
- 149:         try:
- 150:             return self._container.head.data
- 151:         except AttributeError:
- 152:             return None
- 153:     
+ 147:     @classmethod
+ 148:     def peek(self):
+ 149:         '''Return the next value in the queue without dequing it.'''
+ 150:         try:
+ 151:             return self._container.head.data
+ 152:         except AttributeError:
+ 153:             return None
  154:     def size(self):
  155:         '''Return the size of the queue.'''
  156:         return self._container._length
--------------------------------------------------------------------------------
[0.07012 s] survived

   - [#  20] CDI queue4: 
--------------------------------------------------------------------------------
  150:             return self._container.head.data
  151:         except AttributeError:
  152:             return None
  153:     
- 154:     def size(self):
- 155:         '''Return the size of the queue.'''
- 156:         return self._container._length
+ 154:     @classmethod
+ 155:     def size(self):
+ 156:         '''Return the size of the queue.'''
+ 157:         return self._container._length
--------------------------------------------------------------------------------
[0.07740 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
        var_1 = queue_0.dequeue()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue4.Queue'
>       var_2 = queue_0.size()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:53: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue4.Queue'>

>   ???
E   AttributeError: type object 'Queue' has no attribute '_container'

queue4:157: AttributeError

   - [#  21] COD queue4: 
--------------------------------------------------------------------------------
   44:         old_head = self.head
   45:         self.head = Node(val, next_node=old_head)
   46:         if old_head:
   47:             old_head.prev = self.head
-  48:         if not (self.tail):
+  48:         if self.tail:
   49:             self.tail = self.head
   50:         self._length += 1
   51:     
   52:     def pop(self):
--------------------------------------------------------------------------------
[0.07471 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(bytes_0)
>       assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:18: AssertionError

   - [#  24] COI queue4: 
--------------------------------------------------------------------------------
   44:         old_head = self.head
   45:         self.head = Node(val, next_node=old_head)
   46:         if old_head:
   47:             old_head.prev = self.head
-  48:         if not (self.tail):
+  48:         if not ((not (self.tail))):
   49:             self.tail = self.head
   50:         self._length += 1
   51:     
   52:     def pop(self):
--------------------------------------------------------------------------------
[0.07386 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(bytes_0)
>       assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:18: AssertionError

   - [#  25] COI queue4: 
--------------------------------------------------------------------------------
   51:     
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
   54:         to_return = self.head
-  55:         if self._length < 1:
+  55:         if not (self._length < 1):
   56:             raise IndexError('Cannot pop from an empty list.')
   57:         
   58:         new_head = self.head.next
   59:         if new_head:
--------------------------------------------------------------------------------
[0.07689 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997391240>

>   ???
E   IndexError: Cannot pop from an empty list.

queue4:56: IndexError

   - [#  27] COI queue4: 
--------------------------------------------------------------------------------
   59:         if new_head:
   60:             new_head.prev = None
   61:         self.head = new_head
   62:         self._length -= 1
-  63:         if self._length < 1:
+  63:         if not (self._length < 1):
   64:             self.tail = None
   65:         return to_return.data
   66:     
   67:     def append(self, val):
--------------------------------------------------------------------------------
[0.07856 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
        var_0 = double_linked_list_0.pop()
        assert var_0 == 189
        queue_0 = module_0.Queue(tuple_0)
>       var_1 = double_linked_list_0.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:81: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f099762fe20>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

queue4:83: AttributeError
