   - [#  29] COI queue4: 
--------------------------------------------------------------------------------
   69:         old_tail = self.tail
   70:         self.tail = Node(val, prev=old_tail)
   71:         if old_tail:
   72:             old_tail.next = self.tail
-  73:         if self._length < 1:
+  73:         if not (self._length < 1):
   74:             self.head = self.tail
   75:         self._length += 1
   76:     
   77:     def shift(self):
--------------------------------------------------------------------------------
[0.09749 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997390130>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue4:58: AttributeError

   - [#  30] COI queue4: 
--------------------------------------------------------------------------------
   76:     
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
   79:         to_return = self.tail
-  80:         if self._length < 1:
+  80:         if not (self._length < 1):
   81:             raise IndexError('Cannot shift from an empty list.')
   82:         
   83:         new_tail = self.tail.prev
   84:         if new_tail:
--------------------------------------------------------------------------------
[0.07629 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_2

def test_case_2():
        none_type_0 = None
        double_linked_list_0 = module_0.DoubleLinkedList(none_type_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        double_linked_list_1 = module_0.DoubleLinkedList(none_type_0)
        assert double_linked_list_1.head is None
        assert double_linked_list_1.tail is None
        with pytest.raises(IndexError):
>           double_linked_list_1.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09976f1120>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

queue4:83: AttributeError

   - [#  34] COI queue4: 
--------------------------------------------------------------------------------
   92:     def remove(self, val):
   93:         '''Remove first occurance of val from list.'''
   94:         curr = self.head
   95:         while curr:
-  96:             if curr.data is val:
+  96:             if not (curr.data is val):
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
--------------------------------------------------------------------------------
[0.07698 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_6

def test_case_6():
        bool_0 = True
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(bool_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
>       with pytest.raises(ValueError):
E       Failed: DID NOT RAISE <class 'ValueError'>

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:66: Failed

   - [#  35] COI queue4: 
--------------------------------------------------------------------------------
   93:         '''Remove first occurance of val from list.'''
   94:         curr = self.head
   95:         while curr:
   96:             if curr.data is val:
-  97:                 if self._length == 1:
+  97:                 if not (self._length == 1):
   98:                     (self.head, self.tail) = (None, None)
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
--------------------------------------------------------------------------------
[0.07845 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_8

def test_case_8():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.append(double_linked_list_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
>       var_1 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:91: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0996f4d090>
val = <queue4.DoubleLinkedList object at 0x7f0996f4d090>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

queue4:102: AttributeError

   - [#  36] COI queue4: 
--------------------------------------------------------------------------------
   95:         while curr:
   96:             if curr.data is val:
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
-  99:                 elif (curr is not self.head and curr is not self.tail):
+  99:                 elif not ((curr is not self.head and curr is not self.tail)):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
--------------------------------------------------------------------------------
[0.07873 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_9

def test_case_9():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(none_type_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(double_linked_list_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:106: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f099737cd00>
val = <queue4.DoubleLinkedList object at 0x7f099737cd00>

>   ???
E   AttributeError: 'NoneType' object

   - [#  37] COI queue4: 
--------------------------------------------------------------------------------
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
- 101:                 elif curr is self.head:
+ 101:                 elif not (curr is self.head):
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
--------------------------------------------------------------------------------
[0.07976 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_11

def test_case_11():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(double_linked_list_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(var_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:136: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f099737f370>
val = <queue4.DoubleLinkedList object at 0x7f099737f370>

>   ???
E   AttributeError: 'NoneType' object has no attribu

   - [#  38] COI queue4: 
--------------------------------------------------------------------------------
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
- 103:                 elif curr is self.tail:
+ 103:                 elif not (curr is self.tail):
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
  106:                 return
  107:             curr = curr.next
--------------------------------------------------------------------------------
[0.06938 s] survived

   - [#  40] CRP queue4: 
--------------------------------------------------------------------------------
   11:         self.prev = prev
   12:     
   13:     def __repr__(self):
   14:         '''String representation.'''
-  15:         return 'Value: {}'.format(self.data)
+  15:         return 'mutpy'.format(self.data)
   16: 
   17: 
   18: class DoubleLinkedList(object):
   19:     '''Double linked list impplementation.
--------------------------------------------------------------------------------
[0.07794 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_4

def test_case_4():
        node_0 = module_0.Node()
        bool_0 = False
        var_0 = node_0.__repr__()
>       assert var_0 == 'Value: None'
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:44: AssertionError

   - [#  41] CRP queue4: 
--------------------------------------------------------------------------------
   11:         self.prev = prev
   12:     
   13:     def __repr__(self):
   14:         '''String representation.'''
-  15:         return 'Value: {}'.format(self.data)
+  15:         return ''.format(self.data)
   16: 
   17: 
   18: class DoubleLinkedList(object):
   19:     '''Double linked list impplementation.
--------------------------------------------------------------------------------
[0.07858 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_4

def test_case_4():
        node_0 = module_0.Node()
        bool_0 = False
        var_0 = node_0.__repr__()
>       assert var_0 == 'Value: None'
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:44: AssertionError

   - [#  45] CRP queue4: 
--------------------------------------------------------------------------------
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
   54:         to_return = self.head
   55:         if self._length < 1:
-  56:             raise IndexError('Cannot pop from an empty list.')
+  56:             raise IndexError('mutpy')
   57:         
   58:         new_head = self.head.next
   59:         if new_head:
   60:             new_head.prev = None
--------------------------------------------------------------------------------
[0.07058 s] survived

   - [#  46] CRP queue4: 
--------------------------------------------------------------------------------
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
   54:         to_return = self.head
   55:         if self._length < 1:
-  56:             raise IndexError('Cannot pop from an empty list.')
+  56:             raise IndexError('')
   57:         
   58:         new_head = self.head.next
   59:         if new_head:
   60:             new_head.prev = None
--------------------------------------------------------------------------------
[0.06910 s] survived

   - [#  52] CRP queue4: 
--------------------------------------------------------------------------------
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
   79:         to_return = self.tail
   80:         if self._length < 1:
-  81:             raise IndexError('Cannot shift from an empty list.')
+  81:             raise IndexError('mutpy')
   82:         
   83:         new_tail = self.tail.prev
   84:         if new_tail:
   85:             new_tail.next = None
--------------------------------------------------------------------------------
[0.06965 s] survived

   - [#  53] CRP queue4: 
--------------------------------------------------------------------------------
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
   79:         to_return = self.tail
   80:         if self._length < 1:
-  81:             raise IndexError('Cannot shift from an empty list.')
+  81:             raise IndexError('')
   82:         
   83:         new_tail = self.tail.prev
   84:         if new_tail:
   85:             new_tail.next = None
--------------------------------------------------------------------------------
[0.06991 s] survived

   - [#  57] CRP queue4: 
--------------------------------------------------------------------------------
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
- 105:                 self._length -= 1
+ 105:                 self._length -= 2
  106:                 return
  107:             curr = curr.next
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
--------------------------------------------------------------------------------
[0.07950 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_9

def test_case_9():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(none_type_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(double_linked_list_0)
        var_2 = double_linked_list_0.remove(double_linked_list_0)
        none_type_1 = None
>       var_3 = double_linked_list_0.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:108: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09971f2aa0>

>   ???
E   IndexError: Cannot shift from an empty list.

queue4:81: IndexError

   - [#  58] CRP queue4: 
--------------------------------------------------------------------------------
  105:                 self._length -= 1
  106:                 return
  107:             curr = curr.next
  108:         
- 109:         raise ValueError('{} is not in the list'.format(val))
+ 109:         raise ValueError('mutpy'.format(val))
  110:     
  111:     def _repr(self):
  112:         '''Return list representation of dll.'''
  113:         l = []
--------------------------------------------------------------------------------
[0.06925 s] survived

   - [#  59] CRP queue4: 
--------------------------------------------------------------------------------
  105:                 self._length -= 1
  106:                 return
  107:             curr = curr.next
  108:         
- 109:         raise ValueError('{} is not in the list'.format(val))
+ 109:         raise ValueError(''.format(val))
  110:     
  111:     def _repr(self):
  112:         '''Return list representation of dll.'''
  113:         l = []
--------------------------------------------------------------------------------
[0.06968 s] survived

   - [#  61] EHD queue4: 
--------------------------------------------------------------------------------
  115:             try:
  116:                 popped_data = self.pop()
  117:                 l.append(popped_data)
  118:             except IndexError:
- 119:                 break
+ 119:                 raise
  120:         return l
  121: 
  122: 
  123: class Queue(object):
--------------------------------------------------------------------------------
[0.07163 s] survived

   - [#  62] EHD queue4: 
--------------------------------------------------------------------------------
  148:         '''Return the next value in the queue without dequing it.'''
  149:         try:
  150:             return self._container.head.data
  151:         except AttributeError:
- 152:             return None
+ 152:             raise
  153:     
  154:     def size(self):
  155:         '''Return the size of the queue.'''
  156:         return self._container._length
--------------------------------------------------------------------------------
[0.07327 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
>       var_0 = queue_0.peek()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.Queue object at 0x7f0997384670>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

queue4:150: AttributeError

   - [#  63] EXS queue4: 
--------------------------------------------------------------------------------
   35:         try:
   36:             for val in data:
   37:                 self.push(val)
   38:         except TypeError:
-  39:             if data:
-  40:                 self.push(data)
+  39:             pass
+  40:     
   41:     
   42:     def push(self, val):
   43:         '''Add val to the head of the list.'''
   44:         old_head = self.head
--------------------------------------------------------------------------------
[0.07927 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_10

def test_case_10():
        int_0 = -2937
        double_linked_list_0 = module_0.DoubleLinkedList(int_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:115: AssertionError

   - [#  64] EXS queue4: 
--------------------------------------------------------------------------------
  115:             try:
  116:                 popped_data = self.pop()
  117:                 l.append(popped_data)
  118:             except IndexError:
- 119:                 break
+ 119:                 pass
  120:         return l
  121: 
  122: 
  123: class Queue(object):
--------------------------------------------------------------------------------
[0.06939 s] survived

   - [#  65] EXS queue4: 
--------------------------------------------------------------------------------
  148:         '''Return the next value in the queue without dequing it.'''
  149:         try:
  150:             return self._container.head.data
  151:         except AttributeError:
- 152:             return None
+ 152:             pass
  153:     
  154:     def size(self):
  155:         '''Return the size of the queue.'''
  156:         return self._container._length
--------------------------------------------------------------------------------
[0.09045 s] survived

   - [#  66] LCR queue4: 
--------------------------------------------------------------------------------
   95:         while curr:
   96:             if curr.data is val:
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
-  99:                 elif (curr is not self.head and curr is not self.tail):
+  99:                 elif (curr is not self.head or curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
--------------------------------------------------------------------------------
[0.07800 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_9

def test_case_9():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(none_type_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(double_linked_list_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:106: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997384af0>
val = <queue4.DoubleLinkedList object at 0x7f0997384af0>

>   ???
E   AttributeError: 'NoneType' object has no

   - [#  67] OIL queue4: 
--------------------------------------------------------------------------------
   34:         self._length = 0
   35:         try:
   36:             for val in data:
   37:                 self.push(val)
-  38:         except TypeError:
+  38:                 breakexcept TypeError:
   39:             if data:
   40:                 self.push(data)
   41:     
   42:     def push(self, val):
--------------------------------------------------------------------------------
[0.07774 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
        var_0 = double_linked_list_0.pop()
>       assert var_0 == 189
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:79: AssertionError

   - [#  68] OIL queue4: 
--------------------------------------------------------------------------------
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
  106:                 return
  107:             curr = curr.next
- 108:         
+ 108:             break
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
  111:     def _repr(self):
  112:         '''Return list representation of dll.'''
--------------------------------------------------------------------------------
[0.07968 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_11

def test_case_11():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(double_linked_list_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(var_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:136: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09970897e0>
val = <queue4.DoubleLinkedList object at 0x7f09970897e0>

>   ???
E   ValueError: <queue4.DoubleLinkedList object at 0x7f09970897e0> is not in the list

queue4:109: ValueError

   - [#  69] OIL queue4: 
--------------------------------------------------------------------------------
  115:             try:
  116:                 popped_data = self.pop()
  117:                 l.append(popped_data)
  118:             except IndexError:
- 119:                 break
+ 119:                 breakbreak
  120:         return l
  121: 
  122: 
  123: class Queue(object):
--------------------------------------------------------------------------------
[0.07011 s] survived

   - [#  70] RIL queue4: 
--------------------------------------------------------------------------------
   32:         self.head = None
   33:         self.tail = None
   34:         self._length = 0
   35:         try:
-  36:             for val in data:
+  36:             for val in reversed(data):
   37:                 self.push(val)
   38:         except TypeError:
   39:             if data:
   40:                 self.push(data)
--------------------------------------------------------------------------------
[0.07791 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
        var_0 = double_linked_list_0.pop()
>       assert var_0 == 189
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:79: AssertionError

   - [#  82] SDI queue4: 
--------------------------------------------------------------------------------
    3: 
    4: class Node(object):
    5:     '''Node class for data storage.'''
    6:     
-   7:     def __init__(self, data=None, next_node=None, prev=None):
-   8:         '''Initialize Node.'''
-   9:         self.data = data
-  10:         self.next = next_node
-  11:         self.prev = prev
-  12:     
+   7:     @staticmethod
+   8:     def __init__(self, data=None, next_node=None, prev=None):
+   9:         '''Initialize Node.'''
+  10:         self.data = data
+  11:         self.next = next_node
+  12:         self.prev = prev
   13:     def __repr__(self):
   14:         '''String representation.'''
   15:         return 'Value: {}'.format(self.data)
   16: 
--------------------------------------------------------------------------------
[0.07321 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
>       var_0 = double_linked_list_0.push(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:45: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = b'\x0c\x9f*\xec', data = None, next_node = None, prev = None

>   ???
E   AttributeError: 'bytes' object has no attribute 'data'

queue4:10: AttributeError
