   - [# 118] SDL queue4: 
--------------------------------------------------------------------------------
   70:         self.tail = Node(val, prev=old_tail)
   71:         if old_tail:
   72:             old_tail.next = self.tail
   73:         if self._length < 1:
-  74:             self.head = self.tail
+  74:             pass
   75:         self._length += 1
   76:     
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
--------------------------------------------------------------------------------
[0.07733 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09975018d0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue4:58: AttributeError

   - [# 119] SDL queue4: 
--------------------------------------------------------------------------------
   75:         self._length += 1
   76:     
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
-  79:         to_return = self.tail
+  79:         pass
   80:         if self._length < 1:
   81:             raise IndexError('Cannot shift from an empty list.')
   82:         
   83:         new_tail = self.tail.prev
--------------------------------------------------------------------------------
[0.07677 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
        var_0 = double_linked_list_0.pop()
        assert var_0 == 189
        queue_0 = module_0.Queue(tuple_0)
>       var_1 = double_linked_list_0.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:81: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09970e39d0>

>   ???
E   NameError: name 'to_return' is not defined

queue4:90: NameError

   - [# 120] SDL queue4: 
--------------------------------------------------------------------------------
   79:         to_return = self.tail
   80:         if self._length < 1:
   81:             raise IndexError('Cannot shift from an empty list.')
   82:         
-  83:         new_tail = self.tail.prev
+  83:         pass
   84:         if new_tail:
   85:             new_tail.next = None
   86:         self.tail = new_tail
   87:         self._length -= 1
--------------------------------------------------------------------------------
[0.07814 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
        var_0 = double_linked_list_0.pop()
        assert var_0 == 189
        queue_0 = module_0.Queue(tuple_0)
>       var_1 = double_linked_list_0.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:81: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f099742e4d0>

>   ???
E   NameError: name 'new_tail' is not defined

queue4:84: NameError

   - [# 121] SDL queue4: 
--------------------------------------------------------------------------------
   81:             raise IndexError('Cannot shift from an empty list.')
   82:         
   83:         new_tail = self.tail.prev
   84:         if new_tail:
-  85:             new_tail.next = None
+  85:             pass
   86:         self.tail = new_tail
   87:         self._length -= 1
   88:         if self._length < 1:
   89:             self.tail = None
--------------------------------------------------------------------------------
[0.06932 s] survived

   - [# 122] SDL queue4: 
--------------------------------------------------------------------------------
   82:         
   83:         new_tail = self.tail.prev
   84:         if new_tail:
   85:             new_tail.next = None
-  86:         self.tail = new_tail
+  86:         pass
   87:         self._length -= 1
   88:         if self._length < 1:
   89:             self.tail = None
   90:         return to_return.data
--------------------------------------------------------------------------------
[0.07215 s] survived

   - [# 125] SDL queue4: 
--------------------------------------------------------------------------------
   90:         return to_return.data
   91:     
   92:     def remove(self, val):
   93:         '''Remove first occurance of val from list.'''
-  94:         curr = self.head
+  94:         pass
   95:         while curr:
   96:             if curr.data is val:
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
--------------------------------------------------------------------------------
[0.07907 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_6

def test_case_6():
        bool_0 = True
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(bool_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        with pytest.raises(ValueError):
>           double_linked_list_0.remove(none_type_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:67: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997422c20>, val = None

>   ???
E   UnboundLocalError: local variable 'curr' referenced before assignment

queue4:95: UnboundLocalError

   - [# 126] SDL queue4: 
--------------------------------------------------------------------------------
   94:         curr = self.head
   95:         while curr:
   96:             if curr.data is val:
   97:                 if self._length == 1:
-  98:                     (self.head, self.tail) = (None, None)
+  98:                     pass
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
--------------------------------------------------------------------------------
[0.07783 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_8

def test_case_8():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.append(double_linked_list_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.remove(double_linked_list_0)
>       assert double_linked_list_0.head is None
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:92: AssertionError

   - [# 127] SDL queue4: 
--------------------------------------------------------------------------------
   96:             if curr.data is val:
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
   99:                 elif (curr is not self.head and curr is not self.tail):
- 100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
+ 100:                     pass
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
--------------------------------------------------------------------------------
[0.06957 s] survived

   - [# 128] SDL queue4: 
--------------------------------------------------------------------------------
   98:                     (self.head, self.tail) = (None, None)
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
- 102:                     (self.head, curr.next.prev) = (curr.next, None)
+ 102:                     pass
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
  106:                 return
--------------------------------------------------------------------------------
[0.06982 s] survived

   - [# 129] SDL queue4: 
--------------------------------------------------------------------------------
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
- 104:                     (self.tail, curr.prev.next) = (curr.prev, None)
+ 104:                     pass
  105:                 self._length -= 1
  106:                 return
  107:             curr = curr.next
  108:         
--------------------------------------------------------------------------------
[0.06944 s] survived

   - [# 130] SDL queue4: 
--------------------------------------------------------------------------------
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
- 106:                 return
+ 106:                 pass
  107:             curr = curr.next
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
--------------------------------------------------------------------------------
[0.09439 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_8

def test_case_8():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.append(double_linked_list_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
>       var_1 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:91: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997500700>
val = <queue4.DoubleLinkedList object at 0x7f0997500700>

>   ???
E   ValueError: <queue4.DoubleLinkedList object at 0x7f0997500700> is not in the list

queue4:109: ValueError

   - [# 131] SDL queue4: 
--------------------------------------------------------------------------------
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
  106:                 return
- 107:             curr = curr.next
+ 107:             pass
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
  111:     def _repr(self):
--------------------------------------------------------------------------------
[5.00641 s] timeout

   - [# 132] SDL queue4: 
--------------------------------------------------------------------------------
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
  111:     def _repr(self):
  112:         '''Return list representation of dll.'''
- 113:         l = []
+ 113:         pass
  114:         while True:
  115:             try:
  116:                 popped_data = self.pop()
  117:                 l.append(popped_data)
--------------------------------------------------------------------------------
[0.06936 s] survived

   - [# 133] SDL queue4: 
--------------------------------------------------------------------------------
  112:         '''Return list representation of dll.'''
  113:         l = []
  114:         while True:
  115:             try:
- 116:                 popped_data = self.pop()
+ 116:                 pass
  117:                 l.append(popped_data)
  118:             except IndexError:
  119:                 break
  120:         return l
--------------------------------------------------------------------------------
[0.07014 s] survived

   - [# 134] SDL queue4: 
--------------------------------------------------------------------------------
  113:         l = []
  114:         while True:
  115:             try:
  116:                 popped_data = self.pop()
- 117:                 l.append(popped_data)
+ 117:                 pass
  118:             except IndexError:
  119:                 break
  120:         return l
  121: 
--------------------------------------------------------------------------------
[0.06914 s] survived

   - [# 135] SDL queue4: 
--------------------------------------------------------------------------------
  116:                 popped_data = self.pop()
  117:                 l.append(popped_data)
  118:             except IndexError:
  119:                 break
- 120:         return l
+ 120:         pass
  121: 
  122: 
  123: class Queue(object):
  124:     '''Implementation of Queue.
--------------------------------------------------------------------------------
[0.07020 s] survived

   - [# 136] SDL queue4: 
--------------------------------------------------------------------------------
  133:     '''
  134:     
  135:     def __init__(self, data=None):
  136:         '''Initialize queue data structure.'''
- 137:         self._container = DoubleLinkedList(data)
+ 137:         pass
  138:     
  139:     def enqueue(self, val):
  140:         '''Add a value to the queue.'''
  141:         self._container.append(val)
--------------------------------------------------------------------------------
[0.07702 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
>       var_0 = queue_0.enqueue(queue_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.Queue object at 0x7f0997146800>
val = <queue4.Queue object at 0x7f0997146800>

>   ???
E   AttributeError: 'Queue' object has no attribute '_container'

queue4:141: AttributeError

   - [# 137] SDL queue4: 
--------------------------------------------------------------------------------
  137:         self._container = DoubleLinkedList(data)
  138:     
  139:     def enqueue(self, val):
  140:         '''Add a value to the queue.'''
- 141:         self._container.append(val)
+ 141:         pass
  142:     
  143:     def dequeue(self):
  144:         '''Remove a value from the front of the queue.'''
  145:         return self._container.pop()
--------------------------------------------------------------------------------
[0.07711 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09972843d0>

>   ???
E   IndexError: Cannot pop from an empty list.

queue4:56: IndexError

   - [# 138] SDL queue4: 
--------------------------------------------------------------------------------
  141:         self._container.append(val)
  142:     
  143:     def dequeue(self):
  144:         '''Remove a value from the front of the queue.'''
- 145:         return self._container.pop()
+ 145:         pass
  146:     
  147:     def peek(self):
  148:         '''Return the next value in the queue without dequing it.'''
  149:         try:
--------------------------------------------------------------------------------
[0.07551 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
        var_1 = queue_0.dequeue()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue4.Queue'
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:52: AssertionError

   - [# 139] SDL queue4: 
--------------------------------------------------------------------------------
  146:     
  147:     def peek(self):
  148:         '''Return the next value in the queue without dequing it.'''
  149:         try:
- 150:             return self._container.head.data
+ 150:             pass
  151:         except AttributeError:
  152:             return None
  153:     
  154:     def size(self):
--------------------------------------------------------------------------------
[0.07103 s] survived

   - [# 141] SDL queue4: 
--------------------------------------------------------------------------------
  152:             return None
  153:     
  154:     def size(self):
  155:         '''Return the size of the queue.'''
- 156:         return self._container._length
+ 156:         pass
--------------------------------------------------------------------------------
[0.07738 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
        var_1 = queue_0.dequeue()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue4.Queue'
        var_2 = queue_0.size()
>       assert var_2 == 0
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:54: AssertionError

   - [# 145] SVD queue4: 
--------------------------------------------------------------------------------
   11:         self.prev = prev
   12:     
   13:     def __repr__(self):
   14:         '''String representation.'''
-  15:         return 'Value: {}'.format(self.data)
+  15:         return 'Value: {}'.format(data)
   16: 
   17: 
   18: class DoubleLinkedList(object):
   19:     '''Double linked list impplementation.
--------------------------------------------------------------------------------
[0.09493 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_4

def test_case_4():
        node_0 = module_0.Node()
        bool_0 = False
>       var_0 = node_0.__repr__()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:43: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'data' is not defined") raised in repr()] Node object at 0x7f09972114b0>

>   ???
E   NameError: name 'data' is not defined

queue4:15: NameError

   - [# 149] SVD queue4: 
--------------------------------------------------------------------------------
   33:         self.tail = None
   34:         self._length = 0
   35:         try:
   36:             for val in data:
-  37:                 self.push(val)
+  37:                 push(val)
   38:         except TypeError:
   39:             if data:
   40:                 self.push(data)
   41:     
--------------------------------------------------------------------------------
[0.07666 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
>       double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:73: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997375e10>
data = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'

>   ???
E   NameError: name 'push' is not defined

queue4:37: NameError

   - [# 150] SVD queue4: 
--------------------------------------------------------------------------------
   36:             for val in data:
   37:                 self.push(val)
   38:         except TypeError:
   39:             if data:
-  40:                 self.push(data)
+  40:                 push(data)
   41:     
   42:     def push(self, val):
   43:         '''Add val to the head of the list.'''
   44:         old_head = self.head
--------------------------------------------------------------------------------
[0.07877 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_10

self = <queue4.DoubleLinkedList object at 0x7f09972cd540>, data = -2937

>   ???
E   TypeError: 'int' object is not iterable

queue4:36: TypeError

During handling of the above exception, another exception occurred:

    def test_case_10():
        int_0 = -2937
>       double_linked_list_0 = module_0.DoubleLinkedList(int_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:113: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09972cd540>, data = -2937

>   ???
E   NameError: name 'push' is not defined

queue4:40: NameError

   - [# 151] SVD queue4: 
--------------------------------------------------------------------------------
   40:                 self.push(data)
   41:     
   42:     def push(self, val):
   43:         '''Add val to the head of the list.'''
-  44:         old_head = self.head
+  44:         old_head = head
   45:         self.head = Node(val, next_node=old_head)
   46:         if old_head:
   47:             old_head.prev = self.head
   48:         if not (self.tail):
--------------------------------------------------------------------------------
[0.07433 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
>       var_0 = double_linked_list_0.push(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09973bb3a0>
val = b'\x0c\x9f*\xec'

>   ???
E   NameError: name 'head' is not defined

queue4:44: NameError

   - [# 153] SVD queue4: 
--------------------------------------------------------------------------------
   43:         '''Add val to the head of the list.'''
   44:         old_head = self.head
   45:         self.head = Node(val, next_node=old_head)
   46:         if old_head:
-  47:             old_head.prev = self.head
+  47:             old_head.prev = head
   48:         if not (self.tail):
   49:             self.tail = self.head
   50:         self._length += 1
   51:     
--------------------------------------------------------------------------------
[0.08115 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
>       double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:73: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:37: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09974a4a90>, val = 214

>   ???
E   NameError: name 'head' is not defined

queue4:47: NameError

   - [# 154] SVD queue4: 
--------------------------------------------------------------------------------
   44:         old_head = self.head
   45:         self.head = Node(val, next_node=old_head)
   46:         if old_head:
   47:             old_head.prev = self.head
-  48:         if not (self.tail):
+  48:         if not tail:
   49:             self.tail = self.head
   50:         self._length += 1
   51:     
   52:     def pop(self):
--------------------------------------------------------------------------------
[0.07475 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
>       var_0 = double_linked_list_0.push(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09974a75b0>
val = b'\x0c\x9f*\xec'

>   ???
E   NameError: name 'tail' is not defined

queue4:48: NameError

   - [# 156] SVD queue4: 
--------------------------------------------------------------------------------
   45:         self.head = Node(val, next_node=old_head)
   46:         if old_head:
   47:             old_head.prev = self.head
   48:         if not (self.tail):
-  49:             self.tail = self.head
+  49:             self.tail = head
   50:         self._length += 1
   51:     
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
--------------------------------------------------------------------------------
[0.07461 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
>       var_0 = double_linked_list_0.push(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09971f8670>
val = b'\x0c\x9f*\xec'

>   ???
E   NameError: name 'head' is not defined

queue4:49: NameError
