   - [# 158] SVD queue4: 
--------------------------------------------------------------------------------
   50:         self._length += 1
   51:     
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
-  54:         to_return = self.head
+  54:         to_return = head
   55:         if self._length < 1:
   56:             raise IndexError('Cannot pop from an empty list.')
   57:         
   58:         new_head = self.head.next
--------------------------------------------------------------------------------
[0.07740 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09971f20e0>

>   ???
E   NameError: name 'head' is not defined

queue4:54: NameError

   - [# 159] SVD queue4: 
--------------------------------------------------------------------------------
   51:     
   52:     def pop(self):
   53:         '''Remove the val from the head of the list.'''
   54:         to_return = self.head
-  55:         if self._length < 1:
+  55:         if _length < 1:
   56:             raise IndexError('Cannot pop from an empty list.')
   57:         
   58:         new_head = self.head.next
   59:         if new_head:
--------------------------------------------------------------------------------
[0.07695 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997337d00>

>   ???
E   NameError: name '_length' is not defined

queue4:55: NameError

   - [# 160] SVD queue4: 
--------------------------------------------------------------------------------
   54:         to_return = self.head
   55:         if self._length < 1:
   56:             raise IndexError('Cannot pop from an empty list.')
   57:         
-  58:         new_head = self.head.next
+  58:         new_head = head.next
   59:         if new_head:
   60:             new_head.prev = None
   61:         self.head = new_head
   62:         self._length -= 1
--------------------------------------------------------------------------------
[0.09686 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f099737cdc0>

>   ???
E   NameError: name 'head' is not defined

queue4:58: NameError

   - [# 163] SVD queue4: 
--------------------------------------------------------------------------------
   59:         if new_head:
   60:             new_head.prev = None
   61:         self.head = new_head
   62:         self._length -= 1
-  63:         if self._length < 1:
+  63:         if _length < 1:
   64:             self.tail = None
   65:         return to_return.data
   66:     
   67:     def append(self, val):
--------------------------------------------------------------------------------
[0.07623 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:145: in dequeue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997707400>

>   ???
E   NameError: name '_length' is not defined

queue4:63: NameError

   - [# 165] SVD queue4: 
--------------------------------------------------------------------------------
   65:         return to_return.data
   66:     
   67:     def append(self, val):
   68:         '''Add val to the tail of the list.'''
-  69:         old_tail = self.tail
+  69:         old_tail = tail
   70:         self.tail = Node(val, prev=old_tail)
   71:         if old_tail:
   72:             old_tail.next = self.tail
   73:         if self._length < 1:
--------------------------------------------------------------------------------
[0.07677 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(bytes_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
>       var_1 = double_linked_list_0.append(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f099726ed40>
val = b'\x0c\x9f*\xec'

>   ???
E   NameError: name 'tail' is not defined

queue4:69: NameError

   - [# 167] SVD queue4: 
--------------------------------------------------------------------------------
   68:         '''Add val to the tail of the list.'''
   69:         old_tail = self.tail
   70:         self.tail = Node(val, prev=old_tail)
   71:         if old_tail:
-  72:             old_tail.next = self.tail
+  72:             old_tail.next = tail
   73:         if self._length < 1:
   74:             self.head = self.tail
   75:         self._length += 1
   76:     
--------------------------------------------------------------------------------
[0.09729 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(bytes_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
>       var_1 = double_linked_list_0.append(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09972533d0>
val = b'\x0c\x9f*\xec'

>   ???
E   NameError: name 'tail' is not defined

queue4:72: NameError

   - [# 168] SVD queue4: 
--------------------------------------------------------------------------------
   69:         old_tail = self.tail
   70:         self.tail = Node(val, prev=old_tail)
   71:         if old_tail:
   72:             old_tail.next = self.tail
-  73:         if self._length < 1:
+  73:         if _length < 1:
   74:             self.head = self.tail
   75:         self._length += 1
   76:     
   77:     def shift(self):
--------------------------------------------------------------------------------
[0.07755 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_1

def test_case_1():
        bytes_0 = b'\x0c\x9f*\xec'
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(bytes_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
>       var_1 = double_linked_list_0.append(bytes_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997423f40>
val = b'\x0c\x9f*\xec'

>   ???
E   NameError: name '_length' is not defined

queue4:73: NameError

   - [# 170] SVD queue4: 
--------------------------------------------------------------------------------
   70:         self.tail = Node(val, prev=old_tail)
   71:         if old_tail:
   72:             old_tail.next = self.tail
   73:         if self._length < 1:
-  74:             self.head = self.tail
+  74:             self.head = tail
   75:         self._length += 1
   76:     
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
--------------------------------------------------------------------------------
[0.07769 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
>       var_0 = queue_0.enqueue(queue_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
queue4:141: in enqueue
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09974a1b10>
val = <queue4.Queue object at 0x7f09974a3d30>

>   ???
E   NameError: name 'tail' is not defined

queue4:74: NameError

   - [# 172] SVD queue4: 
--------------------------------------------------------------------------------
   75:         self._length += 1
   76:     
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
-  79:         to_return = self.tail
+  79:         to_return = tail
   80:         if self._length < 1:
   81:             raise IndexError('Cannot shift from an empty list.')
   82:         
   83:         new_tail = self.tail.prev
--------------------------------------------------------------------------------
[0.07716 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_2

def test_case_2():
        none_type_0 = None
        double_linked_list_0 = module_0.DoubleLinkedList(none_type_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        double_linked_list_1 = module_0.DoubleLinkedList(none_type_0)
        assert double_linked_list_1.head is None
        assert double_linked_list_1.tail is None
        with pytest.raises(IndexError):
>           double_linked_list_1.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997301390>

>   ???
E   NameError: name 'tail' is not defined

queue4:79: NameError

   - [# 173] SVD queue4: 
--------------------------------------------------------------------------------
   76:     
   77:     def shift(self):
   78:         '''Remove the val from the tail of the list.'''
   79:         to_return = self.tail
-  80:         if self._length < 1:
+  80:         if _length < 1:
   81:             raise IndexError('Cannot shift from an empty list.')
   82:         
   83:         new_tail = self.tail.prev
   84:         if new_tail:
--------------------------------------------------------------------------------
[0.07663 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_2

def test_case_2():
        none_type_0 = None
        double_linked_list_0 = module_0.DoubleLinkedList(none_type_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        double_linked_list_1 = module_0.DoubleLinkedList(none_type_0)
        assert double_linked_list_1.head is None
        assert double_linked_list_1.tail is None
        with pytest.raises(IndexError):
>           double_linked_list_1.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09976f38e0>

>   ???
E   NameError: name '_length' is not defined

queue4:80: NameError

   - [# 174] SVD queue4: 
--------------------------------------------------------------------------------
   79:         to_return = self.tail
   80:         if self._length < 1:
   81:             raise IndexError('Cannot shift from an empty list.')
   82:         
-  83:         new_tail = self.tail.prev
+  83:         new_tail = tail.prev
   84:         if new_tail:
   85:             new_tail.next = None
   86:         self.tail = new_tail
   87:         self._length -= 1
--------------------------------------------------------------------------------
[0.07850 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        node_0 = module_0.Node(dict_0, tuple_0)
        var_0 = double_linked_list_0.pop()
        assert var_0 == 189
        queue_0 = module_0.Queue(tuple_0)
>       var_1 = double_linked_list_0.shift()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:81: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09973b6980>

>   ???
E   NameError: name 'tail' is not defined

queue4:83: NameError

   - [# 179] SVD queue4: 
--------------------------------------------------------------------------------
   90:         return to_return.data
   91:     
   92:     def remove(self, val):
   93:         '''Remove first occurance of val from list.'''
-  94:         curr = self.head
+  94:         curr = head
   95:         while curr:
   96:             if curr.data is val:
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
--------------------------------------------------------------------------------
[0.07877 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_6

def test_case_6():
        bool_0 = True
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(bool_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        with pytest.raises(ValueError):
>           double_linked_list_0.remove(none_type_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:67: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997391d80>, val = None

>   ???
E   NameError: name 'head' is not defined

queue4:94: NameError

   - [# 180] SVD queue4: 
--------------------------------------------------------------------------------
   93:         '''Remove first occurance of val from list.'''
   94:         curr = self.head
   95:         while curr:
   96:             if curr.data is val:
-  97:                 if self._length == 1:
+  97:                 if _length == 1:
   98:                     (self.head, self.tail) = (None, None)
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
--------------------------------------------------------------------------------
[0.07744 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_8

def test_case_8():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.append(double_linked_list_0)
        assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
>       var_1 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:91: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997287370>
val = <queue4.DoubleLinkedList object at 0x7f0997287370>

>   ???
E   NameError: name '_length' is not defined

queue4:97: NameError

   - [# 183] SVD queue4: 
--------------------------------------------------------------------------------
   95:         while curr:
   96:             if curr.data is val:
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
-  99:                 elif (curr is not self.head and curr is not self.tail):
+  99:                 elif (curr is not head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
--------------------------------------------------------------------------------
[0.07911 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_9

def test_case_9():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(none_type_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(double_linked_list_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:106: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09972861a0>
val = <queue4.DoubleLinkedList object at 0x7f09972861a0>

>   ???
E   NameError: name 'head' is not defined

queue4

   - [# 184] SVD queue4: 
--------------------------------------------------------------------------------
   95:         while curr:
   96:             if curr.data is val:
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
-  99:                 elif (curr is not self.head and curr is not self.tail):
+  99:                 elif (curr is not self.head and curr is not tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
--------------------------------------------------------------------------------
[0.07894 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_11

def test_case_11():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(double_linked_list_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(var_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:136: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997501030>
val = <queue4.DoubleLinkedList object at 0x7f0997501030>

>   ???
E   NameError: name 'tail' is not defined

queue4:99: NameError

   - [# 185] SVD queue4: 
--------------------------------------------------------------------------------
   97:                 if self._length == 1:
   98:                     (self.head, self.tail) = (None, None)
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
- 101:                 elif curr is self.head:
+ 101:                 elif curr is head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
  103:                 elif curr is self.tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
--------------------------------------------------------------------------------
[0.07854 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_9

def test_case_9():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        none_type_0 = None
        var_0 = double_linked_list_0.push(none_type_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(double_linked_list_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:106: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f0997503be0>
val = <queue4.DoubleLinkedList object at 0x7f0997503be0>

>   ???
E   NameError: name 'head' is no

   - [# 187] SVD queue4: 
--------------------------------------------------------------------------------
   99:                 elif (curr is not self.head and curr is not self.tail):
  100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
  101:                 elif curr is self.head:
  102:                     (self.head, curr.next.prev) = (curr.next, None)
- 103:                 elif curr is self.tail:
+ 103:                 elif curr is tail:
  104:                     (self.tail, curr.prev.next) = (curr.prev, None)
  105:                 self._length -= 1
  106:                 return
  107:             curr = curr.next
--------------------------------------------------------------------------------
[0.08011 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_11

def test_case_11():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.push(double_linked_list_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{type(double_linked_list_0.tail).__qualname__}' == 'queue4.Node'
        var_1 = double_linked_list_0.push(var_0)
>       var_2 = double_linked_list_0.remove(double_linked_list_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:136: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.DoubleLinkedList object at 0x7f09970d4f40>
val = <queue4.DoubleLinkedList object at 0x7f09970d4f40>

>   ???
E   NameError: name 'tail' is not defined

queue4:103: NameError

   - [# 190] SVD queue4: 
--------------------------------------------------------------------------------
  112:         '''Return list representation of dll.'''
  113:         l = []
  114:         while True:
  115:             try:
- 116:                 popped_data = self.pop()
+ 116:                 popped_data = pop()
  117:                 l.append(popped_data)
  118:             except IndexError:
  119:                 break
  120:         return l
--------------------------------------------------------------------------------
[0.06917 s] survived

   - [# 192] SVD queue4: 
--------------------------------------------------------------------------------
  137:         self._container = DoubleLinkedList(data)
  138:     
  139:     def enqueue(self, val):
  140:         '''Add a value to the queue.'''
- 141:         self._container.append(val)
+ 141:         _container.append(val)
  142:     
  143:     def dequeue(self):
  144:         '''Remove a value from the front of the queue.'''
  145:         return self._container.pop()
--------------------------------------------------------------------------------
[0.07577 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
>       var_0 = queue_0.enqueue(queue_0)

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.Queue object at 0x7f099720cc70>
val = <queue4.Queue object at 0x7f099720cc70>

>   ???
E   NameError: name '_container' is not defined

queue4:141: NameError

   - [# 193] SVD queue4: 
--------------------------------------------------------------------------------
  141:         self._container.append(val)
  142:     
  143:     def dequeue(self):
  144:         '''Remove a value from the front of the queue.'''
- 145:         return self._container.pop()
+ 145:         return _container.pop()
  146:     
  147:     def peek(self):
  148:         '''Return the next value in the queue without dequing it.'''
  149:         try:
--------------------------------------------------------------------------------
[0.07737 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
>       var_1 = queue_0.dequeue()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.Queue object at 0x7f09971fad70>

>   ???
E   NameError: name '_container' is not defined

queue4:145: NameError

   - [# 194] SVD queue4: 
--------------------------------------------------------------------------------
  146:     
  147:     def peek(self):
  148:         '''Return the next value in the queue without dequing it.'''
  149:         try:
- 150:             return self._container.head.data
+ 150:             return _container.head.data
  151:         except AttributeError:
  152:             return None
  153:     
  154:     def size(self):
--------------------------------------------------------------------------------
[0.07179 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
>       var_0 = queue_0.peek()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.Queue object at 0x7f09977077c0>

>   ???
E   NameError: name '_container' is not defined

queue4:150: NameError
