   - [# 195] SVD queue4: 
--------------------------------------------------------------------------------
  152:             return None
  153:     
  154:     def size(self):
  155:         '''Return the size of the queue.'''
- 156:         return self._container._length
+ 156:         return _container._length
--------------------------------------------------------------------------------
[0.07646 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_5

def test_case_5():
        bool_0 = False
        queue_0 = module_0.Queue(bool_0)
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'queue4.Queue'
        var_0 = queue_0.enqueue(queue_0)
        var_1 = queue_0.dequeue()
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue4.Queue'
>       var_2 = queue_0.size()

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:53: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue4.Queue object at 0x7f09973b8160>

>   ???
E   NameError: name '_container' is not defined

queue4:156: NameError

   - [# 196] ZIL queue4: 
--------------------------------------------------------------------------------
   33:         self.tail = None
   34:         self._length = 0
   35:         try:
   36:             for val in data:
-  37:                 self.push(val)
+  37:                 break
   38:         except TypeError:
   39:             if data:
   40:                 self.push(data)
   41:     
--------------------------------------------------------------------------------
[0.07702 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_7

def test_case_7():
        tuple_0 = ()
        bytes_0 = b'\xe8\xd6\x1f\xb2\xa07\xcfn1=J\xbd'
        dict_0 = {bytes_0: tuple_0, bytes_0: bytes_0}
        double_linked_list_0 = module_0.DoubleLinkedList(bytes_0)
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
>       assert f'{type(double_linked_list_0.head).__module__}.{type(double_linked_list_0.head).__qualname__}' == 'queue4.Node'
E       AssertionError

MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py:75: AssertionError

   - [# 197] ZIL queue4: 
--------------------------------------------------------------------------------
   92:     def remove(self, val):
   93:         '''Remove first occurance of val from list.'''
   94:         curr = self.head
   95:         while curr:
-  96:             if curr.data is val:
-  97:                 if self._length == 1:
-  98:                     (self.head, self.tail) = (None, None)
-  99:                 elif (curr is not self.head and curr is not self.tail):
- 100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
- 101:                 elif curr is self.head:
- 102:                     (self.head, curr.next.prev) = (curr.next, None)
- 103:                 elif curr is self.tail:
- 104:                     (self.tail, curr.prev.next) = (curr.prev, None)
- 105:                 self._length -= 1
- 106:                 return
- 107:             curr = curr.next
+  96:             break
+  97:         
+  98:         
+  99:         
+ 100:         
+ 101:         
+ 102:         
+ 103:         
+ 104:         
+ 105:         
+ 106:         
+ 107:         
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
  111:     def _repr(self):
--------------------------------------------------------------------------------
[0.09854 s] killed by MIO-WHOLE_SUITE/test_queue4_WHOLE_SUITE.py::test_case_8

def test_case_8():
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert f'{type(double_linked_list_0).__module__}.{type(double_linked_list_0).__qualname__}' == 'queue4.DoubleLinkedList'
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_0 = double_linked_list_0.append(double_linked_list_0)
        assert f

   - [# 198] ZIL queue4: 
--------------------------------------------------------------------------------
  111:     def _repr(self):
  112:         '''Return list representation of dll.'''
  113:         l = []
  114:         while True:
- 115:             try:
- 116:                 popped_data = self.pop()
- 117:                 l.append(popped_data)
- 118:             except IndexError:
- 119:                 break
+ 115:             break
+ 116:         
+ 117:         
+ 118:         
+ 119:         
  120:         return l
  121: 
  122: 
  123: class Queue(object):
--------------------------------------------------------------------------------
[0.06903 s] survived
