   - [#   1] CDI queue5: 
--------------------------------------------------------------------------------
   1: class Node(object):
   2:     
-  3:     def __init__(self, data):
-  4:         self.data = data
-  5:         self.next = None
-  6: 
+  3:     @classmethod
+  4:     def __init__(self, data):
+  5:         self.data = data
+  6:         self.next = None
   7: 
   8: class Queue(object):
   9:     
  10:     def __init__(self):
--------------------------------------------------------------------------------
[0.08316 s] killed by MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py::test_case_5

def test_case_5():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        bytes_0 = b'`\xf8e\x02J'
        var_1 = queue_0.enqueue(bytes_0)
        var_2 = queue_0.dequeue()
>       assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue5.Queue'
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py:55: AssertionError

   - [#   2] CDI queue5: 
--------------------------------------------------------------------------------
   6: 
   7: 
   8: class Queue(object):
   9:     
- 10:     def __init__(self):
- 11:         self.head = None
- 12:         self.tail = None
- 13:     
+ 10:     @classmethod
+ 11:     def __init__(self):
+ 12:         self.head = None
+ 13:         self.tail = None
  14:     def enqueue(self, data):
  15:         node = Node(data)
  16:         
  17:         if (self.head is None and self.tail is None):
--------------------------------------------------------------------------------
[0.06217 s] survived

   - [#   3] CDI queue5: 
--------------------------------------------------------------------------------
  10:     def __init__(self):
  11:         self.head = None
  12:         self.tail = None
  13:     
- 14:     def enqueue(self, data):
- 15:         node = Node(data)
- 16:         
- 17:         if (self.head is None and self.tail is None):
- 18:             self.head = node
- 19:             self.tail = node
- 20:         else:
- 21:             self.tail.next = node
- 22:             self.tail = node
- 23:     
+ 14:     @classmethod
+ 15:     def enqueue(self, data):
+ 16:         node = Node(data)
+ 17:         
+ 18:         if (self.head is None and self.tail is None):
+ 19:             self.head = node
+ 20:             self.tail = node
+ 21:         else:
+ 22:             self.tail.next = node
+ 23:             self.tail = node
  24:     def dequeue(self):
  25:         
  26:         if (self.head is None and self.tail is None):
  27:             return None
--------------------------------------------------------------------------------
[0.06886 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'queue5.Queue'>, data = <queue5.Queue object at 0x7ff5d3e03b20>

>   ???
E   AttributeError: type object 'Queue' has no attribute 'head'

   - [#   4] CDI queue5: 
--------------------------------------------------------------------------------
  20:         else:
  21:             self.tail.next = node
  22:             self.tail = node
  23:     
- 24:     def dequeue(self):
- 25:         
- 26:         if (self.head is None and self.tail is None):
- 27:             return None
- 28:         data = self.head.data
- 29:         
- 30:         if self.head == self.tail:
- 31:             self.head = None
- 32:             self.tail = None
- 33:         else:
- 34:             self.head = self.head.next
- 35:         return data
+ 24:     @classmethod
+ 25:     def dequeue(self):
+ 26:         
+ 27:         if (self.head is None and self.tail is None):
+ 28:             return None
+ 29:         data = self.head.data
+ 30:         
+ 31:         if self.head == self.tail:
+ 32:             self.head = None
+ 33:             self.tail = None
+ 34:         else:
+ 35:             self.head = self.head.next
+ 36:         return data
--------------------------------------------------------------------------------
[0.06947 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
>       var_1 = queue_2.dequeue()

   - [#   5] COI queue5: 
--------------------------------------------------------------------------------
  13:     
  14:     def enqueue(self, data):
  15:         node = Node(data)
  16:         
- 17:         if (self.head is None and self.tail is None):
+ 17:         if not ((self.head is None and self.tail is None)):
  18:             self.head = node
  19:             self.tail = node
  20:         else:
  21:             self.tail.next = node
--------------------------------------------------------------------------------
[0.06607 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d4090ac0>
data = <queue5.Queue object at 0x7ff5d4090ac0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

queue5:21: AttributeError

   - [#   7] COI queue5: 
--------------------------------------------------------------------------------
  26:         if (self.head is None and self.tail is None):
  27:             return None
  28:         data = self.head.data
  29:         
- 30:         if self.head == self.tail:
+ 30:         if not (self.head == self.tail):
  31:             self.head = None
  32:             self.tail = None
  33:         else:
  34:             self.head = self.head.next
--------------------------------------------------------------------------------
[0.07161 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.dequeue()
        assert queue_0.head is None
>       assert queue_0.tail is None
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:34: AssertionError

   - [#   8] LCR queue5: 
--------------------------------------------------------------------------------
  13:     
  14:     def enqueue(self, data):
  15:         node = Node(data)
  16:         
- 17:         if (self.head is None and self.tail is None):
+ 17:         if (self.head is None or self.tail is None):
  18:             self.head = node
  19:             self.tail = node
  20:         else:
  21:             self.tail.next = node
--------------------------------------------------------------------------------
[0.05215 s] survived

   - [#  10] ROR queue5: 
--------------------------------------------------------------------------------
  26:         if (self.head is None and self.tail is None):
  27:             return None
  28:         data = self.head.data
  29:         
- 30:         if self.head == self.tail:
+ 30:         if self.head != self.tail:
  31:             self.head = None
  32:             self.tail = None
  33:         else:
  34:             self.head = self.head.next
--------------------------------------------------------------------------------
[0.06980 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.dequeue()
        assert queue_0.head is None
>       assert queue_0.tail is None
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:34: AssertionError

   - [#  19] SDL queue5: 
--------------------------------------------------------------------------------
  11:         self.head = None
  12:         self.tail = None
  13:     
  14:     def enqueue(self, data):
- 15:         node = Node(data)
+ 15:         pass
  16:         
  17:         if (self.head is None and self.tail is None):
  18:             self.head = node
  19:             self.tail = node
--------------------------------------------------------------------------------
[0.06695 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3e002e0>
data = <queue5.Queue object at 0x7ff5d3e002e0>

>   ???
E   NameError: name 'node' is not defined

queue5:18: NameError

   - [#  20] SDL queue5: 
--------------------------------------------------------------------------------
  14:     def enqueue(self, data):
  15:         node = Node(data)
  16:         
  17:         if (self.head is None and self.tail is None):
- 18:             self.head = node
+ 18:             pass
  19:             self.tail = node
  20:         else:
  21:             self.tail.next = node
  22:             self.tail = node
--------------------------------------------------------------------------------
[0.06881 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
>       assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:8: AssertionError

   - [#  21] SDL queue5: 
--------------------------------------------------------------------------------
  15:         node = Node(data)
  16:         
  17:         if (self.head is None and self.tail is None):
  18:             self.head = node
- 19:             self.tail = node
+ 19:             pass
  20:         else:
  21:             self.tail.next = node
  22:             self.tail = node
  23:     
--------------------------------------------------------------------------------
[0.07271 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
>       assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:9: AssertionError

   - [#  22] SDL queue5: 
--------------------------------------------------------------------------------
  17:         if (self.head is None and self.tail is None):
  18:             self.head = node
  19:             self.tail = node
  20:         else:
- 21:             self.tail.next = node
+ 21:             pass
  22:             self.tail = node
  23:     
  24:     def dequeue(self):
  25:         
--------------------------------------------------------------------------------
[0.07190 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_4

def test_case_4():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.enqueue(queue_0)
        var_2 = queue_0.dequeue()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue5.Queue'
>       assert f'{type(var_2.head).__module__}.{type(var_2.head).__qualname__}' == 'queue5.Node'
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:47: AssertionError

   - [#  23] SDL queue5: 
--------------------------------------------------------------------------------
  18:             self.head = node
  19:             self.tail = node
  20:         else:
  21:             self.tail.next = node
- 22:             self.tail = node
+ 22:             pass
  23:     
  24:     def dequeue(self):
  25:         
  26:         if (self.head is None and self.tail is None):
--------------------------------------------------------------------------------
[0.07288 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_4

def test_case_4():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.enqueue(queue_0)
        var_2 = queue_0.dequeue()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue5.Queue'
>       assert f'{type(var_2.head).__module__}.{type(var_2.head).__qualname__}' == 'queue5.Node'
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:47: AssertionError

   - [#  24] SDL queue5: 
--------------------------------------------------------------------------------
  23:     
  24:     def dequeue(self):
  25:         
  26:         if (self.head is None and self.tail is None):
- 27:             return None
+ 27:             pass
  28:         data = self.head.data
  29:         
  30:         if self.head == self.tail:
  31:             self.head = None
--------------------------------------------------------------------------------
[0.07133 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
>       var_1 = queue_2.dequeue()

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:20: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3fdf1f0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

queue5:28: AttributeError

   - [#  25] SDL queue5: 
--------------------------------------------------------------------------------
  24:     def dequeue(self):
  25:         
  26:         if (self.head is None and self.tail is None):
  27:             return None
- 28:         data = self.head.data
+ 28:         pass
  29:         
  30:         if self.head == self.tail:
  31:             self.head = None
  32:             self.tail = None
--------------------------------------------------------------------------------
[0.07163 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
>       var_1 = queue_0.dequeue()

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3e0ed70>

>   ???
E   NameError: name 'data' is not defined

queue5:35: NameError

   - [#  26] SDL queue5: 
--------------------------------------------------------------------------------
  27:             return None
  28:         data = self.head.data
  29:         
  30:         if self.head == self.tail:
- 31:             self.head = None
+ 31:             pass
  32:             self.tail = None
  33:         else:
  34:             self.head = self.head.next
  35:         return data
--------------------------------------------------------------------------------
[0.06884 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.dequeue()
>       assert queue_0.head is None
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:33: AssertionError

   - [#  28] SDL queue5: 
--------------------------------------------------------------------------------
  30:         if self.head == self.tail:
  31:             self.head = None
  32:             self.tail = None
  33:         else:
- 34:             self.head = self.head.next
+ 34:             pass
  35:         return data
--------------------------------------------------------------------------------
[0.07163 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_4

def test_case_4():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.enqueue(queue_0)
        var_2 = queue_0.dequeue()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'queue5.Queue'
        assert f'{type(var_2.head).__module__}.{type(var_2.head).__qualname__}' == 'queue5.Node'
        assert f'{type(var_2.tail).__module__}.{type(var_2.tail).__qualname__}' == 'queue5.Node'
        var_3 = queue_0.dequeue()
>       assert queue_0.head is None
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:50: AssertionError

   - [#  29] SDL queue5: 
--------------------------------------------------------------------------------
  31:             self.head = None
  32:             self.tail = None
  33:         else:
  34:             self.head = self.head.next
- 35:         return data
+ 35:         pass
--------------------------------------------------------------------------------
[0.07216 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.dequeue()
        assert queue_0.head is None
        assert queue_0.tail is None
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'queue5.Queue'
E       AssertionError

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:35: AssertionError

   - [#  34] SVD queue5: 
--------------------------------------------------------------------------------
  13:     
  14:     def enqueue(self, data):
  15:         node = Node(data)
  16:         
- 17:         if (self.head is None and self.tail is None):
+ 17:         if (head is None and self.tail is None):
  18:             self.head = node
  19:             self.tail = node
  20:         else:
  21:             self.tail.next = node
--------------------------------------------------------------------------------
[0.07991 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3d44c40>
data = <queue5.Queue object at 0x7ff5d3d44c40>

>   ???
E   NameError: name 'head' is not defined

queue5:17: NameError

   - [#  35] SVD queue5: 
--------------------------------------------------------------------------------
  13:     
  14:     def enqueue(self, data):
  15:         node = Node(data)
  16:         
- 17:         if (self.head is None and self.tail is None):
+ 17:         if (self.head is None and tail is None):
  18:             self.head = node
  19:             self.tail = node
  20:         else:
  21:             self.tail.next = node
--------------------------------------------------------------------------------
[0.06871 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_0

def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3e0c610>
data = <queue5.Queue object at 0x7ff5d3e0c610>

>   ???
E   NameError: name 'tail' is not defined

queue5:17: NameError

   - [#  38] SVD queue5: 
--------------------------------------------------------------------------------
  17:         if (self.head is None and self.tail is None):
  18:             self.head = node
  19:             self.tail = node
  20:         else:
- 21:             self.tail.next = node
+ 21:             tail.next = node
  22:             self.tail = node
  23:     
  24:     def dequeue(self):
  25:         
--------------------------------------------------------------------------------
[0.07211 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_1

def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.dequeue()
>       var_2 = queue_0.enqueue(bool_0)

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3cfa740>, data = True

>   ???
E   NameError: name 'tail' is not defined

queue5:21: NameError

   - [#  42] SVD queue5: 
--------------------------------------------------------------------------------
  24:     def dequeue(self):
  25:         
  26:         if (self.head is None and self.tail is None):
  27:             return None
- 28:         data = self.head.data
+ 28:         data = head.data
  29:         
  30:         if self.head == self.tail:
  31:             self.head = None
  32:             self.tail = None
--------------------------------------------------------------------------------
[0.07206 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
>       var_1 = queue_0.dequeue()

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3d45cf0>

>   ???
E   NameError: name 'head' is not defined

queue5:28: NameError

   - [#  43] SVD queue5: 
--------------------------------------------------------------------------------
  26:         if (self.head is None and self.tail is None):
  27:             return None
  28:         data = self.head.data
  29:         
- 30:         if self.head == self.tail:
+ 30:         if head == self.tail:
  31:             self.head = None
  32:             self.tail = None
  33:         else:
  34:             self.head = self.head.next
--------------------------------------------------------------------------------
[0.07221 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
>       var_1 = queue_0.dequeue()

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3e01fc0>

>   ???
E   NameError: name 'head' is not defined

queue5:30: NameError

   - [#  44] SVD queue5: 
--------------------------------------------------------------------------------
  26:         if (self.head is None and self.tail is None):
  27:             return None
  28:         data = self.head.data
  29:         
- 30:         if self.head == self.tail:
+ 30:         if self.head == tail:
  31:             self.head = None
  32:             self.tail = None
  33:         else:
  34:             self.head = self.head.next
--------------------------------------------------------------------------------
[0.07058 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_3

def test_case_3():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
>       var_1 = queue_0.dequeue()

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3ee6aa0>

>   ???
E   NameError: name 'tail' is not defined

queue5:30: NameError

   - [#  48] SVD queue5: 
--------------------------------------------------------------------------------
  30:         if self.head == self.tail:
  31:             self.head = None
  32:             self.tail = None
  33:         else:
- 34:             self.head = self.head.next
+ 34:             self.head = head.next
  35:         return data
--------------------------------------------------------------------------------
[0.07338 s] killed by MOSA-WHOLE_SUITE/test_queue5_MOSA.py::test_case_4

def test_case_4():
        queue_0 = module_0.Queue()
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        var_1 = queue_0.enqueue(queue_0)
>       var_2 = queue_0.dequeue()

MOSA-WHOLE_SUITE/test_queue5_MOSA.py:45: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <queue5.Queue object at 0x7ff5d3e01ab0>

>   ???
E   NameError: name 'head' is not defined

queue5:34: NameError
