1 : Job ID 956447e0292c4cac9cb82eea5c52e239
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i-1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

2 : Job ID 506f278d1b9f41cc8347ef80caba4cbd
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos-1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - IndexError: list i...
========================= 1 failed, 41 passed in 0.06s =========================

3 : Job ID 95081e6598734983bc1fe17ff0879292
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i*1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.05s ==============================

4 : Job ID 005865d2d46c4cc6afc850d8e26b63d0
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos*1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

5 : Job ID 246ba5dda9f44ba6b7659b03ededc81e
test outcome: killed
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i/1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py F......F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .F.......                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_0 - TypeError: 'fl...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - TypeError: 'fl...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_1 - TypeError: 'float'...
========================= 3 failed, 39 passed in 0.06s =========================

6 : Job ID 9db7a15704924acd8aabde7c27e9e70f
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos/1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - TypeError: 'float'...
========================= 1 failed, 41 passed in 0.06s =========================

7 : Job ID 97e4ce42cdc8486eab11ef79af7c159e
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i//1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

8 : Job ID da2a51d7d1614085968571c24c10af9f
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos//1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

9 : Job ID 877db1b68a6b48328ceec87f1e413eee
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i%1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.05s ==============================

10 : Job ID afe20deec0cc4513bbafdea4072b1053
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos%1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

11 : Job ID a057ec59c80d4f3ea40b40beb09ffc48
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i**1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.05s ==============================

12 : Job ID ab883b208f6744ab824f73087709e7df
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos**1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

13 : Job ID d382865b341d4dd19ecd75a53f0df8c4
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i>>1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

14 : Job ID 692f8eee82eb4acd917ede54d0d9fefb
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos>>1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

15 : Job ID 5c668d6cb2c34bdba766e60722daeca0
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i<<1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

16 : Job ID 95491db7904048d5840f41e3ffc46a93
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos<<1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

17 : Job ID d07c2b4a660845fc907b94661fc91c9b
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i|1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.05s ==============================

18 : Job ID 44b4b2096fa54b9ca0c24ff76b1e25b5
SURVIVED
test outcome: survived
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos|1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.05s ==============================

19 : Job ID 2693311ad2f7402098f67a83d209537d
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i&1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

20 : Job ID 337682ea36374d4f84320157ed7d4e18
test outcome: killed
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos&1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

21 : Job ID 471b47a3ce3c41d795a3443c2bd7572e
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 28), end pos: (15, 29)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i^1, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

22 : Job ID 6472723c7ef44241b48816e4e89760fa
SURVIVED
test outcome: survived
sort1.py, start pos: (86, 36), end pos: (86, 37)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos^1, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

23 : Job ID 3194427e1b9e4ac080d87a0b8b8c3650
test outcome: killed
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos+1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py FF.....FF...FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.F...........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .FF.....F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_0 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_1 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - Index

24 : Job ID cbd17b603fb94e4898c39f49be743b30
test outcome: killed
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos+1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ............FF.                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
========================= 2 failed, 40 passed in 0.06s =========================

25 : Job ID d569dcf1636b4e9a809116d4aeb21a6b
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos+1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ............FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.............                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - IndexError: list as...
========================= 4 failed, 38 passed in 0.06s =========================

26 : Job ID 9cf712fce222448b8fd3923d317efa17
test outcome: killed
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos+1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.06s =========================

27 : Job ID 708c3bfbe6d142afb1f79b4b6fba510a
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos*1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

28 : Job ID d3acbcea2b4d4b9b9c00d460b71811e4
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos*1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.05s ==============================

29 : Job ID 6860cd04f0154588b288f13a0e4dd588
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos*1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
timeout

30 : Job ID 5e12ef1198074f6284593fbad87d1545
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos*1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================
