31 : Job ID 8ef230ebf8b24effa2020119419cf697
test outcome: killed
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos/1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py FF.....FF...FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.F...........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .FF.....F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_0 - TypeError: lis...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_1 - TypeError: lis...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - TypeError: lis...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - TypeError: lis...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - TypeE

32 : Job ID f63af982236f4d3f94e1368dba7fb4b3
test outcome: killed
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos/1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ............FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.............                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - TypeError: list ind...
========================= 4 failed, 38 passed in 0.06s =========================

33 : Job ID 8924e5910f414be797c70f4e261d7649
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos/1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ............FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.............                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - TypeError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - TypeError: list ind...
========================= 4 failed, 38 passed in 0.06s =========================

34 : Job ID afde411584454a328c0079daa8d0ba8d
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos/1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

35 : Job ID d55eb6f35fb3414aa829145f364a2cca
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos//1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

36 : Job ID e8db37b8ceee4fdea811260165305175
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos//1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

37 : Job ID fcc37ea0e6724a3db9d7a96413b80f28
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos//1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
timeout

38 : Job ID 5cd12830c09d48e7b6d165bd63c5930f
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos//1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

39 : Job ID b89c979bdc5344cc9e90c27bba84013e
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos%1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

40 : Job ID d1f84a3c39224801873df7fb44866882
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos%1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

41 : Job ID 62b31373b6e244409a0fe5b79ef961fe
SURVIVED
test outcome: survived
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos%1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.06s ==============================

42 : Job ID dc5f11846b214c6faac8fc1e82d73172
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos%1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

43 : Job ID 66c5af8841494413a03ac23e37199aeb
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos**1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

44 : Job ID b53c09a9b1e747afb369bc804d126037
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos**1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

45 : Job ID bde7a7f89a4642b1902fe4803ee05188
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos**1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
timeout

46 : Job ID 4ccc125925cf49b0a017e466f6a3cd76
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos**1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

47 : Job ID 9e42cc3c537441fea3524aae2c5e5b9e
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos>>1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

48 : Job ID 4251d2201ce34b7f9b4e901202f6d3d2
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos>>1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

49 : Job ID 8919bd8e0b694a8581a8ec860ffb30ac
SURVIVED
test outcome: survived
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos>>1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

50 : Job ID 5d0f3949930a45caaa45b0e3fc5a6ded
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos>>1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

51 : Job ID 789a3f9b91f24ec2811053b0bf39a94a
test outcome: killed
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos<<1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py FF.....FF...FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.F...........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .FF.....F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_0 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_1 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - I

52 : Job ID 53d5c45a3a4341fa88f58ce56124f9eb
test outcome: killed
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos<<1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ............FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.............                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - IndexError: list in...
========================= 4 failed, 38 passed in 0.08s =========================

53 : Job ID 1e4400023ec54594a77629b0bb21fd9c
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos<<1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ............FFF                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F.............                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_14 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - IndexError: list in...
========================= 4 failed, 38 passed in 0.08s =========================

54 : Job ID b8857176fd184c5caff5c6c0178bc211
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos<<1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.07s ==============================

55 : Job ID 4f7de9cc69f64f94a3ac268b9647661e
test outcome: killed
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos|1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py .............F.                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ........F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - IndexError: list i...
========================= 2 failed, 40 passed in 0.07s =========================

56 : Job ID 581b4363dd8649b29ff77dbcde8282d8
test outcome: killed
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos|1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py .............F.                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
========================= 1 failed, 41 passed in 0.07s =========================

57 : Job ID 8f2bd810ea164d08bbacb7c86d04eebf
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos|1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
timeout

58 : Job ID a91f34f53fea4e2e9de8a29d2e223fa6
test outcome: killed
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos|1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.08s =========================

59 : Job ID 5e3db384e2c642edba6809885503c8a7
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos&1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.08s ==============================

60 : Job ID bcc8947e21d0463aa88bf2df4366b5e5
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos&1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.08s ==============================

61 : Job ID eeb751a444194f8580b2872f38a68a15
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos&1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
timeout
