62 : Job ID d8e7718e22464773b6d9db35851f32b0
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos&1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.08s ==============================

63 : Job ID 9470a505660b42739c446a5255e48b18
test outcome: killed
sort1.py, start pos: (31, 37), end pos: (31, 38)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos^1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py .............F.                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ........F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - IndexError: list i...
========================= 2 failed, 40 passed in 0.08s =========================

64 : Job ID 497d679ffd2e4c6aa1ced6ba2e5ba7bf
test outcome: killed
sort1.py, start pos: (33, 34), end pos: (33, 35)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos^1]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py .............F.                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
========================= 1 failed, 41 passed in 0.08s =========================

65 : Job ID 8d494e10d0a141b98579a59fa09de7ac
test outcome: killed
sort1.py, start pos: (34, 25), end pos: (34, 26)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos^1
             # Break and do the final swap
             arr[pos] = cursor
         return arr
timeout

66 : Job ID af76be3c52d8438cb30d3e69f8437d5f
test outcome: killed
sort1.py, start pos: (85, 43), end pos: (85, 44)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos^1)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.14s =========================

67 : Job ID cbea0498e4174215afa8ae21a8ee270f
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size+2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

68 : Job ID de447b95af7040b686389f7747c59639
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size-2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

69 : Job ID 13a5a06f103e4e6c896da80ec06dcfe0
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size*2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

70 : Job ID 06690c70b99c4c54b167a8e29e532ac4
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size/2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - TypeError: sli...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - TypeError: sli...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - TypeError: slice in...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - TypeError: slice i...
========================= 4 failed, 38 passed in 0.13s =========================

71 : Job ID b8826e48ac2f4ae5978cc5a75aa076bb
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size%2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

72 : Job ID c4b31b83f8854542a4b9c8c6bd836adb
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size**2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.18s =========================

73 : Job ID c0f6b99653484126b7e512b99b9eeb2f
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size>>2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

74 : Job ID 84a23ce2e8d144139faca2c060e0f5ce
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size<<2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.18s =========================

75 : Job ID e4570a383e8142b0addbaed28a00d426
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size|2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.18s =========================

76 : Job ID d3ca075e04144683b31ad331f784283a
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size&2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

77 : Job ID 328ae3a0230d43f7b69acd4b11417d3d
test outcome: killed
sort1.py, start pos: (45, 19), end pos: (45, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size^2
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.18s =========================

78 : Job ID 6f33842841a94fbc8ebb420a2d160d20
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 26), end pos: (17, 27)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if arr[j] == arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

79 : Job ID 798e97aa63d74cac9a3118c1c97bb0e0
test outcome: killed
sort1.py, start pos: (62, 26), end pos: (62, 27)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor == len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: object ...
========================= 1 failed, 41 passed in 0.13s =========================

80 : Job ID afa68683967a448cbbcdd4b83d946a76
test outcome: killed
sort1.py, start pos: (62, 55), end pos: (62, 56)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) and right_cursor == len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ........F......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ........F.........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ........F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - KeyError: 0
========================= 3 failed, 39 passed in 0.13s =========================

81 : Job ID 2485fc24495345c28da671ab9ca84e34
test outcome: killed
sort1.py, start pos: (82, 17), end pos: (82, 18)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if first == last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ......F........                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ............F.....                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_6 - TypeError: 'st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_12 - TypeError: 'Sort' ...
========================= 2 failed, 40 passed in 0.13s =========================

82 : Job ID 16d9916ed2c14fa189780899ed8c0a20
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 24), end pos: (92, 25)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if arr[pos] == arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

83 : Job ID 54d7d61550c94a70956fbb591a4156a8
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 26), end pos: (17, 27)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if arr[j] != arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

84 : Job ID fbc1e9243da44a7691b7aa22c004fbcd
SURVIVED
test outcome: survived
sort1.py, start pos: (62, 26), end pos: (62, 27)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor != len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

85 : Job ID 1f58fee1778944d99347a168349b2d25
SURVIVED
test outcome: survived
sort1.py, start pos: (62, 55), end pos: (62, 56)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) and right_cursor != len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

86 : Job ID 944a09f9023a4627af182681d6608d2c
test outcome: killed
sort1.py, start pos: (82, 17), end pos: (82, 18)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if first != last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.14s =========================

87 : Job ID 76a44bbd9caf457c82315a72bb9dd7d0
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 24), end pos: (92, 25)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if arr[pos] != arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

88 : Job ID f1a583810af549a297f77840a74b9116
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 26), end pos: (17, 27)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if arr[j] <= arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

89 : Job ID 7646cf686dd34894a47a1da60db7165d
test outcome: killed
sort1.py, start pos: (62, 26), end pos: (62, 27)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor <= len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F..F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F...F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - IndexError: st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - IndexError: index o...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - IndexError: index o...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - IndexError: string...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: object ...
========================= 6 failed, 36 passed in 0.13s ==================
