90 : Job ID 9e0b67ad23d84e35b5672d3ce4709103
test outcome: killed
sort1.py, start pos: (62, 55), end pos: (62, 56)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) and right_cursor <= len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F.....F......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......FF.........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F....F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - IndexError: st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - IndexError: index o...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - IndexError: string...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - KeyError: 0
========================= 6 failed, 36 passed in 0.13s =========================

91 : Job ID ae18d6d7e1644a1c8b63d1cbeed0bbb0
test outcome: killed
sort1.py, start pos: (82, 17), end pos: (82, 18)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if first <= last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ......F........                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ............F.....                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_6 - TypeError: 'st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_12 - TypeError: 'Sort' ...
========================= 2 failed, 40 passed in 0.13s =========================

92 : Job ID 0b76a216e0084a8abf8c5d669881975c
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 24), end pos: (92, 25)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if arr[pos] <= arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

93 : Job ID 8956fd7ef991468a9e93ddd88d7d8c52
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 26), end pos: (17, 27)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if arr[j] > arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

94 : Job ID dab9f57d1a23459494ad20fbafb2d421
SURVIVED
test outcome: survived
sort1.py, start pos: (62, 26), end pos: (62, 27)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor > len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

95 : Job ID 90f0cc034e6048809b6c6524f232eba8
SURVIVED
test outcome: survived
sort1.py, start pos: (62, 55), end pos: (62, 56)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) and right_cursor > len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

96 : Job ID 58ed644a87b441deb9e155dac151c2ff
SURVIVED
test outcome: survived
sort1.py, start pos: (82, 17), end pos: (82, 18)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if first > last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

97 : Job ID cf1ab4a4ae1c432ebea7924603017c8b
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 24), end pos: (92, 25)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if arr[pos] > arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

98 : Job ID 27732a9c80ce427182d8953dd9a4c284
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 26), end pos: (17, 27)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if arr[j] >= arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

99 : Job ID 92c4252ec05643b9bfa031771124855e
test outcome: killed
sort1.py, start pos: (62, 26), end pos: (62, 27)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor >= len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: object ...
========================= 1 failed, 41 passed in 0.13s =========================

100 : Job ID ae8466bef95f4b91a94cd86c856e25da
test outcome: killed
sort1.py, start pos: (62, 55), end pos: (62, 56)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) and right_cursor >= len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ........F......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ........F.........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ........F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - KeyError: 0
========================= 3 failed, 39 passed in 0.13s =========================

101 : Job ID b12a9977f4ed4629aa4e66300d01043e
test outcome: killed
sort1.py, start pos: (82, 17), end pos: (82, 18)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if first >= last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ......F........                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ............F.....                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_6 - TypeError: 'st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_12 - TypeError: 'Sort' ...
========================= 2 failed, 40 passed in 0.13s =========================

102 : Job ID 60f976ad6377430fa5e00a5078e95da0
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 24), end pos: (92, 25)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if arr[pos] >= arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

103 : Job ID 8194d958b2e5421f989caa46dfe0b2c3
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 26), end pos: (17, 27)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if arr[j] is arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

104 : Job ID 7a6d9eb598e341a998fd924ec5b201a2
test outcome: killed
sort1.py, start pos: (62, 26), end pos: (62, 27)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor is len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: object ...
========================= 1 failed, 41 passed in 0.13s =========================

105 : Job ID 8f76514a7fde47eea372ee0805eb4292
test outcome: killed
sort1.py, start pos: (62, 55), end pos: (62, 56)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) and right_cursor is len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ........F......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ........F.........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ........F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - KeyError: 0
========================= 3 failed, 39 passed in 0.13s =========================

106 : Job ID f1ec9cc09173475e835c221daea9db13
test outcome: killed
sort1.py, start pos: (82, 17), end pos: (82, 18)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if first is last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ......F........                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ............F.....                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_6 - TypeError: 'st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_12 - TypeError: 'Sort' ...
========================= 2 failed, 40 passed in 0.13s =========================

107 : Job ID 30a74a16ddf4402799a70c31b424f64c
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 24), end pos: (92, 25)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if arr[pos] is arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

108 : Job ID 721b49ac30374e01ab643ef8693c9106
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 26), end pos: (17, 27)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if arr[j] is not arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

109 : Job ID 0a02aabbe8a44e18a11f659c66f0ad8d
SURVIVED
test outcome: survived
sort1.py, start pos: (62, 26), end pos: (62, 27)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor is not len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.12s ==============================

110 : Job ID 89eafba287fd4d33ac9e0576047d281a
SURVIVED
test outcome: survived
sort1.py, start pos: (62, 55), end pos: (62, 56)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) and right_cursor is not len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

111 : Job ID 8a825ee325fb4083ba5946059b3bd722
test outcome: killed
sort1.py, start pos: (82, 17), end pos: (82, 18)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if first is not last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.14s =========================

112 : Job ID 90ddb2c8373449e2add8ff7b19abc46a
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 24), end pos: (92, 25)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if arr[pos] is not arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

113 : Job ID c531c5145c404a1b98633df9320762cc
test outcome: killed
sort1.py, start pos: (47, 16), end pos: (47, 18)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if size == 1:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.14s =========================

114 : Job ID 56831e39e4924e3bb9f161066bc119e3
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 33), end pos: (64, 35)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if left[left_cursor] == right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

115 : Job ID 8b6cee7cf1124bcdbd307505ea777226
SURVIVED
test outcome: survived
sort1.py, start pos: (47, 16), end pos: (47, 18)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if size != 1:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

116 : Job ID b375bf740ec7483ab46de426080e03d4
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 33), end pos: (64, 35)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if left[left_cursor] != right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

117 : Job ID 628d5692d53747b68439b6011f42039d
test outcome: killed
sort1.py, start pos: (47, 16), end pos: (47, 18)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if size < 1:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

118 : Job ID 1404c81e5a744ce6ad5d6c867c9f1bbc
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 33), end pos: (64, 35)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if left[left_cursor] < right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================
