119 : Job ID 28e87eca74654d6db2737b2dfb8727be
test outcome: killed
sort1.py, start pos: (47, 16), end pos: (47, 18)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if size > 1:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.14s =========================

120 : Job ID d3cd51ec5bb74848a05365a42f505e77
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 33), end pos: (64, 35)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if left[left_cursor] > right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

121 : Job ID 21d751e076b844a1a4a87b650fe37d7c
test outcome: killed
sort1.py, start pos: (47, 16), end pos: (47, 18)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if size >= 1:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.14s =========================

122 : Job ID b91bbeb155384512b7adf03a63dbc554
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 33), end pos: (64, 35)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if left[left_cursor] >= right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

123 : Job ID b6f0bca2a5a34d97aed42ba8394914b3
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 33), end pos: (64, 35)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if left[left_cursor] is right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

124 : Job ID 5e0d66325ca94b22a73db58702af51fb
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 33), end pos: (64, 35)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if left[left_cursor] is not right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

125 : Job ID f01ba5ac182b42b6b6063baab4ef57ca
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 22), end pos: (31, 23)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos == 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

126 : Job ID f0834614835e4f83913e7ae1f287627b
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 41), end pos: (31, 42)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos-1] == cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

127 : Job ID 007e060bfedc41c7b5185b291fbfcd9a
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 22), end pos: (31, 23)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos != 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

128 : Job ID 31853da3077b4ae8a115b1d082ee39bb
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 41), end pos: (31, 42)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos-1] != cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

129 : Job ID aaf12c789013495291452b3e2d132df2
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 22), end pos: (31, 23)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos < 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

130 : Job ID f0c8a4abde854130a4db9887ed121a1c
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 41), end pos: (31, 42)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos-1] < cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

131 : Job ID 888cf0ee3be2433897e74437f8f14185
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 22), end pos: (31, 23)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos <= 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

132 : Job ID 8c49318a4c964e619b69781d6a7f30ff
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 41), end pos: (31, 42)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos-1] <= cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

133 : Job ID fb6651760dcd465d9d1959a802fb1c70
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 22), end pos: (31, 23)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos >= 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

134 : Job ID 7f694845b4084bbbb38e305bd78ebf62
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 41), end pos: (31, 42)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos-1] >= cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

135 : Job ID 1427afc4557a406b885099b2df8574d3
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 41), end pos: (31, 42)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos-1] is cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

136 : Job ID 351bb4077c434d66b2360b89d68436e6
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 41), end pos: (31, 42)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos-1] is not cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

137 : Job ID b6e88534caf5452ba0dfff9254e3972d
SURVIVED
test outcome: survived
sort1.py, start pos: (17, 19), end pos: (17, 40)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -14,7 +14,7 @@
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
-                if arr[j] < arr[minimum]:
+                if not arr[j] < arr[minimum]:
                     minimum = j
             # Using a pythonic swap
             arr[minimum], arr[i] = arr[i], arr[minimum]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

138 : Job ID 82cd4109be224f78ba664fcb1c7bf662
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 18), end pos: (31, 49)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while not pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

139 : Job ID 748bb1b3cc514c63bea6223fbbf7c983
test outcome: killed
sort1.py, start pos: (47, 11), end pos: (47, 20)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if not size <= 1:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.14s =========================

140 : Job ID 1c69ccc7b84f4afbbe192ff3f82ff546
test outcome: killed
sort1.py, start pos: (62, 14), end pos: (62, 67)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while not left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: object ...
========================= 1 failed, 41 passed in 0.13s =========================

141 : Job ID c4ac1c7abb5d45b9a9d379ba0f1468e3
SURVIVED
test outcome: survived
sort1.py, start pos: (64, 15), end pos: (64, 55)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -61,7 +61,7 @@
         left_cursor, right_cursor = 0, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
-            if left[left_cursor] <= right[right_cursor]:
+            if not left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
                 left_cursor += 1
             else:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

142 : Job ID 5203ed05ebdc47b3966672779bb135e4
test outcome: killed
sort1.py, start pos: (71, 11), end pos: (71, 15)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -68,7 +68,7 @@
                 arr.append(right[right_cursor])
                 right_cursor += 1
         # Add the left overs if there's any left to the result
-        if left:
+        if not left:
             arr.extend(left[left_cursor:])
         if right:
             arr.extend(right[right_cursor:])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py .......F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - TypeError: unh...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: unhasha...
========================= 2 failed, 40 passed in 0.13s =========================

143 : Job ID fceb71d7318f42dcad09fe7ff108c696
test outcome: killed
sort1.py, start pos: (73, 11), end pos: (73, 16)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -70,7 +70,7 @@
         # Add the left overs if there's any left to the result
         if left:
             arr.extend(left[left_cursor:])
-        if right:
+        if not right:
             arr.extend(right[right_cursor:])
         return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py .......FF......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ........F.........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......FF                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - TypeError: unh...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - TypeError: unh...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_8 - TypeError: unhashab...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: 'NoneTy...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - TypeError: unhasha...
========================= 5 failed, 37 passed in 0.13s =========================

144 : Job ID 0a47774d44ad44e6bf59b8d978882db0
test outcome: killed
sort1.py, start pos: (82, 11), end pos: (82, 23)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -79,7 +79,7 @@
         """ Quicksort
             Complexity: O(n log(n))
         """
-        if first < last:
+        if not first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ......F........                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ............F.....                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_6 - TypeError: 'st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_12 - TypeError: 'Sort' ...
========================= 2 failed, 40 passed in 0.13s =========================

145 : Job ID 54ff89dbf0f14c3a9d03f1d4b2327095
SURVIVED
test outcome: survived
sort1.py, start pos: (92, 15), end pos: (92, 35)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -89,7 +89,7 @@
     def partition(arr, first, last):
         pivot = first
         for pos in range(first, last):
-            if arr[pos] < arr[last]:
+            if not arr[pos] < arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
         arr[pivot], arr[last] = arr[last], arr[pivot]
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

146 : Job ID 5dc1777ac27e4e829a508b7594aeb6ab
test outcome: killed
sort1.py, start pos: (31, 26), end pos: (31, 29)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 or arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ............FF.                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_12 - IndexError: l...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_13 - IndexError: l...
========================= 2 failed, 40 passed in 0.13s =========================

147 : Job ID e578bdef2a5c43499a82dc306d30cda0
test outcome: killed
sort1.py, start pos: (62, 38), end pos: (62, 41)
operator: core/ReplaceAndWithOr, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -59,7 +59,7 @@
         """
         arr = []
         left_cursor, right_cursor = 0, 0
-        while left_cursor < len(left) and right_cursor < len(right):
+        while left_cursor < len(left) or right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....FF......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ....F..FF.........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F...FF                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - IndexError: st...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - IndexError: li...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_4 - IndexError: index o...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - IndexError: index o...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_8 - KeyError: 0
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - IndexError: string...
FAILED DYNAMOSA-MIO-MOSA/t

148 : Job ID b3c33cb6eca14d69aed54c3d04fcad95
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 29), end pos: (15, 30)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i+ 2, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

149 : Job ID 3e01f319cbcb443fbba07193a4f8b828
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 29), end pos: (15, 30)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in range(i+ 0, len(arr)):
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================
