150 : Job ID fc2df2762b3a491082e38c98d0680360
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 24), end pos: (31, 25)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 1 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

151 : Job ID 6257b3ccfa53404aa30178d5962cccc8
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 24), end pos: (31, 25)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > -1 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

152 : Job ID 97824490e064442ebbfd129c0f9bffb4
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 38), end pos: (31, 39)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos- 2] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

153 : Job ID f64f406a4ae249d88d640ef4acd02017
SURVIVED
test outcome: survived
sort1.py, start pos: (31, 38), end pos: (31, 39)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -28,7 +28,7 @@
         for i in range(len(arr)):
             cursor = arr[i]
             pos = i
-            while pos > 0 and arr[pos-1] > cursor:
+            while pos > 0 and arr[pos- 0] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
                 pos = pos-1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

154 : Job ID 1392ba89a3d543dc8d21c9921c8fb2f7
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 35), end pos: (33, 36)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos- 2]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

155 : Job ID 0e4400a3a96c475d89b1c2dbe92338c8
SURVIVED
test outcome: survived
sort1.py, start pos: (33, 35), end pos: (33, 36)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -30,7 +30,7 @@
             pos = i
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
-                arr[pos] = arr[pos-1]
+                arr[pos] = arr[pos- 0]
                 pos = pos-1
             # Break and do the final swap
             arr[pos] = cursor
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

156 : Job ID 1a563a863f1f4c219c31dd2e34ee2eb6
SURVIVED
test outcome: survived
sort1.py, start pos: (34, 26), end pos: (34, 27)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos- 2
             # Break and do the final swap
             arr[pos] = cursor
         return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

157 : Job ID 04bf2d83952c4d2580eabb34aff08658
test outcome: killed
sort1.py, start pos: (34, 26), end pos: (34, 27)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -31,7 +31,7 @@
             while pos > 0 and arr[pos-1] > cursor:
                 # Swap the number down the list
                 arr[pos] = arr[pos-1]
-                pos = pos-1
+                pos = pos- 0
             # Break and do the final swap
             arr[pos] = cursor
         return arr
timeout

158 : Job ID 15d485ba7d3a4dbb8cd0029795829ca5
test outcome: killed
sort1.py, start pos: (45, 21), end pos: (45, 22)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size// 3
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

159 : Job ID f5c7048ba07a43beb068012540088c8c
test outcome: killed
sort1.py, start pos: (45, 21), end pos: (45, 22)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -42,7 +42,7 @@
             Complexity: O(n log(n))
         """
         size = len(arr)
-        half = size//2
+        half = size// 1
         # Our recursive base case
         if size <= 1:
             return arr
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.18s =========================

160 : Job ID f42b06c324484fa3aa2b151710f53d18
SURVIVED
test outcome: survived
sort1.py, start pos: (47, 19), end pos: (47, 20)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if size <= 2:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

161 : Job ID cda342371c6046b29e3d2c4f2cc931e1
test outcome: killed
sort1.py, start pos: (47, 19), end pos: (47, 20)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -44,7 +44,7 @@
         size = len(arr)
         half = size//2
         # Our recursive base case
-        if size <= 1:
+        if size <= 0:
             return arr
         # Perform merge_sort recursively on both halves
         left, right = Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ..F....F.......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py .......F..........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ...F.....                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_2 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_7 - RecursionError...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_7 - RecursionError: max...
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_3 - RecursionError: ma...
========================= 4 failed, 38 passed in 0.17s =========================

162 : Job ID 24a9e7d88d7d4dc98239e08905f5f9ca
SURVIVED
test outcome: survived
sort1.py, start pos: (61, 36), end pos: (61, 37)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -58,7 +58,7 @@
             Complexity: O(n)
         """
         arr = []
-        left_cursor, right_cursor = 0, 0
+        left_cursor, right_cursor = 1, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

163 : Job ID 20ddf18515a44cd9ba5c836e7d8320f1
test outcome: killed
sort1.py, start pos: (61, 36), end pos: (61, 37)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -58,7 +58,7 @@
             Complexity: O(n)
         """
         arr = []
-        left_cursor, right_cursor = 0, 0
+        left_cursor, right_cursor = -1, 0
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .......F.                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_7 - TypeError: object ...
========================= 1 failed, 41 passed in 0.13s =========================

164 : Job ID 153986411af24d129972c0d892cd6c21
SURVIVED
test outcome: survived
sort1.py, start pos: (61, 39), end pos: (61, 40)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -58,7 +58,7 @@
             Complexity: O(n)
         """
         arr = []
-        left_cursor, right_cursor = 0, 0
+        left_cursor, right_cursor = 0, 1
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

165 : Job ID 8e27aeab6f294c4c9fd860b5668931d7
test outcome: killed
sort1.py, start pos: (61, 39), end pos: (61, 40)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -58,7 +58,7 @@
             Complexity: O(n)
         """
         arr = []
-        left_cursor, right_cursor = 0, 0
+        left_cursor, right_cursor = 0, -1
         while left_cursor < len(left) and right_cursor < len(right):
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ........F......                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ........F.........                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ........F                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py::test_case_8 - KeyError: -1
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MIO.py::test_case_8 - KeyError: -1
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_8 - KeyError: -1
========================= 3 failed, 39 passed in 0.13s =========================

166 : Job ID 693ad445af99495f8118f6f7d70f93cf
SURVIVED
test outcome: survived
sort1.py, start pos: (66, 31), end pos: (66, 32)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -63,7 +63,7 @@
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
-                left_cursor += 1
+                left_cursor += 2
             else:
                 arr.append(right[right_cursor])
                 right_cursor += 1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

167 : Job ID 6c06516a6e124a8b8db43c282b6a5f56
test outcome: killed
sort1.py, start pos: (66, 31), end pos: (66, 32)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -63,7 +63,7 @@
             # Sort each one and place into the result
             if left[left_cursor] <= right[right_cursor]:
                 arr.append(left[left_cursor])
-                left_cursor += 1
+                left_cursor += 0
             else:
                 arr.append(right[right_cursor])
                 right_cursor += 1
timeout

168 : Job ID 7a11ed32e4ad4061998895dbd8e7d7e2
SURVIVED
test outcome: survived
sort1.py, start pos: (69, 32), end pos: (69, 33)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -66,7 +66,7 @@
                 left_cursor += 1
             else:
                 arr.append(right[right_cursor])
-                right_cursor += 1
+                right_cursor += 2
         # Add the left overs if there's any left to the result
         if left:
             arr.extend(left[left_cursor:])
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

169 : Job ID c525d2a5053f453187040f69526ddaf6
test outcome: killed
sort1.py, start pos: (69, 32), end pos: (69, 33)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -66,7 +66,7 @@
                 left_cursor += 1
             else:
                 arr.append(right[right_cursor])
-                right_cursor += 1
+                right_cursor += 0
         # Add the left overs if there's any left to the result
         if left:
             arr.extend(left[left_cursor:])
timeout

170 : Job ID a1e1ab034b7b43879cb8351201d5f24a
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 44), end pos: (85, 45)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos- 2)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.14s ==============================

171 : Job ID 9f3b0434693d482aac61e57c31cff83a
SURVIVED
test outcome: survived
sort1.py, start pos: (85, 44), end pos: (85, 45)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -82,7 +82,7 @@
         if first < last:
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
-            Sort.quick_sort(arr, first, pos-1)
+            Sort.quick_sort(arr, first, pos- 0)
             Sort.quick_sort(arr, pos+1, last)
     @staticmethod
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.14s ==============================

172 : Job ID d1559f4a8d384ae1a079e732f5c3fd5a
SURVIVED
test outcome: survived
sort1.py, start pos: (86, 37), end pos: (86, 38)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos+ 2, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

173 : Job ID d53fee31a6c4482f81b5079c60404b5c
test outcome: killed
sort1.py, start pos: (86, 37), end pos: (86, 38)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -83,7 +83,7 @@
             pos = Sort.partition(arr, first, last)
             # Start our two recursive calls
             Sort.quick_sort(arr, first, pos-1)
-            Sort.quick_sort(arr, pos+1, last)
+            Sort.quick_sort(arr, pos+ 0, last)
     @staticmethod
     def partition(arr, first, last):
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py ......F..                           [100%]
=========================== short test summary info ============================
FAILED DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py::test_case_6 - RecursionError: ma...
========================= 1 failed, 41 passed in 0.15s =========================

174 : Job ID fcda54964ce240d6b7d2598282db323a
SURVIVED
test outcome: survived
sort1.py, start pos: (94, 25), end pos: (94, 26)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -91,7 +91,7 @@
         for pos in range(first, last):
             if arr[pos] < arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
-                pivot += 1
+                pivot += 2
         arr[pivot], arr[last] = arr[last], arr[pivot]
         return pivot
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.14s ==============================

175 : Job ID 430bfde4f6ad40ef821a5c3cc27f9bfe
SURVIVED
test outcome: survived
sort1.py, start pos: (94, 25), end pos: (94, 26)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -91,7 +91,7 @@
         for pos in range(first, last):
             if arr[pos] < arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
-                pivot += 1
+                pivot += 0
         arr[pivot], arr[last] = arr[last], arr[pivot]
         return pivot
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.14s ==============================

182 : Job ID 8748110ff7904a25a743580466571b2e
SURVIVED
test outcome: survived
sort1.py, start pos: (13, 17), end pos: (13, 32)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -10,7 +10,7 @@
         """ Selection Sort
             Complexity: O(n^2)
         """
-        for i in range(len(arr)):
+        for i in []:
             minimum = i
             for j in range(i+1, len(arr)):
                 # "Select" the correct value
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.14s ==============================

183 : Job ID fa489c1be70e4e2f8c50ffcbacc9cf1e
SURVIVED
test outcome: survived
sort1.py, start pos: (15, 21), end pos: (15, 41)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -12,7 +12,7 @@
         """
         for i in range(len(arr)):
             minimum = i
-            for j in range(i+1, len(arr)):
+            for j in []:
                 # "Select" the correct value
                 if arr[j] < arr[minimum]:
                     minimum = j
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.13s ==============================

185 : Job ID 57c1ed9b95ac4f0e95c3011d55110fa9
SURVIVED
test outcome: survived
sort1.py, start pos: (91, 19), end pos: (91, 37)
operator: core/ZeroIterationForLoop, occurrence: 3
--- mutation diff ---
--- asort1.py
+++ bsort1.py
@@ -88,7 +88,7 @@
     @staticmethod
     def partition(arr, first, last):
         pivot = first
-        for pos in range(first, last):
+        for pos in []:
             if arr[pos] < arr[last]:
                 arr[pos], arr[pivot] = arr[pivot], arr[pos]
                 pivot += 1
DYNAMOSA-MIO-MOSA/test_sort1_DYNAMOSA.py ...............                 [ 35%]
DYNAMOSA-MIO-MOSA/test_sort1_MIO.py ..................                   [ 78%]
DYNAMOSA-MIO-MOSA/test_sort1_MOSA.py .........                           [100%]
============================== 42 passed in 0.14s ==============================
