   - [#  80] SDL sort1: 
--------------------------------------------------------------------------------
  17:                 if arr[j] < arr[minimum]:
  18:                     minimum = j
  19:             
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
- 21:         return arr
+ 21:         pass
  22:     
  23:     
  24:     @staticmethod
  25:     def insertion_sort(arr):''' Insertion Sort
--------------------------------------------------------------------------------
[0.14072 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_sort1_MIO.py::test_case_1

def test_case_1():
        bytes_0 = b''
        sort_0 = module_0.Sort()
        var_0 = sort_0.selection_sort(bytes_0)
>       assert var_0 == b''
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_sort1_MIO.py:13: AssertionError

   - [# 105] SDL sort1: 
--------------------------------------------------------------------------------
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
  94:                 pivot += 1
  95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
- 96:         return pivot
+ 96:         pass
--------------------------------------------------------------------------------
[0.21022 s] killed by DYNAMOSA-MIO-WHOLE_SUITE/test_sort1_DYNAMOSA.py::test_case_0

def test_case_0():
        bool_0 = False
        list_0 = [bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
        var_0 = sort_0.insertion_sort(list_0)
        var_1 = sort_0.partition(var_0, bool_0, bool_0)
>       assert var_1 is False
E       AssertionError

DYNAMOSA-MIO-WHOLE_SUITE/test_sort1_DYNAMOSA.py:11: AssertionError
