   - [#  73] ROR sort1: 
--------------------------------------------------------------------------------
  78:     @staticmethod
  79:     def quick_sort(arr, first, last):''' Quicksort
  80:             Complexity: O(n log(n))
  81:         '''
- 82:         if first < last:
+ 82:         if first > last:
  83:             pos = Sort.partition(arr, first, last)
  84:             
  85:             Sort.quick_sort(arr, first, pos - 1)
  86:             Sort.quick_sort(arr, pos + 1, last)
--------------------------------------------------------------------------------
[0.40888 s] survived
