   - [#   2] AOR sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos > 0 and arr[pos + 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.07117 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_1

def test_case_1():
        bool_0 = False
        list_0 = [bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
>       var_0 = sort_0.insertion_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [False, False, False, False]

>   ???
E   IndexError: list index out of range

sort1:31: IndexError

   - [#   3] AOR sort1: 
--------------------------------------------------------------------------------
  29:             cursor = arr[i]
  30:             pos = i
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
- 33:                 arr[pos] = arr[pos - 1]
+ 33:                 arr[pos] = arr[pos + 1]
  34:                 pos = pos - 1
  35:             
  36:             arr[pos] = cursor
  37:         return arr
--------------------------------------------------------------------------------
[0.08455 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_DYNAMOSA.py::test_case_12

def test_case_12():
        bool_0 = True
        float_0 = -491.8264
        list_0 = [bool_0, float_0]
        sort_0 = module_0.Sort()
>       var_0 = sort_0.insertion_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_DYNAMOSA.py:88: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [True, -491.8264]

>   ???
E   IndexError: list index out of range

sort1:33: IndexError

   - [#   7] AOR sort1: 
--------------------------------------------------------------------------------
  81:         '''
  82:         if first < last:
  83:             pos = Sort.partition(arr, first, last)
  84:             
- 85:             Sort.quick_sort(arr, first, pos - 1)
+ 85:             Sort.quick_sort(arr, first, pos + 1)
  86:             Sort.quick_sort(arr, pos + 1, last)
  87:     
  88:     
  89:     @staticmethod
--------------------------------------------------------------------------------
[0.08086 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_6

def test_case_6():
        bool_0 = True
        list_0 = [bool_0, bool_0, bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
        bool_1 = False
>       var_0 = sort_0.quick_sort(list_0, bool_1, bool_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:85: in quick_sort
    ???
sort1:85: in quick_sort
    ???
E   RecursionError: maximum recursion depth exceeded in comparison
!!! Recursion detected (same locals & position)

   - [#   9] ASR sort1: 
--------------------------------------------------------------------------------
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
- 66:                 left_cursor += 1
+ 66:                 left_cursor -= 1
  67:             else:
  68:                 arr.append(right[right_cursor])
  69:                 right_cursor += 1
  70:         
--------------------------------------------------------------------------------
[0.07705 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:53: in merge_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = '&', right = 'P'

>   ???
E   IndexError: string index out of range

sort1:64: IndexError

   - [#  10] ASR sort1: 
--------------------------------------------------------------------------------
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
  67:             else:
  68:                 arr.append(right[right_cursor])
- 69:                 right_cursor += 1
+ 69:                 right_cursor -= 1
  70:         
  71:         if left:
  72:             arr.extend(left[left_cursor:])
  73:         if right:
--------------------------------------------------------------------------------
[0.07583 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:53: in merge_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = ['&', 'P'], right = '8'

>   ???
E   IndexError: string index out of range

sort1:64: IndexError

   - [#  11] ASR sort1: 
--------------------------------------------------------------------------------
  90:     def partition(arr, first, last):pivot = first
  91:         for pos in range(first, last):
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
- 94:                 pivot += 1
+ 94:                 pivot -= 1
  95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
  96:         return pivot
--------------------------------------------------------------------------------
[0.06797 s] survived

   - [#  18] COI sort1: 
--------------------------------------------------------------------------------
  13:         for i in range(len(arr)):
  14:             minimum = i
  15:             for j in range(i + 1, len(arr)):
  16:                 
- 17:                 if arr[j] < arr[minimum]:
+ 17:                 if not (arr[j] < arr[minimum]):
  18:                     minimum = j
  19:             
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
  21:         return arr
--------------------------------------------------------------------------------
[0.08896 s] survived

   - [#  19] COI sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while not ((pos > 0 and arr[pos - 1] > cursor)):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.07234 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_1

def test_case_1():
        bool_0 = False
        list_0 = [bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
>       var_0 = sort_0.insertion_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [False, False, False, False]

>   ???
E   IndexError: list index out of range

sort1:33: IndexError

   - [#  20] COI sort1: 
--------------------------------------------------------------------------------
  43:         '''
  44:         size = len(arr)
  45:         half = size // 2
  46:         
- 47:         if size <= 1:
+ 47:         if not (size <= 1):
  48:             return arr
  49:         
  50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
  51:         
--------------------------------------------------------------------------------
[0.08025 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_7

def test_case_7():
        dict_0 = {}
        list_0 = []
        sort_0 = module_0.Sort(*list_0)
>       var_0 = sort_0.merge_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
E   RecursionError: maximum recursion depth exceeded while calling a Python object
!!! Recursion detected (same locals & position)

   - [#  21] COI sort1: 
--------------------------------------------------------------------------------
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
- 62:         while (left_cursor < len(left) and right_cursor < len(right)):
+ 62:         while not ((left_cursor < len(left) and right_cursor < len(right))):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
--------------------------------------------------------------------------------
[0.07635 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_7

def test_case_7():
        dict_0 = {}
        list_0 = []
        sort_0 = module_0.Sort(*list_0)
        var_0 = sort_0.merge_sort(list_0)
        none_type_0 = None
        sort_1 = module_0.Sort()
>       var_1 = sort_1.merge(dict_0, none_type_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = {}, right = None

>   ???
E   KeyError: 0

sort1:64: KeyError

   - [#  22] COI sort1: 
--------------------------------------------------------------------------------
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
- 64:             if left[left_cursor] <= right[right_cursor]:
+ 64:             if not (left[left_cursor] <= right[right_cursor]):
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
  67:             else:
  68:                 arr.append(right[right_cursor])
--------------------------------------------------------------------------------
[0.06789 s] survived

   - [#  26] COI sort1: 
--------------------------------------------------------------------------------
  88:     
  89:     @staticmethod
  90:     def partition(arr, first, last):pivot = first
  91:         for pos in range(first, last):
- 92:             if arr[pos] < arr[last]:
+ 92:             if not (arr[pos] < arr[last]):
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
  94:                 pivot += 1
  95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
  96:         return pivot
--------------------------------------------------------------------------------
[0.06776 s] survived

   - [#  28] CRP sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos > 1 and arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.06821 s] survived

   - [#  29] CRP sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos > 0 and arr[pos - 2] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.06807 s] survived

   - [#  30] CRP sort1: 
--------------------------------------------------------------------------------
  29:             cursor = arr[i]
  30:             pos = i
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
- 33:                 arr[pos] = arr[pos - 1]
+ 33:                 arr[pos] = arr[pos - 2]
  34:                 pos = pos - 1
  35:             
  36:             arr[pos] = cursor
  37:         return arr
--------------------------------------------------------------------------------
[0.06906 s] survived

   - [#  33] CRP sort1: 
--------------------------------------------------------------------------------
  43:         '''
  44:         size = len(arr)
  45:         half = size // 2
  46:         
- 47:         if size <= 1:
+ 47:         if size <= 2:
  48:             return arr
  49:         
  50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
  51:         
--------------------------------------------------------------------------------
[0.06752 s] survived

   - [#  34] CRP sort1: 
--------------------------------------------------------------------------------
  57:     def merge(left, right):''' Merge helper
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
- 61:         (left_cursor, right_cursor) = (0, 0)
+ 61:         (left_cursor, right_cursor) = (1, 0)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
--------------------------------------------------------------------------------
[0.06785 s] survived

   - [#  35] CRP sort1: 
--------------------------------------------------------------------------------
  57:     def merge(left, right):''' Merge helper
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
- 61:         (left_cursor, right_cursor) = (0, 0)
+ 61:         (left_cursor, right_cursor) = (0, 1)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
--------------------------------------------------------------------------------
[0.06919 s] survived

   - [#  38] CRP sort1: 
--------------------------------------------------------------------------------
  81:         '''
  82:         if first < last:
  83:             pos = Sort.partition(arr, first, last)
  84:             
- 85:             Sort.quick_sort(arr, first, pos - 1)
+ 85:             Sort.quick_sort(arr, first, pos - 2)
  86:             Sort.quick_sort(arr, pos + 1, last)
  87:     
  88:     
  89:     @staticmethod
--------------------------------------------------------------------------------
[0.06883 s] survived

   - [#  40] CRP sort1: 
--------------------------------------------------------------------------------
  90:     def partition(arr, first, last):pivot = first
  91:         for pos in range(first, last):
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
- 94:                 pivot += 1
+ 94:                 pivot += 2
  95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
  96:         return pivot
--------------------------------------------------------------------------------
[0.06797 s] survived

   - [#  47] LCR sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos > 0 or arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.08655 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_DYNAMOSA.py::test_case_12

def test_case_12():
        bool_0 = True
        float_0 = -491.8264
        list_0 = [bool_0, float_0]
        sort_0 = module_0.Sort()
>       var_0 = sort_0.insertion_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_DYNAMOSA.py:88: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [True, True]

>   ???
E   IndexError: list index out of range

sort1:31: IndexError

   - [#  48] LCR sort1: 
--------------------------------------------------------------------------------
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
- 62:         while (left_cursor < len(left) and right_cursor < len(right)):
+ 62:         while (left_cursor < len(left) or right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
--------------------------------------------------------------------------------
[0.07628 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:53: in merge_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = '&', right = 'P'

>   ???
E   IndexError: string index out of range

sort1:64: IndexError

   - [#  49] OIL sort1: 
--------------------------------------------------------------------------------
  17:                 if arr[j] < arr[minimum]:
  18:                     minimum = j
  19:             
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
- 21:         return arr
- 22:     
+ 21:             break
+ 22:         return arr
  23:     
  24:     @staticmethod
  25:     def insertion_sort(arr):''' Insertion Sort
  26:             Complexity: O(n^2)
--------------------------------------------------------------------------------
[0.07050 s] survived

   - [#  50] OIL sort1: 
--------------------------------------------------------------------------------
  15:             for j in range(i + 1, len(arr)):
  16:                 
  17:                 if arr[j] < arr[minimum]:
  18:                     minimum = j
- 19:             
+ 19:                 break
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
  21:         return arr
  22:     
  23:     
--------------------------------------------------------------------------------
[0.06764 s] survived

   - [#  51] OIL sort1: 
--------------------------------------------------------------------------------
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
  36:             arr[pos] = cursor
- 37:         return arr
- 38:     
+ 37:             break
+ 38:         return arr
  39:     
  40:     @staticmethod
  41:     def merge_sort(arr):''' Merge Sort
  42:             Complexity: O(n log(n))
--------------------------------------------------------------------------------
[0.06876 s] survived

   - [#  52] OIL sort1: 
--------------------------------------------------------------------------------
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
- 35:             
+ 35:                 break
  36:             arr[pos] = cursor
  37:         return arr
  38:     
  39:     
--------------------------------------------------------------------------------
[0.06907 s] survived

   - [#  53] OIL sort1: 
--------------------------------------------------------------------------------
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
  67:             else:
  68:                 arr.append(right[right_cursor])
- 69:                 right_cursor += 1
+ 69:                 right_cursor += 1break
  70:         
  71:         if left:
  72:             arr.extend(left[left_cursor:])
  73:         if right:
--------------------------------------------------------------------------------
[0.06919 s] survived

   - [#  54] OIL sort1: 
--------------------------------------------------------------------------------
  91:         for pos in range(first, last):
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
  94:                 pivot += 1
- 95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
- 96:         return pivot
+ 95:             break
+ 96:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
+ 97:         return pivot
--------------------------------------------------------------------------------
[0.06744 s] survived

   - [#  55] RIL sort1: 
--------------------------------------------------------------------------------
   9:     @staticmethod
  10:     def selection_sort(arr):''' Selection Sort
  11:             Complexity: O(n^2)
  12:         '''
- 13:         for i in range(len(arr)):
+ 13:         for i in reversed(range(len(arr))):
  14:             minimum = i
  15:             for j in range(i + 1, len(arr)):
  16:                 
  17:                 if arr[j] < arr[minimum]:
--------------------------------------------------------------------------------
[0.06818 s] survived

   - [#  56] RIL sort1: 
--------------------------------------------------------------------------------
  11:             Complexity: O(n^2)
  12:         '''
  13:         for i in range(len(arr)):
  14:             minimum = i
- 15:             for j in range(i + 1, len(arr)):
+ 15:             for j in reversed(range(i + 1, len(arr))):
  16:                 
  17:                 if arr[j] < arr[minimum]:
  18:                     minimum = j
  19:             
--------------------------------------------------------------------------------
[0.06882 s] survived

   - [#  58] RIL sort1: 
--------------------------------------------------------------------------------
  87:     
  88:     
  89:     @staticmethod
  90:     def partition(arr, first, last):pivot = first
- 91:         for pos in range(first, last):
+ 91:         for pos in reversed(range(first, last)):
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
  94:                 pivot += 1
  95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
--------------------------------------------------------------------------------
[0.06769 s] survived

   - [#  59] ROR sort1: 
--------------------------------------------------------------------------------
  13:         for i in range(len(arr)):
  14:             minimum = i
  15:             for j in range(i + 1, len(arr)):
  16:                 
- 17:                 if arr[j] < arr[minimum]:
+ 17:                 if arr[j] > arr[minimum]:
  18:                     minimum = j
  19:             
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
  21:         return arr
--------------------------------------------------------------------------------
[0.06713 s] survived

   - [#  60] ROR sort1: 
--------------------------------------------------------------------------------
  13:         for i in range(len(arr)):
  14:             minimum = i
  15:             for j in range(i + 1, len(arr)):
  16:                 
- 17:                 if arr[j] < arr[minimum]:
+ 17:                 if arr[j] <= arr[minimum]:
  18:                     minimum = j
  19:             
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
  21:         return arr
--------------------------------------------------------------------------------
[0.06949 s] survived

   - [#  61] ROR sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos < 0 and arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.06893 s] survived

   - [#  62] ROR sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos >= 0 and arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.06888 s] survived

   - [#  63] ROR sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos > 0 and arr[pos - 1] < cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.06728 s] survived

   - [#  64] ROR sort1: 
--------------------------------------------------------------------------------
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
  30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
+ 31:             while (pos > 0 and arr[pos - 1] >= cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
--------------------------------------------------------------------------------
[0.06751 s] survived

   - [#  65] ROR sort1: 
--------------------------------------------------------------------------------
  43:         '''
  44:         size = len(arr)
  45:         half = size // 2
  46:         
- 47:         if size <= 1:
+ 47:         if size >= 1:
  48:             return arr
  49:         
  50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
  51:         
--------------------------------------------------------------------------------
[0.07720 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_7

def test_case_7():
        dict_0 = {}
        list_0 = []
        sort_0 = module_0.Sort(*list_0)
>       var_0 = sort_0.merge_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
E   RecursionError: maximum recursion depth exceeded while calling a Python object
!!! Recursion detected (same locals & position)

   - [#  66] ROR sort1: 
--------------------------------------------------------------------------------
  43:         '''
  44:         size = len(arr)
  45:         half = size // 2
  46:         
- 47:         if size <= 1:
+ 47:         if size < 1:
  48:             return arr
  49:         
  50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
  51:         
--------------------------------------------------------------------------------
[0.07936 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
E   RecursionError: maximum recursion depth exceeded while calling a Python object
!!! Recursion detected (same locals & position)

   - [#  67] ROR sort1: 
--------------------------------------------------------------------------------
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
- 62:         while (left_cursor < len(left) and right_cursor < len(right)):
+ 62:         while (left_cursor > len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
--------------------------------------------------------------------------------
[0.07012 s] survived
