   - [#  68] ROR sort1: 
--------------------------------------------------------------------------------
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
- 62:         while (left_cursor < len(left) and right_cursor < len(right)):
+ 62:         while (left_cursor <= len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
--------------------------------------------------------------------------------
[0.07749 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:53: in merge_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = '&', right = 'P'

>   ???
E   IndexError: string index out of range

sort1:64: IndexError

   - [#  69] ROR sort1: 
--------------------------------------------------------------------------------
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
- 62:         while (left_cursor < len(left) and right_cursor < len(right)):
+ 62:         while (left_cursor < len(left) and right_cursor > len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
--------------------------------------------------------------------------------
[0.06897 s] survived

   - [#  70] ROR sort1: 
--------------------------------------------------------------------------------
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
- 62:         while (left_cursor < len(left) and right_cursor < len(right)):
+ 62:         while (left_cursor < len(left) and right_cursor <= len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
--------------------------------------------------------------------------------
[0.07504 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:53: in merge_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = ['&', 'P'], right = '8'

>   ???
E   IndexError: string index out of range

sort1:64: IndexError

   - [#  71] ROR sort1: 
--------------------------------------------------------------------------------
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
- 64:             if left[left_cursor] <= right[right_cursor]:
+ 64:             if left[left_cursor] >= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
  67:             else:
  68:                 arr.append(right[right_cursor])
--------------------------------------------------------------------------------
[0.06797 s] survived

   - [#  72] ROR sort1: 
--------------------------------------------------------------------------------
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
- 64:             if left[left_cursor] <= right[right_cursor]:
+ 64:             if left[left_cursor] < right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
  67:             else:
  68:                 arr.append(right[right_cursor])
--------------------------------------------------------------------------------
[0.06844 s] survived

   - [#  77] SDL sort1: 
--------------------------------------------------------------------------------
  10:     def selection_sort(arr):''' Selection Sort
  11:             Complexity: O(n^2)
  12:         '''
  13:         for i in range(len(arr)):
- 14:             minimum = i
+ 14:             pass
  15:             for j in range(i + 1, len(arr)):
  16:                 
  17:                 if arr[j] < arr[minimum]:
  18:                     minimum = j
--------------------------------------------------------------------------------
[0.07182 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_1

def test_case_1():
        bool_0 = False
        list_0 = [bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
        var_0 = sort_0.insertion_sort(list_0)
>       var_1 = sort_0.selection_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [False, False, False, False]

>   ???
E   UnboundLocalError: local variable 'minimum' referenced before assignment

sort1:17: UnboundLocalError

   - [#  78] SDL sort1: 
--------------------------------------------------------------------------------
  14:             minimum = i
  15:             for j in range(i + 1, len(arr)):
  16:                 
  17:                 if arr[j] < arr[minimum]:
- 18:                     minimum = j
+ 18:                     pass
  19:             
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
  21:         return arr
  22:     
--------------------------------------------------------------------------------
[0.06916 s] survived

   - [#  79] SDL sort1: 
--------------------------------------------------------------------------------
  16:                 
  17:                 if arr[j] < arr[minimum]:
  18:                     minimum = j
  19:             
- 20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
+ 20:             pass
  21:         return arr
  22:     
  23:     
  24:     @staticmethod
--------------------------------------------------------------------------------
[0.06767 s] survived

   - [#  81] SDL sort1: 
--------------------------------------------------------------------------------
  25:     def insertion_sort(arr):''' Insertion Sort
  26:             Complexity: O(n^2)
  27:         '''
  28:         for i in range(len(arr)):
- 29:             cursor = arr[i]
+ 29:             pass
  30:             pos = i
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
--------------------------------------------------------------------------------
[0.07167 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_1

def test_case_1():
        bool_0 = False
        list_0 = [bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
>       var_0 = sort_0.insertion_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [False, False, False, False]

>   ???
E   NameError: name 'cursor' is not defined

sort1:36: NameError

   - [#  82] SDL sort1: 
--------------------------------------------------------------------------------
  26:             Complexity: O(n^2)
  27:         '''
  28:         for i in range(len(arr)):
  29:             cursor = arr[i]
- 30:             pos = i
+ 30:             pass
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
--------------------------------------------------------------------------------
[0.08698 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_1

def test_case_1():
        bool_0 = False
        list_0 = [bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
>       var_0 = sort_0.insertion_sort(list_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [False, False, False, False]

>   ???
E   UnboundLocalError: local variable 'pos' referenced before assignment

sort1:31: UnboundLocalError

   - [#  83] SDL sort1: 
--------------------------------------------------------------------------------
  29:             cursor = arr[i]
  30:             pos = i
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
- 33:                 arr[pos] = arr[pos - 1]
+ 33:                 pass
  34:                 pos = pos - 1
  35:             
  36:             arr[pos] = cursor
  37:         return arr
--------------------------------------------------------------------------------
[0.06934 s] survived

   - [#  84] SDL sort1: 
--------------------------------------------------------------------------------
  30:             pos = i
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
  33:                 arr[pos] = arr[pos - 1]
- 34:                 pos = pos - 1
+ 34:                 pass
  35:             
  36:             arr[pos] = cursor
  37:         return arr
  38:     
--------------------------------------------------------------------------------
[5.00641 s] timeout

   - [#  85] SDL sort1: 
--------------------------------------------------------------------------------
  32:                 
  33:                 arr[pos] = arr[pos - 1]
  34:                 pos = pos - 1
  35:             
- 36:             arr[pos] = cursor
+ 36:             pass
  37:         return arr
  38:     
  39:     
  40:     @staticmethod
--------------------------------------------------------------------------------
[0.06986 s] survived

   - [#  87] SDL sort1: 
--------------------------------------------------------------------------------
  40:     @staticmethod
  41:     def merge_sort(arr):''' Merge Sort
  42:             Complexity: O(n log(n))
  43:         '''
- 44:         size = len(arr)
+ 44:         pass
  45:         half = size // 2
  46:         
  47:         if size <= 1:
  48:             return arr
--------------------------------------------------------------------------------
[0.07447 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = 'Z^[`[*-KJ8P&'

>   ???
E   NameError: name 'size' is not defined

sort1:45: NameError

   - [#  88] SDL sort1: 
--------------------------------------------------------------------------------
  41:     def merge_sort(arr):''' Merge Sort
  42:             Complexity: O(n log(n))
  43:         '''
  44:         size = len(arr)
- 45:         half = size // 2
+ 45:         pass
  46:         
  47:         if size <= 1:
  48:             return arr
  49:         
--------------------------------------------------------------------------------
[0.07524 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = 'Z^[`[*-KJ8P&'

>   ???
E   NameError: name 'half' is not defined

sort1:50: NameError

   - [#  89] SDL sort1: 
--------------------------------------------------------------------------------
  44:         size = len(arr)
  45:         half = size // 2
  46:         
  47:         if size <= 1:
- 48:             return arr
+ 48:             pass
  49:         
  50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
  51:         
  52:         
--------------------------------------------------------------------------------
[0.08028 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
E   RecursionError: maximum recursion depth exceeded while calling a Python object
!!! Recursion detected (same locals & position)

   - [#  90] SDL sort1: 
--------------------------------------------------------------------------------
  46:         
  47:         if size <= 1:
  48:             return arr
  49:         
- 50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
+ 50:         pass
  51:         
  52:         
  53:         return Sort.merge(left, right)
  54:     
--------------------------------------------------------------------------------
[0.07491 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = 'Z^[`[*-KJ8P&'

>   ???
E   NameError: name 'left' is not defined

sort1:53: NameError

   - [#  91] SDL sort1: 
--------------------------------------------------------------------------------
  49:         
  50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
  51:         
  52:         
- 53:         return Sort.merge(left, right)
+ 53:         pass
  54:     
  55:     
  56:     @staticmethod
  57:     def merge(left, right):''' Merge helper
--------------------------------------------------------------------------------
[0.06919 s] survived

   - [#  92] SDL sort1: 
--------------------------------------------------------------------------------
  56:     @staticmethod
  57:     def merge(left, right):''' Merge helper
  58:             Complexity: O(n)
  59:         '''
- 60:         arr = []
+ 60:         pass
  61:         (left_cursor, right_cursor) = (0, 0)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
--------------------------------------------------------------------------------
[0.07524 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:53: in merge_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = '&', right = 'P'

>   ???
E   NameError: name 'arr' is not defined

sort1:65: NameError

   - [#  93] SDL sort1: 
--------------------------------------------------------------------------------
  57:     def merge(left, right):''' Merge helper
  58:             Complexity: O(n)
  59:         '''
  60:         arr = []
- 61:         (left_cursor, right_cursor) = (0, 0)
+ 61:         pass
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
--------------------------------------------------------------------------------
[0.07549 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:53: in merge_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

left = '&', right = 'P'

>   ???
E   UnboundLocalError: local variable 'left_cursor' referenced before assignment

sort1:62: UnboundLocalError

   - [#  94] SDL sort1: 
--------------------------------------------------------------------------------
  61:         (left_cursor, right_cursor) = (0, 0)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
  64:             if left[left_cursor] <= right[right_cursor]:
- 65:                 arr.append(left[left_cursor])
+ 65:                 pass
  66:                 left_cursor += 1
  67:             else:
  68:                 arr.append(right[right_cursor])
  69:                 right_cursor += 1
--------------------------------------------------------------------------------
[0.06780 s] survived

   - [#  95] SDL sort1: 
--------------------------------------------------------------------------------
  64:             if left[left_cursor] <= right[right_cursor]:
  65:                 arr.append(left[left_cursor])
  66:                 left_cursor += 1
  67:             else:
- 68:                 arr.append(right[right_cursor])
+ 68:                 pass
  69:                 right_cursor += 1
  70:         
  71:         if left:
  72:             arr.extend(left[left_cursor:])
--------------------------------------------------------------------------------
[0.06912 s] survived

   - [#  96] SDL sort1: 
--------------------------------------------------------------------------------
  68:                 arr.append(right[right_cursor])
  69:                 right_cursor += 1
  70:         
  71:         if left:
- 72:             arr.extend(left[left_cursor:])
+ 72:             pass
  73:         if right:
  74:             arr.extend(right[right_cursor:])
  75:         return arr
  76:     
--------------------------------------------------------------------------------
[0.06823 s] survived

   - [#  97] SDL sort1: 
--------------------------------------------------------------------------------
  70:         
  71:         if left:
  72:             arr.extend(left[left_cursor:])
  73:         if right:
- 74:             arr.extend(right[right_cursor:])
+ 74:             pass
  75:         return arr
  76:     
  77:     
  78:     @staticmethod
--------------------------------------------------------------------------------
[0.06892 s] survived

   - [#  99] SDL sort1: 
--------------------------------------------------------------------------------
  79:     def quick_sort(arr, first, last):''' Quicksort
  80:             Complexity: O(n log(n))
  81:         '''
  82:         if first < last:
- 83:             pos = Sort.partition(arr, first, last)
+ 83:             pass
  84:             
  85:             Sort.quick_sort(arr, first, pos - 1)
  86:             Sort.quick_sort(arr, pos + 1, last)
  87:     
--------------------------------------------------------------------------------
[0.07650 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_6

def test_case_6():
        bool_0 = True
        list_0 = [bool_0, bool_0, bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
        bool_1 = False
>       var_0 = sort_0.quick_sort(list_0, bool_1, bool_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [True, True, True, True, True, True], first = False, last = True

>   ???
E   NameError: name 'pos' is not defined

sort1:85: NameError

   - [# 100] SDL sort1: 
--------------------------------------------------------------------------------
  81:         '''
  82:         if first < last:
  83:             pos = Sort.partition(arr, first, last)
  84:             
- 85:             Sort.quick_sort(arr, first, pos - 1)
+ 85:             pass
  86:             Sort.quick_sort(arr, pos + 1, last)
  87:     
  88:     
  89:     @staticmethod
--------------------------------------------------------------------------------
[0.06788 s] survived

   - [# 101] SDL sort1: 
--------------------------------------------------------------------------------
  82:         if first < last:
  83:             pos = Sort.partition(arr, first, last)
  84:             
  85:             Sort.quick_sort(arr, first, pos - 1)
- 86:             Sort.quick_sort(arr, pos + 1, last)
+ 86:             pass
  87:     
  88:     
  89:     @staticmethod
  90:     def partition(arr, first, last):pivot = first
--------------------------------------------------------------------------------
[0.08680 s] survived

   - [# 102] SDL sort1: 
--------------------------------------------------------------------------------
  86:             Sort.quick_sort(arr, pos + 1, last)
  87:     
  88:     
  89:     @staticmethod
- 90:     def partition(arr, first, last):pivot = first
+ 90:     def partition(arr, first, last):pass
  91:         for pos in range(first, last):
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
  94:                 pivot += 1
--------------------------------------------------------------------------------
[0.07757 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_6

def test_case_6():
        bool_0 = True
        list_0 = [bool_0, bool_0, bool_0, bool_0, bool_0, bool_0]
        sort_0 = module_0.Sort()
        bool_1 = False
>       var_0 = sort_0.quick_sort(list_0, bool_1, bool_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:83: in quick_sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

arr = [True, True, True, True, True, True], first = False, last = True

>   ???
E   UnboundLocalError: local variable 'pivot' referenced before assignment

sort1:95: UnboundLocalError

   - [# 103] SDL sort1: 
--------------------------------------------------------------------------------
  89:     @staticmethod
  90:     def partition(arr, first, last):pivot = first
  91:         for pos in range(first, last):
  92:             if arr[pos] < arr[last]:
- 93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
+ 93:                 pass
  94:                 pivot += 1
  95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
  96:         return pivot
--------------------------------------------------------------------------------
[0.06888 s] survived

   - [# 104] SDL sort1: 
--------------------------------------------------------------------------------
  91:         for pos in range(first, last):
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
  94:                 pivot += 1
- 95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
+ 95:         pass
  96:         return pivot
--------------------------------------------------------------------------------
[0.06888 s] survived

   - [# 106] SIR sort1: 
--------------------------------------------------------------------------------
  46:         
  47:         if size <= 1:
  48:             return arr
  49:         
- 50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
+ 50:         (left, right) = (Sort.merge_sort(arr[:]), Sort.merge_sort(arr[:half]))
  51:         
  52:         
  53:         return Sort.merge(left, right)
  54:     
--------------------------------------------------------------------------------
[0.08001 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
E   RecursionError: maximum recursion depth exceeded while calling a Python object
!!! Recursion detected (same locals & position)

   - [# 107] SIR sort1: 
--------------------------------------------------------------------------------
  46:         
  47:         if size <= 1:
  48:             return arr
  49:         
- 50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:half]))
+ 50:         (left, right) = (Sort.merge_sort(arr[half:]), Sort.merge_sort(arr[:]))
  51:         
  52:         
  53:         return Sort.merge(left, right)
  54:     
--------------------------------------------------------------------------------
[0.07922 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py::test_case_3

def test_case_3():
        sort_0 = module_0.Sort()
        str_0 = 'Z^[`[*-KJ8P&'
        sort_1 = module_0.Sort()
>       var_0 = sort_1.merge_sort(str_0)

DYNAMOSA-MOSA-WHOLE_SUITE/test_sort1_MOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
sort1:50: in merge_sort
    ???
E   RecursionError: maximum recursion depth exceeded while calling a Python object
!!! Recursion detected (same locals & position)

   - [# 108] SIR sort1: 
--------------------------------------------------------------------------------
  68:                 arr.append(right[right_cursor])
  69:                 right_cursor += 1
  70:         
  71:         if left:
- 72:             arr.extend(left[left_cursor:])
+ 72:             arr.extend(left[:])
  73:         if right:
  74:             arr.extend(right[right_cursor:])
  75:         return arr
  76:     
--------------------------------------------------------------------------------
[0.06894 s] survived

   - [# 109] SIR sort1: 
--------------------------------------------------------------------------------
  70:         
  71:         if left:
  72:             arr.extend(left[left_cursor:])
  73:         if right:
- 74:             arr.extend(right[right_cursor:])
+ 74:             arr.extend(right[:])
  75:         return arr
  76:     
  77:     
  78:     @staticmethod
--------------------------------------------------------------------------------
[0.06899 s] survived

   - [# 110] ZIL sort1: 
--------------------------------------------------------------------------------
  10:     def selection_sort(arr):''' Selection Sort
  11:             Complexity: O(n^2)
  12:         '''
  13:         for i in range(len(arr)):
- 14:             minimum = i
- 15:             for j in range(i + 1, len(arr)):
- 16:                 
- 17:                 if arr[j] < arr[minimum]:
- 18:                     minimum = j
- 19:             
- 20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
+ 14:             break
+ 15:         
+ 16:         
+ 17:         
+ 18:         
+ 19:         
+ 20:         
  21:         return arr
  22:     
  23:     
  24:     @staticmethod
--------------------------------------------------------------------------------
[0.06735 s] survived

   - [# 111] ZIL sort1: 
--------------------------------------------------------------------------------
  13:         for i in range(len(arr)):
  14:             minimum = i
  15:             for j in range(i + 1, len(arr)):
  16:                 
- 17:                 if arr[j] < arr[minimum]:
- 18:                     minimum = j
+ 17:                 break
+ 18:             
  19:             
  20:             (arr[minimum], arr[i]) = (arr[i], arr[minimum])
  21:         return arr
  22:     
--------------------------------------------------------------------------------
[0.06795 s] survived

   - [# 112] ZIL sort1: 
--------------------------------------------------------------------------------
  25:     def insertion_sort(arr):''' Insertion Sort
  26:             Complexity: O(n^2)
  27:         '''
  28:         for i in range(len(arr)):
- 29:             cursor = arr[i]
- 30:             pos = i
- 31:             while (pos > 0 and arr[pos - 1] > cursor):
- 32:                 
- 33:                 arr[pos] = arr[pos - 1]
- 34:                 pos = pos - 1
- 35:             
- 36:             arr[pos] = cursor
+ 29:             break
+ 30:         
+ 31:         
+ 32:         
+ 33:         
+ 34:         
+ 35:         
+ 36:         
  37:         return arr
  38:     
  39:     
  40:     @staticmethod
--------------------------------------------------------------------------------
[0.06844 s] survived
