   - [# 113] ZIL sort1: 
--------------------------------------------------------------------------------
  29:             cursor = arr[i]
  30:             pos = i
  31:             while (pos > 0 and arr[pos - 1] > cursor):
  32:                 
- 33:                 arr[pos] = arr[pos - 1]
- 34:                 pos = pos - 1
+ 33:                 break
+ 34:             
  35:             
  36:             arr[pos] = cursor
  37:         return arr
  38:     
--------------------------------------------------------------------------------
[0.06865 s] survived

   - [# 114] ZIL sort1: 
--------------------------------------------------------------------------------
  60:         arr = []
  61:         (left_cursor, right_cursor) = (0, 0)
  62:         while (left_cursor < len(left) and right_cursor < len(right)):
  63:             
- 64:             if left[left_cursor] <= right[right_cursor]:
- 65:                 arr.append(left[left_cursor])
- 66:                 left_cursor += 1
- 67:             else:
- 68:                 arr.append(right[right_cursor])
- 69:                 right_cursor += 1
+ 64:             break
+ 65:         
+ 66:         
+ 67:         
+ 68:         
+ 69:         
  70:         
  71:         if left:
  72:             arr.extend(left[left_cursor:])
  73:         if right:
--------------------------------------------------------------------------------
[0.06933 s] survived

   - [# 115] ZIL sort1: 
--------------------------------------------------------------------------------
  88:     
  89:     @staticmethod
  90:     def partition(arr, first, last):pivot = first
  91:         for pos in range(first, last):
- 92:             if arr[pos] < arr[last]:
- 93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
- 94:                 pivot += 1
+ 92:             break
+ 93:         
+ 94:         
  95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
  96:         return pivot
--------------------------------------------------------------------------------
[0.06730 s] survived
