   - [#  17] CDI sort1: 
--------------------------------------------------------------------------------
  85:             Sort.quick_sort(arr, first, pos - 1)
  86:             Sort.quick_sort(arr, pos + 1, last)
  87:     
  88:     
- 89:     @staticmethod
- 90:     def partition(arr, first, last):pivot = first
- 91:         for pos in range(first, last):
- 92:             if arr[pos] < arr[last]:
- 93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
- 94:                 pivot += 1
- 95:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
- 96:         return pivot
+ 89:     @staticmethod@classmethod
+ 90:     def partition(arr, first, last):
+ 91:         pivot = first
+ 92:         for pos in range(first, last):
+ 93:             if arr[pos] < arr[last]:
+ 94:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
+ 95:                 pivot += 1
+ 96:         (arr[pivot], arr[last]) = (arr[last], arr[pivot])
+ 97:         return pivot
--------------------------------------------------------------------------------
[0.06536 s] survived
