   - [#   1] AOR stack1: 
--------------------------------------------------------------------------------
   90:         The add function can also be accessed via the ``operator``
   91:         module.
   92:     """
   93:     stack = Stack()
-  94:     ops = {'+': lambda a, b: (a + b), \
+  94:     ops = {'+': lambda a, b: (a - b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
--------------------------------------------------------------------------------
[0.06472 s] survived

   - [#   2] AOR stack1: 
--------------------------------------------------------------------------------
   91:         module.
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
-  95:         '-': lambda a, b: (a - b), \
+  95:         '-': lambda a, b: (a + b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
--------------------------------------------------------------------------------
[0.06507 s] survived

   - [#   3] AOR stack1: 
--------------------------------------------------------------------------------
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
-  96:         '*': lambda a, b: (a * b), \
+  96:         '*': lambda a, b: (a / b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
--------------------------------------------------------------------------------
[0.06532 s] survived

   - [#   4] AOR stack1: 
--------------------------------------------------------------------------------
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
-  96:         '*': lambda a, b: (a * b), \
+  96:         '*': lambda a, b: (a // b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
--------------------------------------------------------------------------------
[0.06512 s] survived

   - [#   5] AOR stack1: 
--------------------------------------------------------------------------------
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
-  96:         '*': lambda a, b: (a * b), \
+  96:         '*': lambda a, b: (a ** b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
--------------------------------------------------------------------------------
[0.06513 s] survived

   - [#   6] AOR stack1: 
--------------------------------------------------------------------------------
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
-  97:         '/': lambda a, b: (a / b), \
+  97:         '/': lambda a, b: (a // b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
--------------------------------------------------------------------------------
[0.06551 s] survived

   - [#   7] AOR stack1: 
--------------------------------------------------------------------------------
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
-  97:         '/': lambda a, b: (a / b), \
+  97:         '/': lambda a, b: (a * b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
--------------------------------------------------------------------------------
[0.06909 s] survived

   - [#   8] AOR stack1: 
--------------------------------------------------------------------------------
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
-  98:         '%': lambda a, b: (a % b), \
+  98:         '%': lambda a, b: (a * b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
  102:     tokens = string.split(' ')
--------------------------------------------------------------------------------
[0.06479 s] survived

   - [#   9] AOR stack1: 
--------------------------------------------------------------------------------
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
-  99:         '^': lambda a, b: (a ** b)}
+  99:         '^': lambda a, b: (a * b)}
  100:     
  101:     
  102:     tokens = string.split(' ')
  103:     
--------------------------------------------------------------------------------
[0.06379 s] survived

   - [#  11] ASR stack1: 
--------------------------------------------------------------------------------
   31:         else:
   32:             top_data = self.top.data
   33:             
   34:             self.top = self.top.next
-  35:             self.size -= 1
+  35:             self.size += 1
   36:             return top_data
   37:     
   38:     def peek(self):
   39:         if self.top is None:
--------------------------------------------------------------------------------
[0.12548 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_11

def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError

   - [#  12] CDI stack1: 
--------------------------------------------------------------------------------
    3:     thomas moll 2015
    4: '''
    5: 
    6: class Stack(object):
-   7:     def __init__(self):
-   8:         self.size = 0
-   9:         self.top = None
-  10:     
+   7:     @classmethod
+   8:     def __init__(self):
+   9:         self.size = 0
+  10:         self.top = None
   11:     def __len__(self):
   12:         return self.size
   13:     
   14:     def push(self, item):
--------------------------------------------------------------------------------
[0.06564 s] survived

   - [#  14] CDI stack1: 
--------------------------------------------------------------------------------
   10:     
   11:     def __len__(self):
   12:         return self.size
   13:     
-  14:     def push(self, item):
-  15:         if self.top is None:
-  16:             self.top = StackNode(item)
-  17:         else:
-  18:             
-  19:             item1 = self.top
-  20:             item2 = StackNode(item)
-  21:             
+  14:     @classmethod
+  15:     def push(self, item):
+  16:         if self.top is None:
+  17:             self.top = StackNode(item)
+  18:         else:
+  19:             
+  20:             item1 = self.top
+  21:             item2 = StackNode(item)
   22:             
-  23:             self.top = item2
-  24:             item2.next = item1
-  25:         
-  26:         self.size += 1
-  27:     
+  23:             
+  24:             self.top = item2
+  25:             item2.next = item1
+  26:         
+  27:         self.size += 1
   28:     def pop(self):
   29:         if self.top is None:
   30:             raise ValueError()
   31:         else:
--------------------------------------------------------------------------------
[0.07301 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7:

   - [#  15] CDI stack1: 
--------------------------------------------------------------------------------
   24:             item2.next = item1
   25:         
   26:         self.size += 1
   27:     
-  28:     def pop(self):
-  29:         if self.top is None:
-  30:             raise ValueError()
-  31:         else:
-  32:             top_data = self.top.data
-  33:             
-  34:             self.top = self.top.next
-  35:             self.size -= 1
-  36:             return top_data
-  37:     
+  28:     @classmethod
+  29:     def pop(self):
+  30:         if self.top is None:
+  31:             raise ValueError()
+  32:         else:
+  33:             top_data = self.top.data
+  34:             
+  35:             self.top = self.top.next
+  36:             self.size -= 1
+  37:             return top_data
   38:     def peek(self):
   39:         if self.top is None:
   40:             raise ValueError()
   41:         else:
--------------------------------------------------------------------------------
[0.07375 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack1.Stack'>

   - [#  16] CDI stack1: 
--------------------------------------------------------------------------------
   34:             self.top = self.top.next
   35:             self.size -= 1
   36:             return top_data
   37:     
-  38:     def peek(self):
-  39:         if self.top is None:
-  40:             raise ValueError()
-  41:         else:
-  42:             return self.top.data
-  43: 
+  38:     @classmethod
+  39:     def peek(self):
+  40:         if self.top is None:
+  41:             raise ValueError()
+  42:         else:
+  43:             return self.top.data
   44: class StackNode(object):
   45:     ''' Look familiar? '''
   46:     def __init__(self, item):
   47:         self.data = item
--------------------------------------------------------------------------------
[0.07803 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_2

def test_case_2():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        with pytest.raises(ValueError):
>           stack_0.peek()

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:20: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack1.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute 'top'. Did you mean: 'pop'?

stack1:40: AttributeError

   - [#  17] CDI stack1: 
--------------------------------------------------------------------------------
   42:             return self.top.data
   43: 
   44: class StackNode(object):
   45:     ''' Look familiar? '''
-  46:     def __init__(self, item):
-  47:         self.data = item
-  48:         self.next = None
-  49: 
+  46:     @classmethod
+  47:     def __init__(self, item):
+  48:         self.data = item
+  49:         self.next = None
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
   53:     brackets = {'{': '}', '[': ']', '(': ')'}
--------------------------------------------------------------------------------
[0.06480 s] survived

   - [#  18] COI stack1: 
--------------------------------------------------------------------------------
   11:     def __len__(self):
   12:         return self.size
   13:     
   14:     def push(self, item):
-  15:         if self.top is None:
+  15:         if not (self.top is None):
   16:             self.top = StackNode(item)
   17:         else:
   18:             
   19:             item1 = self.top
--------------------------------------------------------------------------------
[0.06499 s] survived

   - [#  20] COI stack1: 
--------------------------------------------------------------------------------
   35:             self.size -= 1
   36:             return top_data
   37:     
   38:     def peek(self):
-  39:         if self.top is None:
+  39:         if not (self.top is None):
   40:             raise ValueError()
   41:         else:
   42:             return self.top.data
   43: 
--------------------------------------------------------------------------------
[0.07513 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_2

def test_case_2():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        with pytest.raises(ValueError):
>           stack_0.peek()

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:20: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbd909a0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

stack1:42: AttributeError

   - [#  21] COI stack1: 
--------------------------------------------------------------------------------
   53:     brackets = {'{': '}', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
-  57:         if character in brackets.keys():
+  57:         if not (character in brackets.keys()):
   58:             stack.push(character)
   59:         
   60:         
   61:         if character in brackets.values():
--------------------------------------------------------------------------------
[0.07364 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_3

def test_case_3():
        str_0 = 'Q[?#\\\')"v":\tCX|(x'
        stack_node_0 = module_0.StackNode(str_0)
>       var_0 = module_0.check_parenthesis(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'Q[?#\\\')"v":\tCX|(x'

>   ???
E   KeyError: ')'

stack1:66: KeyError

   - [#  22] COI stack1: 
--------------------------------------------------------------------------------
   53:     brackets = {'{': '}', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
-  57:         if character in brackets.keys():
+  57:         if character not in brackets.keys():
   58:             stack.push(character)
   59:         
   60:         
   61:         if character in brackets.values():
--------------------------------------------------------------------------------
[0.07419 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_3

def test_case_3():
        str_0 = 'Q[?#\\\')"v":\tCX|(x'
        stack_node_0 = module_0.StackNode(str_0)
>       var_0 = module_0.check_parenthesis(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'Q[?#\\\')"v":\tCX|(x'

>   ???
E   KeyError: ')'

stack1:66: KeyError

   - [#  23] COI stack1: 
--------------------------------------------------------------------------------
   57:         if character in brackets.keys():
   58:             stack.push(character)
   59:         
   60:         
-  61:         if character in brackets.values():
+  61:         if not (character in brackets.values()):
   62:             try:
   63:                 other = stack.pop()
   64:                 
   65:                 
--------------------------------------------------------------------------------
[0.07135 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_5

def test_case_5():
        bytes_0 = b'\x1a8\xa3\x01x\x91\xd5'
        str_0 = '`=r'
        var_0 = module_0.check_parenthesis(bytes_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:37: AssertionError

   - [#  24] COI stack1: 
--------------------------------------------------------------------------------
   57:         if character in brackets.keys():
   58:             stack.push(character)
   59:         
   60:         
-  61:         if character in brackets.values():
+  61:         if character not in brackets.values():
   62:             try:
   63:                 other = stack.pop()
   64:                 
   65:                 
--------------------------------------------------------------------------------
[0.07339 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_5

def test_case_5():
        bytes_0 = b'\x1a8\xa3\x01x\x91\xd5'
        str_0 = '`=r'
        var_0 = module_0.check_parenthesis(bytes_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:37: AssertionError

   - [#  25] COI stack1: 
--------------------------------------------------------------------------------
   62:             try:
   63:                 other = stack.pop()
   64:                 
   65:                 
-  66:                 if brackets[other] != character:
+  66:                 if not (brackets[other] != character):
   67:                     return False
   68:             
   69:             except ValueError:
   70:                 return False
--------------------------------------------------------------------------------
[0.08659 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_9

def test_case_9():
        str_0 = 'K*{g\\\nq1p\\j~,7`]'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:73: AssertionError

   - [#  26] COI stack1: 
--------------------------------------------------------------------------------
   68:             
   69:             except ValueError:
   70:                 return False
   71:     
-  72:     if stack.size != 0:
+  72:     if not (stack.size != 0):
   73:         return False
   74:     else:
   75:         
   76:         return True
--------------------------------------------------------------------------------
[0.07484 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_5

def test_case_5():
        bytes_0 = b'\x1a8\xa3\x01x\x91\xd5'
        str_0 = '`=r'
        var_0 = module_0.check_parenthesis(bytes_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:37: AssertionError

   - [#  27] COI stack1: 
--------------------------------------------------------------------------------
  102:     tokens = string.split(' ')
  103:     
  104:     for character in tokens:
  105:         
- 106:         if character in ops.keys():
+ 106:         if not (character in ops.keys()):
  107:             try:
  108:                 
  109:                 right = stack.pop()
  110:                 left = stack.pop()
--------------------------------------------------------------------------------
[0.07441 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:118: in postfix_eval
    ???
stack1:109: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb905ae0>

>   ???
E   ValueError

stack1:30: ValueError

   - [#  28] COI stack1: 
--------------------------------------------------------------------------------
  102:     tokens = string.split(' ')
  103:     
  104:     for character in tokens:
  105:         
- 106:         if character in ops.keys():
+ 106:         if character not in ops.keys():
  107:             try:
  108:                 
  109:                 right = stack.pop()
  110:                 left = stack.pop()
--------------------------------------------------------------------------------
[0.06970 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:118: in postfix_eval
    ???
stack1:109: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbe1c550>

>   ???
E   ValueError

stack1:30: ValueError

   - [#  29] COI stack1: 
--------------------------------------------------------------------------------
  126:             except ValueError as e:
  127:                 raise e
  128:     
  129:     
- 130:     if stack.size > 1:
+ 130:     if not (stack.size > 1):
  131:         raise ValueError()
  132:     
  133:     return stack.pop()
--------------------------------------------------------------------------------
[0.07197 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = '0'

>   ???
E   ValueError

stack1:131: ValueError

   - [#  33] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'mutpy': '}', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.09026 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_11

def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError

   - [#  34] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'': '}', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.08850 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_11

def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError

   - [#  35] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', 'mutpy': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.08590 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_5

def test_case_5():
        str_0 = '%V[^8\x0b3#niiMS&'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:50: AssertionError

   - [#  36] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', '': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.08677 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_5

def test_case_5():
        str_0 = '%V[^8\x0b3#niiMS&'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:50: AssertionError

   - [#  37] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', '[': ']', 'mutpy': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.07542 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_6

def test_case_6():
        str_0 = "X(@\\>u'G"
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:44: AssertionError

   - [#  38] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', '[': ']', '': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.07718 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_6

def test_case_6():
        str_0 = "X(@\\>u'G"
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:44: AssertionError

   - [#  39] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': 'mutpy', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.08518 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_11

def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError

   - [#  40] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.08961 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_11

def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError

   - [#  41] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', '[': 'mutpy', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.06900 s] survived

   - [#  42] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', '[': '', '(': ')'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.06516 s] survived

   - [#  43] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', '[': ']', '(': 'mutpy'}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.08871 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_4

def test_case_4():
        str_0 = 't)z?xNb)'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:31: AssertionError

   - [#  44] CRP stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     brackets = {'{': '}', '[': ']', '(': ''}
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.07615 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_4

def test_case_4():
        str_0 = 't)z?xNb)'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:31: AssertionError
