   - [#  45] CRP stack1: 
--------------------------------------------------------------------------------
   68:             
   69:             except ValueError:
   70:                 return False
   71:     
-  72:     if stack.size != 0:
+  72:     if stack.size != 1:
   73:         return False
   74:     else:
   75:         
   76:         return True
--------------------------------------------------------------------------------
[0.07533 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_5

def test_case_5():
        bytes_0 = b'\x1a8\xa3\x01x\x91\xd5'
        str_0 = '`=r'
        var_0 = module_0.check_parenthesis(bytes_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:37: AssertionError

   - [#  46] CRP stack1: 
--------------------------------------------------------------------------------
   90:         The add function can also be accessed via the ``operator``
   91:         module.
   92:     """
   93:     stack = Stack()
-  94:     ops = {'+': lambda a, b: (a + b), \
+  94:     ops = {'mutpy': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
--------------------------------------------------------------------------------
[0.06729 s] survived

   - [#  47] CRP stack1: 
--------------------------------------------------------------------------------
   90:         The add function can also be accessed via the ``operator``
   91:         module.
   92:     """
   93:     stack = Stack()
-  94:     ops = {'+': lambda a, b: (a + b), \
+  94:     ops = {'': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
--------------------------------------------------------------------------------
[0.06843 s] survived

   - [#  48] CRP stack1: 
--------------------------------------------------------------------------------
   91:         module.
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
-  95:         '-': lambda a, b: (a - b), \
+  95:         'mutpy': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
--------------------------------------------------------------------------------
[0.06733 s] survived

   - [#  49] CRP stack1: 
--------------------------------------------------------------------------------
   91:         module.
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
-  95:         '-': lambda a, b: (a - b), \
+  95:         '': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
--------------------------------------------------------------------------------
[0.06718 s] survived

   - [#  50] CRP stack1: 
--------------------------------------------------------------------------------
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
-  96:         '*': lambda a, b: (a * b), \
+  96:         'mutpy': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
--------------------------------------------------------------------------------
[0.06771 s] survived

   - [#  51] CRP stack1: 
--------------------------------------------------------------------------------
   92:     """
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
-  96:         '*': lambda a, b: (a * b), \
+  96:         '': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
--------------------------------------------------------------------------------
[0.06722 s] survived

   - [#  52] CRP stack1: 
--------------------------------------------------------------------------------
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
-  97:         '/': lambda a, b: (a / b), \
+  97:         'mutpy': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
--------------------------------------------------------------------------------
[0.06712 s] survived

   - [#  53] CRP stack1: 
--------------------------------------------------------------------------------
   93:     stack = Stack()
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
-  97:         '/': lambda a, b: (a / b), \
+  97:         '': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
--------------------------------------------------------------------------------
[0.06478 s] survived

   - [#  54] CRP stack1: 
--------------------------------------------------------------------------------
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
-  98:         '%': lambda a, b: (a % b), \
+  98:         'mutpy': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
  102:     tokens = string.split(' ')
--------------------------------------------------------------------------------
[0.08103 s] survived

   - [#  55] CRP stack1: 
--------------------------------------------------------------------------------
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
-  98:         '%': lambda a, b: (a % b), \
+  98:         '': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
  102:     tokens = string.split(' ')
--------------------------------------------------------------------------------
[0.06332 s] survived

   - [#  56] CRP stack1: 
--------------------------------------------------------------------------------
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
-  99:         '^': lambda a, b: (a ** b)}
+  99:         'mutpy': lambda a, b: (a ** b)}
  100:     
  101:     
  102:     tokens = string.split(' ')
  103:     
--------------------------------------------------------------------------------
[0.06464 s] survived

   - [#  57] CRP stack1: 
--------------------------------------------------------------------------------
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
   98:         '%': lambda a, b: (a % b), \
-  99:         '^': lambda a, b: (a ** b)}
+  99:         '': lambda a, b: (a ** b)}
  100:     
  101:     
  102:     tokens = string.split(' ')
  103:     
--------------------------------------------------------------------------------
[0.06645 s] survived

   - [#  58] CRP stack1: 
--------------------------------------------------------------------------------
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
- 102:     tokens = string.split(' ')
+ 102:     tokens = string.split('mutpy')
  103:     
  104:     for character in tokens:
  105:         
  106:         if character in ops.keys():
--------------------------------------------------------------------------------
[0.06811 s] survived

   - [#  59] CRP stack1: 
--------------------------------------------------------------------------------
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
- 102:     tokens = string.split(' ')
+ 102:     tokens = string.split('')
  103:     
  104:     for character in tokens:
  105:         
  106:         if character in ops.keys():
--------------------------------------------------------------------------------
[0.07062 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = '0'

>   ???
E   ValueError: empty separator

stack1:102: ValueError

   - [#  60] CRP stack1: 
--------------------------------------------------------------------------------
  126:             except ValueError as e:
  127:                 raise e
  128:     
  129:     
- 130:     if stack.size > 1:
+ 130:     if stack.size > 2:
  131:         raise ValueError()
  132:     
  133:     return stack.pop()
--------------------------------------------------------------------------------
[0.06784 s] survived

   - [#  61] EHD stack1: 
--------------------------------------------------------------------------------
   66:                 if brackets[other] != character:
   67:                     return False
   68:             
   69:             except ValueError:
-  70:                 return False
+  70:                 raise
   71:     
   72:     if stack.size != 0:
   73:         return False
   74:     else:
--------------------------------------------------------------------------------
[0.07568 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_4

def test_case_4():
        str_0 = 't)z?xNb)'
>       var_0 = module_0.check_parenthesis(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:63: in check_parenthesis
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbe35510>

>   ???
E   ValueError

stack1:30: ValueError

   - [#  62] EXS stack1: 
--------------------------------------------------------------------------------
   66:                 if brackets[other] != character:
   67:                     return False
   68:             
   69:             except ValueError:
-  70:                 return False
+  70:                 pass
   71:     
   72:     if stack.size != 0:
   73:         return False
   74:     else:
--------------------------------------------------------------------------------
[0.07714 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_4

def test_case_4():
        str_0 = 't)z?xNb)'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:31: AssertionError

   - [#  63] EXS stack1: 
--------------------------------------------------------------------------------
  114:                 stack.push(result)
  115:             
  116:             
  117:             except ValueError as e:
- 118:                 raise e
+ 118:                 pass
  119:         else:
  120:             
  121:             try:
  122:                 
--------------------------------------------------------------------------------
[0.06869 s] survived

   - [#  65] OIL stack1: 
--------------------------------------------------------------------------------
   66:                 if brackets[other] != character:
   67:                     return False
   68:             
   69:             except ValueError:
-  70:                 return False
+  70:                 return Falsebreak
   71:     
   72:     if stack.size != 0:
   73:         return False
   74:     else:
--------------------------------------------------------------------------------
[0.09136 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_3

def test_case_3():
        str_0 = 'Q[?#\\\')"v":\tCX|(x'
        stack_node_0 = module_0.StackNode(str_0)
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:26: AssertionError

   - [#  66] OIL stack1: 
--------------------------------------------------------------------------------
  123:                 value = int(character)
  124:                 stack.push(value)
  125:             
  126:             except ValueError as e:
- 127:                 raise e
+ 127:                 raise ebreak
  128:     
  129:     
  130:     if stack.size > 1:
  131:         raise ValueError()
--------------------------------------------------------------------------------
[0.06561 s] survived

   - [#  67] RIL stack1: 
--------------------------------------------------------------------------------
   51:     stack = Stack()
   52:     
   53:     brackets = {'{': '}', '[': ']', '(': ')'}
   54:     
-  55:     for character in string:
+  55:     for character in reversed(string):
   56:         
   57:         if character in brackets.keys():
   58:             stack.push(character)
   59:         
--------------------------------------------------------------------------------
[0.09014 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_11

def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError

   - [#  68] RIL stack1: 
--------------------------------------------------------------------------------
  100:     
  101:     
  102:     tokens = string.split(' ')
  103:     
- 104:     for character in tokens:
+ 104:     for character in reversed(tokens):
  105:         
  106:         if character in ops.keys():
  107:             try:
  108:                 
--------------------------------------------------------------------------------
[0.06337 s] survived

   - [#  69] ROR stack1: 
--------------------------------------------------------------------------------
   62:             try:
   63:                 other = stack.pop()
   64:                 
   65:                 
-  66:                 if brackets[other] != character:
+  66:                 if brackets[other] == character:
   67:                     return False
   68:             
   69:             except ValueError:
   70:                 return False
--------------------------------------------------------------------------------
[0.08119 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_9

def test_case_9():
        str_0 = 'K*{g\\\nq1p\\j~,7`]'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:73: AssertionError

   - [#  70] ROR stack1: 
--------------------------------------------------------------------------------
   68:             
   69:             except ValueError:
   70:                 return False
   71:     
-  72:     if stack.size != 0:
+  72:     if stack.size == 0:
   73:         return False
   74:     else:
   75:         
   76:         return True
--------------------------------------------------------------------------------
[0.07438 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_5

def test_case_5():
        bytes_0 = b'\x1a8\xa3\x01x\x91\xd5'
        str_0 = '`=r'
        var_0 = module_0.check_parenthesis(bytes_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:37: AssertionError

   - [#  71] ROR stack1: 
--------------------------------------------------------------------------------
  126:             except ValueError as e:
  127:                 raise e
  128:     
  129:     
- 130:     if stack.size > 1:
+ 130:     if stack.size < 1:
  131:         raise ValueError()
  132:     
  133:     return stack.pop()
--------------------------------------------------------------------------------
[0.06798 s] survived

   - [#  72] ROR stack1: 
--------------------------------------------------------------------------------
  126:             except ValueError as e:
  127:                 raise e
  128:     
  129:     
- 130:     if stack.size > 1:
+ 130:     if stack.size >= 1:
  131:         raise ValueError()
  132:     
  133:     return stack.pop()
--------------------------------------------------------------------------------
[0.07247 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = '0'

>   ???
E   ValueError

stack1:131: ValueError

   - [#  79] SDL stack1: 
--------------------------------------------------------------------------------
    4: '''
    5: 
    6: class Stack(object):
    7:     def __init__(self):
-   8:         self.size = 0
+   8:         pass
    9:         self.top = None
   10:     
   11:     def __len__(self):
   12:         return self.size
--------------------------------------------------------------------------------
[0.07170 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:124: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bba5c670>, item = 0

>   ???
E   AttributeError: 'Stack' object has no attribute 'size'

stack1:26: AttributeError

   - [#  80] SDL stack1: 
--------------------------------------------------------------------------------
    5: 
    6: class Stack(object):
    7:     def __init__(self):
    8:         self.size = 0
-   9:         self.top = None
+   9:         pass
   10:     
   11:     def __len__(self):
   12:         return self.size
   13:     
--------------------------------------------------------------------------------
[0.07203 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:124: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb95f7f0>, item = 0

>   ???
E   AttributeError: 'Stack' object has no attribute 'top'. Did you mean: 'pop'?

stack1:15: AttributeError

   - [#  82] SDL stack1: 
--------------------------------------------------------------------------------
   12:         return self.size
   13:     
   14:     def push(self, item):
   15:         if self.top is None:
-  16:             self.top = StackNode(item)
+  16:             pass
   17:         else:
   18:             
   19:             item1 = self.top
   20:             item2 = StackNode(item)
--------------------------------------------------------------------------------
[0.06984 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb8fb910>

>   ???
E   ValueError

stack1:30: ValueError

   - [#  83] SDL stack1: 
--------------------------------------------------------------------------------
   15:         if self.top is None:
   16:             self.top = StackNode(item)
   17:         else:
   18:             
-  19:             item1 = self.top
+  19:             pass
   20:             item2 = StackNode(item)
   21:             
   22:             
   23:             self.top = item2
--------------------------------------------------------------------------------
[0.07564 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_10

def test_case_10():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_0 = stack_0.push(stack_0)
        assert len(stack_0) == 1
        bytes_0 = b'\xd8'
>       var_1 = stack_0.push(var_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:70: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb86a260>, item = None

>   ???
E   NameError: name 'item1' is not defined

stack1:24: NameError

   - [#  84] SDL stack1: 
--------------------------------------------------------------------------------
   16:             self.top = StackNode(item)
   17:         else:
   18:             
   19:             item1 = self.top
-  20:             item2 = StackNode(item)
+  20:             pass
   21:             
   22:             
   23:             self.top = item2
   24:             item2.next = item1
--------------------------------------------------------------------------------
[0.07502 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_10

def test_case_10():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_0 = stack_0.push(stack_0)
        assert len(stack_0) == 1
        bytes_0 = b'\xd8'
>       var_1 = stack_0.push(var_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:70: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbb1c040>, item = None

>   ???
E   NameError: name 'item2' is not defined

stack1:23: NameError

   - [#  85] SDL stack1: 
--------------------------------------------------------------------------------
   19:             item1 = self.top
   20:             item2 = StackNode(item)
   21:             
   22:             
-  23:             self.top = item2
+  23:             pass
   24:             item2.next = item1
   25:         
   26:         self.size += 1
   27:     
--------------------------------------------------------------------------------
[0.08368 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_1

def test_case_1():
        float_0 = -1074.68
        stack_node_0 = module_0.StackNode(float_0)
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        stack_node_1 = module_0.StackNode(stack_0)
        assert len(stack_node_1.data) == 0
        stack_1 = module_0.Stack()
        assert len(stack_1) == 0
        var_0 = stack_1.push(stack_1)
        assert len(stack_1) == 1
        var_1 = stack_1.push(float_0)
        assert len(stack_1) == 2
        var_2 = stack_1.peek()
>       assert var_2 == pytest.approx(-1074.68, abs=0.01, rel=0.01)
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:26: AssertionError

   - [#  86] SDL stack1: 
--------------------------------------------------------------------------------
   20:             item2 = StackNode(item)
   21:             
   22:             
   23:             self.top = item2
-  24:             item2.next = item1
+  24:             pass
   25:         
   26:         self.size += 1
   27:     
   28:     def pop(self):
--------------------------------------------------------------------------------
[0.06446 s] survived

   - [#  87] SDL stack1: 
--------------------------------------------------------------------------------
   28:     def pop(self):
   29:         if self.top is None:
   30:             raise ValueError()
   31:         else:
-  32:             top_data = self.top.data
+  32:             pass
   33:             
   34:             self.top = self.top.next
   35:             self.size -= 1
   36:             return top_data
--------------------------------------------------------------------------------
[0.06888 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbb4e110>

>   ???
E   NameError: name 'top_data' is not defined

stack1:36: NameError

   - [#  88] SDL stack1: 
--------------------------------------------------------------------------------
   30:             raise ValueError()
   31:         else:
   32:             top_data = self.top.data
   33:             
-  34:             self.top = self.top.next
+  34:             pass
   35:             self.size -= 1
   36:             return top_data
   37:     
   38:     def peek(self):
--------------------------------------------------------------------------------
[0.06648 s] survived

   - [#  89] SDL stack1: 
--------------------------------------------------------------------------------
   32:             top_data = self.top.data
   33:             
   34:             self.top = self.top.next
   35:             self.size -= 1
-  36:             return top_data
+  36:             pass
   37:     
   38:     def peek(self):
   39:         if self.top is None:
   40:             raise ValueError()
--------------------------------------------------------------------------------
[0.07411 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
        var_0 = module_0.postfix_eval(str_0)
>       assert var_0 == 0
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:8: AssertionError

   - [#  90] SDL stack1: 
--------------------------------------------------------------------------------
   38:     def peek(self):
   39:         if self.top is None:
   40:             raise ValueError()
   41:         else:
-  42:             return self.top.data
+  42:             pass
   43: 
   44: class StackNode(object):
   45:     ''' Look familiar? '''
   46:     def __init__(self, item):
--------------------------------------------------------------------------------
[0.07864 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_11

def test_case_11():
        str_0 = ')'
        var_0 = module_0.check_parenthesis(str_0)
        assert var_0 is False
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_1 = stack_0.push(var_0)
        assert len(stack_0) == 1
        var_2 = stack_0.peek()
>       assert var_2 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:89: AssertionError

   - [#  91] SDL stack1: 
--------------------------------------------------------------------------------
   43: 
   44: class StackNode(object):
   45:     ''' Look familiar? '''
   46:     def __init__(self, item):
-  47:         self.data = item
+  47:         pass
   48:         self.next = None
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
--------------------------------------------------------------------------------
[0.07275 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb9177c0>

>   ???
E   AttributeError: 'StackNode' object has no attribute 'data'

stack1:32: AttributeError

   - [#  92] SDL stack1: 
--------------------------------------------------------------------------------
   44: class StackNode(object):
   45:     ''' Look familiar? '''
   46:     def __init__(self, item):
   47:         self.data = item
-  48:         self.next = None
+  48:         pass
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
--------------------------------------------------------------------------------
[0.07202 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb99fd90>

>   ???
E   AttributeError: 'StackNode' object has no attribute 'next'

stack1:34: AttributeError
