   - [#  93] SDL stack1: 
--------------------------------------------------------------------------------
   47:         self.data = item
   48:         self.next = None
   49: 
   50: def check_parenthesis(string):
-  51:     stack = Stack()
+  51:     pass
   52:     
   53:     brackets = {'{': '}', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
--------------------------------------------------------------------------------
[0.07359 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_3

def test_case_3():
        str_0 = 'Q[?#\\\')"v":\tCX|(x'
        stack_node_0 = module_0.StackNode(str_0)
>       var_0 = module_0.check_parenthesis(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'Q[?#\\\')"v":\tCX|(x'

>   ???
E   NameError: name 'stack' is not defined

stack1:58: NameError

   - [#  94] SDL stack1: 
--------------------------------------------------------------------------------
   49: 
   50: def check_parenthesis(string):
   51:     stack = Stack()
   52:     
-  53:     brackets = {'{': '}', '[': ']', '(': ')'}
+  53:     pass
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
--------------------------------------------------------------------------------
[0.07411 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_3

def test_case_3():
        str_0 = 'Q[?#\\\')"v":\tCX|(x'
        stack_node_0 = module_0.StackNode(str_0)
>       var_0 = module_0.check_parenthesis(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'Q[?#\\\')"v":\tCX|(x'

>   ???
E   NameError: name 'brackets' is not defined

stack1:57: NameError

   - [#  95] SDL stack1: 
--------------------------------------------------------------------------------
   54:     
   55:     for character in string:
   56:         
   57:         if character in brackets.keys():
-  58:             stack.push(character)
+  58:             pass
   59:         
   60:         
   61:         if character in brackets.values():
   62:             try:
--------------------------------------------------------------------------------
[0.07824 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_6

def test_case_6():
        str_0 = "X(@\\>u'G"
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:44: AssertionError

   - [#  96] SDL stack1: 
--------------------------------------------------------------------------------
   59:         
   60:         
   61:         if character in brackets.values():
   62:             try:
-  63:                 other = stack.pop()
+  63:                 pass
   64:                 
   65:                 
   66:                 if brackets[other] != character:
   67:                     return False
--------------------------------------------------------------------------------
[0.07422 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_3

def test_case_3():
        str_0 = 'Q[?#\\\')"v":\tCX|(x'
        stack_node_0 = module_0.StackNode(str_0)
>       var_0 = module_0.check_parenthesis(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'Q[?#\\\')"v":\tCX|(x'

>   ???
E   NameError: name 'other' is not defined

stack1:66: NameError

   - [#  97] SDL stack1: 
--------------------------------------------------------------------------------
   63:                 other = stack.pop()
   64:                 
   65:                 
   66:                 if brackets[other] != character:
-  67:                     return False
+  67:                     pass
   68:             
   69:             except ValueError:
   70:                 return False
   71:     
--------------------------------------------------------------------------------
[0.08530 s] killed by MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_9

def test_case_9():
        str_0 = 'K*{g\\\nq1p\\j~,7`]'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:73: AssertionError

   - [#  99] SDL stack1: 
--------------------------------------------------------------------------------
   69:             except ValueError:
   70:                 return False
   71:     
   72:     if stack.size != 0:
-  73:         return False
+  73:         pass
   74:     else:
   75:         
   76:         return True
   77: 
--------------------------------------------------------------------------------
[0.07784 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_6

def test_case_6():
        str_0 = "X(@\\>u'G"
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:44: AssertionError

   - [# 100] SDL stack1: 
--------------------------------------------------------------------------------
   72:     if stack.size != 0:
   73:         return False
   74:     else:
   75:         
-  76:         return True
+  76:         pass
   77: 
   78: def postfix_eval(string):
   79:     """ Here we setup a dictionary relating the characters of 
   80:         operations to lambda functions. It's similar to saying:
--------------------------------------------------------------------------------
[0.07451 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_5

def test_case_5():
        bytes_0 = b'\x1a8\xa3\x01x\x91\xd5'
        str_0 = '`=r'
        var_0 = module_0.check_parenthesis(bytes_0)
>       assert var_0 is True
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:37: AssertionError

   - [# 101] SDL stack1: 
--------------------------------------------------------------------------------
   89: 
   90:         The add function can also be accessed via the ``operator``
   91:         module.
   92:     """
-  93:     stack = Stack()
+  93:     pass
   94:     ops = {'+': lambda a, b: (a + b), \
   95:         '-': lambda a, b: (a - b), \
   96:         '*': lambda a, b: (a * b), \
   97:         '/': lambda a, b: (a / b), \
--------------------------------------------------------------------------------
[0.07085 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = '0'

>   ???
E   NameError: name 'stack' is not defined

stack1:124: NameError

   - [# 102] SDL stack1: 
--------------------------------------------------------------------------------
   90:         The add function can also be accessed via the ``operator``
   91:         module.
   92:     """
   93:     stack = Stack()
-  94:     ops = {'+': lambda a, b: (a + b), \
-  95:         '-': lambda a, b: (a - b), \
-  96:         '*': lambda a, b: (a * b), \
-  97:         '/': lambda a, b: (a / b), \
-  98:         '%': lambda a, b: (a % b), \
-  99:         '^': lambda a, b: (a ** b)}
+  94:     pass
+  95:     
+  96:     
+  97:     
+  98:     
+  99:     
  100:     
  101:     
  102:     tokens = string.split(' ')
  103:     
--------------------------------------------------------------------------------
[0.07107 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = '0'

>   ???
E   NameError: name 'ops' is not defined

stack1:106: NameError

   - [# 103] SDL stack1: 
--------------------------------------------------------------------------------
   98:         '%': lambda a, b: (a % b), \
   99:         '^': lambda a, b: (a ** b)}
  100:     
  101:     
- 102:     tokens = string.split(' ')
+ 102:     pass
  103:     
  104:     for character in tokens:
  105:         
  106:         if character in ops.keys():
--------------------------------------------------------------------------------
[0.07223 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = '0'

>   ???
E   NameError: name 'tokens' is not defined

stack1:104: NameError

   - [# 104] SDL stack1: 
--------------------------------------------------------------------------------
  105:         
  106:         if character in ops.keys():
  107:             try:
  108:                 
- 109:                 right = stack.pop()
+ 109:                 pass
  110:                 left = stack.pop()
  111:                 
  112:                 
  113:                 result = ops[character](left, right)
--------------------------------------------------------------------------------
[0.06622 s] survived

   - [# 105] SDL stack1: 
--------------------------------------------------------------------------------
  106:         if character in ops.keys():
  107:             try:
  108:                 
  109:                 right = stack.pop()
- 110:                 left = stack.pop()
+ 110:                 pass
  111:                 
  112:                 
  113:                 result = ops[character](left, right)
  114:                 stack.push(result)
--------------------------------------------------------------------------------
[0.06580 s] survived

   - [# 106] SDL stack1: 
--------------------------------------------------------------------------------
  109:                 right = stack.pop()
  110:                 left = stack.pop()
  111:                 
  112:                 
- 113:                 result = ops[character](left, right)
+ 113:                 pass
  114:                 stack.push(result)
  115:             
  116:             
  117:             except ValueError as e:
--------------------------------------------------------------------------------
[0.06373 s] survived

   - [# 107] SDL stack1: 
--------------------------------------------------------------------------------
  110:                 left = stack.pop()
  111:                 
  112:                 
  113:                 result = ops[character](left, right)
- 114:                 stack.push(result)
+ 114:                 pass
  115:             
  116:             
  117:             except ValueError as e:
  118:                 raise e
--------------------------------------------------------------------------------
[0.06572 s] survived

   - [# 108] SDL stack1: 
--------------------------------------------------------------------------------
  119:         else:
  120:             
  121:             try:
  122:                 
- 123:                 value = int(character)
+ 123:                 pass
  124:                 stack.push(value)
  125:             
  126:             except ValueError as e:
  127:                 raise e
--------------------------------------------------------------------------------
[0.07072 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = '0'

>   ???
E   NameError: name 'value' is not defined

stack1:124: NameError

   - [# 109] SDL stack1: 
--------------------------------------------------------------------------------
  120:             
  121:             try:
  122:                 
  123:                 value = int(character)
- 124:                 stack.push(value)
+ 124:                 pass
  125:             
  126:             except ValueError as e:
  127:                 raise e
  128:     
--------------------------------------------------------------------------------
[0.07287 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb9e4af0>

>   ???
E   ValueError

stack1:30: ValueError

   - [# 110] SDL stack1: 
--------------------------------------------------------------------------------
  129:     
  130:     if stack.size > 1:
  131:         raise ValueError()
  132:     
- 133:     return stack.pop()
+ 133:     pass
--------------------------------------------------------------------------------
[0.07362 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
        var_0 = module_0.postfix_eval(str_0)
>       assert var_0 == 0
E       AssertionError

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:8: AssertionError

   - [# 114] SVD stack1: 
--------------------------------------------------------------------------------
   11:     def __len__(self):
   12:         return self.size
   13:     
   14:     def push(self, item):
-  15:         if self.top is None:
+  15:         if top is None:
   16:             self.top = StackNode(item)
   17:         else:
   18:             
   19:             item1 = self.top
--------------------------------------------------------------------------------
[0.07197 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:124: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbd6a830>, item = 0

>   ???
E   NameError: name 'top' is not defined

stack1:15: NameError

   - [# 116] SVD stack1: 
--------------------------------------------------------------------------------
   15:         if self.top is None:
   16:             self.top = StackNode(item)
   17:         else:
   18:             
-  19:             item1 = self.top
+  19:             item1 = top
   20:             item2 = StackNode(item)
   21:             
   22:             
   23:             self.top = item2
--------------------------------------------------------------------------------
[0.08200 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_10

def test_case_10():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_0 = stack_0.push(stack_0)
        assert len(stack_0) == 1
        bytes_0 = b'\xd8'
>       var_1 = stack_0.push(var_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:70: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bb85f3d0>, item = None

>   ???
E   NameError: name 'top' is not defined

stack1:19: NameError

   - [# 120] SVD stack1: 
--------------------------------------------------------------------------------
   28:     def pop(self):
   29:         if self.top is None:
   30:             raise ValueError()
   31:         else:
-  32:             top_data = self.top.data
+  32:             top_data = top.data
   33:             
   34:             self.top = self.top.next
   35:             self.size -= 1
   36:             return top_data
--------------------------------------------------------------------------------
[0.07097 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbb5fa30>

>   ???
E   NameError: name 'top' is not defined

stack1:32: NameError

   - [# 122] SVD stack1: 
--------------------------------------------------------------------------------
   30:             raise ValueError()
   31:         else:
   32:             top_data = self.top.data
   33:             
-  34:             self.top = self.top.next
+  34:             self.top = top.next
   35:             self.size -= 1
   36:             return top_data
   37:     
   38:     def peek(self):
--------------------------------------------------------------------------------
[0.07094 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_0

def test_case_0():
        str_0 = '0'
>       var_0 = module_0.postfix_eval(str_0)

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1:133: in postfix_eval
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbe36350>

>   ???
E   NameError: name 'top' is not defined

stack1:34: NameError

   - [# 124] SVD stack1: 
--------------------------------------------------------------------------------
   35:             self.size -= 1
   36:             return top_data
   37:     
   38:     def peek(self):
-  39:         if self.top is None:
+  39:         if top is None:
   40:             raise ValueError()
   41:         else:
   42:             return self.top.data
   43: 
--------------------------------------------------------------------------------
[0.07653 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_2

def test_case_2():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        with pytest.raises(ValueError):
>           stack_0.peek()

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:20: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbb5cb50>

>   ???
E   NameError: name 'top' is not defined

stack1:39: NameError

   - [# 125] SVD stack1: 
--------------------------------------------------------------------------------
   38:     def peek(self):
   39:         if self.top is None:
   40:             raise ValueError()
   41:         else:
-  42:             return self.top.data
+  42:             return top.data
   43: 
   44: class StackNode(object):
   45:     ''' Look familiar? '''
   46:     def __init__(self, item):
--------------------------------------------------------------------------------
[0.07803 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_11

def test_case_11():
        str_0 = ')'
        var_0 = module_0.check_parenthesis(str_0)
        assert var_0 is False
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_1 = stack_0.push(var_0)
        assert len(stack_0) == 1
>       var_2 = stack_0.peek()

MOSA-WHOLE_SUITE/test_stack1_MOSA.py:88: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack1.Stack object at 0x7fc6bbcc8610>

>   ???
E   NameError: name 'top' is not defined

stack1:42: NameError

   - [# 128] ZIL stack1: 
--------------------------------------------------------------------------------
   53:     brackets = {'{': '}', '[': ']', '(': ')'}
   54:     
   55:     for character in string:
   56:         
-  57:         if character in brackets.keys():
-  58:             stack.push(character)
-  59:         
-  60:         
-  61:         if character in brackets.values():
-  62:             try:
-  63:                 other = stack.pop()
-  64:                 
-  65:                 
-  66:                 if brackets[other] != character:
-  67:                     return False
-  68:             
-  69:             except ValueError:
-  70:                 return False
+  57:         break
+  58:     
+  59:     
+  60:     
+  61:     
+  62:     
+  63:     
+  64:     
+  65:     
+  66:     
+  67:     
+  68:     
+  69:     
+  70:     
   71:     
   72:     if stack.size != 0:
   73:         return False
   74:     else:
--------------------------------------------------------------------------------
[0.07646 s] killed by MOSA-WHOLE_SUITE/test_stack1_MOSA.py::test_case_3

def test_case_3():
        str_0 = 'Q[?#\\\')"v":\tCX|(x'
        stack_node_0 = module_0.StackNode(str_0)
        var_0 = module_0.check_parenthesis(str_0)

   - [# 129] ZIL stack1: 
--------------------------------------------------------------------------------
  102:     tokens = string.split(' ')
  103:     
  104:     for character in tokens:
  105:         
- 106:         if character in ops.keys():
- 107:             try:
- 108:                 
- 109:                 right = stack.pop()
- 110:                 left = stack.pop()
- 111:                 
- 112:                 
- 113:                 result = ops[character](left, right)
- 114:                 stack.push(result)
- 115:             
- 116:             
- 117:             except ValueError as e:
- 118:                 raise e
- 119:         else:
- 120:             
- 121:             try:
- 122:                 
- 123:                 value = int(character)
- 124:                 stack.push(value)
- 125:             
- 126:             except ValueError as e:
- 127:                 raise e
+ 106:         break
+ 107:     
+ 108:     
+ 109:     
+ 110:     
+ 111:     
+ 112:     
+ 113:     
+ 114:     
+ 115:     
+ 116:     
+ 117:     
+ 118:     
+ 119:     
+ 120:     
+ 121:     
+ 122:
