   - [#   2] CDI stack2: 
--------------------------------------------------------------------------------
   3: 
   4:     Author: George Heineman
   5: '''
   6: class Stack:
-  7:     def __init__(self):
-  8:         '''Demonstrate using list as storage for a Stack.'''
-  9:         self.stack = []
- 10:     
+  7:     @classmethod
+  8:     def __init__(self):
+  9:         '''Demonstrate using list as storage for a Stack.'''
+ 10:         self.stack = []
  11:     def isEmpty(self):
  12:         '''Determines whether stack is empty. O(1) performance'''
  13:         return len(self.stack) == 0
  14:     
--------------------------------------------------------------------------------
[0.05517 s] survived

   - [#   3] CDI stack2: 
--------------------------------------------------------------------------------
   7:     def __init__(self):
   8:         '''Demonstrate using list as storage for a Stack.'''
   9:         self.stack = []
  10:     
- 11:     def isEmpty(self):
- 12:         '''Determines whether stack is empty. O(1) performance'''
- 13:         return len(self.stack) == 0
- 14:     
+ 11:     @classmethod
+ 12:     def isEmpty(self):
+ 13:         '''Determines whether stack is empty. O(1) performance'''
+ 14:         return len(self.stack) == 0
  15:     def push(self, v):
  16:         '''Push v onto the stack. O(1) performance.'''
  17:         self.stack.append(v)
  18:     
--------------------------------------------------------------------------------
[0.07097 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack2:21: in pop
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack2.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute 'stack'

stack2:14: AttributeError

   - [#   4] CDI stack2: 
--------------------------------------------------------------------------------
  11:     def isEmpty(self):
  12:         '''Determines whether stack is empty. O(1) performance'''
  13:         return len(self.stack) == 0
  14:     
- 15:     def push(self, v):
- 16:         '''Push v onto the stack. O(1) performance.'''
- 17:         self.stack.append(v)
- 18:     
+ 15:     @classmethod
+ 16:     def push(self, v):
+ 17:         '''Push v onto the stack. O(1) performance.'''
+ 18:         self.stack.append(v)
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
  21:         if self.isEmpty():
  22:             raise Exception('Stack is empty.')
--------------------------------------------------------------------------------
[0.07015 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
>       var_0 = stack_1.push(stack_1)

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack2.Stack'>, v = stack:[]

>   ???
E   AttributeError: type object 'Stack' has no attribute 'stack'

stack2:18: AttributeError

   - [#   6] CDI stack2: 
--------------------------------------------------------------------------------
  21:         if self.isEmpty():
  22:             raise Exception('Stack is empty.')
  23:         return self.stack.pop()
  24:     
- 25:     def __repr__(self):
- 26:         '''show representation.'''
- 27:         return 'stack:' + str(self.stack)
+ 25:     @classmethod
+ 26:     def __repr__(self):
+ 27:         '''show representation.'''
+ 28:         return 'stack:' + str(self.stack)
--------------------------------------------------------------------------------
[0.08160 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
        var_1 = stack_1.pop()
        assert stack_1.stack == []
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack2.Stack'
        assert var_1.stack == []
        stack_2 = module_0.Stack()
        var_2 = var_1.push(var_1)
        var_3 = var_1.isEmpty()
>       var_4 = stack_1.__repr__()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack2.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute 'stack'

stack2:28: AttributeError

   - [#   7] COI stack2: 
--------------------------------------------------------------------------------
  17:         self.stack.append(v)
  18:     
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
- 21:         if self.isEmpty():
+ 21:         if not (self.isEmpty()):
  22:             raise Exception('Stack is empty.')
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
--------------------------------------------------------------------------------
[0.06658 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[stack:[...]]

>   ???
E   Exception: Stack is empty.

stack2:22: Exception

   - [#   8] CRP stack2: 
--------------------------------------------------------------------------------
   9:         self.stack = []
  10:     
  11:     def isEmpty(self):
  12:         '''Determines whether stack is empty. O(1) performance'''
- 13:         return len(self.stack) == 0
+ 13:         return len(self.stack) == 1
  14:     
  15:     def push(self, v):
  16:         '''Push v onto the stack. O(1) performance.'''
  17:         self.stack.append(v)
--------------------------------------------------------------------------------
[0.06822 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[stack:[...]]

>   ???
E   Exception: Stack is empty.

stack2:22: Exception

   - [#   9] CRP stack2: 
--------------------------------------------------------------------------------
  18:     
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
  21:         if self.isEmpty():
- 22:             raise Exception('Stack is empty.')
+ 22:             raise Exception('mutpy')
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
--------------------------------------------------------------------------------
[0.05739 s] survived

   - [#  10] CRP stack2: 
--------------------------------------------------------------------------------
  18:     
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
  21:         if self.isEmpty():
- 22:             raise Exception('Stack is empty.')
+ 22:             raise Exception('')
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
--------------------------------------------------------------------------------
[0.05692 s] survived

   - [#  11] CRP stack2: 
--------------------------------------------------------------------------------
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
- 27:         return 'stack:' + str(self.stack)
+ 27:         return 'mutpy' + str(self.stack)
--------------------------------------------------------------------------------
[0.07342 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
        var_1 = stack_1.pop()
        assert stack_1.stack == []
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack2.Stack'
        assert var_1.stack == []
        stack_2 = module_0.Stack()
        var_2 = var_1.push(var_1)
        var_3 = var_1.isEmpty()
        var_4 = stack_1.__repr__()
>       assert var_4 == 'stack:[stack:[...]]'
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:17: AssertionError

   - [#  12] CRP stack2: 
--------------------------------------------------------------------------------
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
- 27:         return 'stack:' + str(self.stack)
+ 27:         return '' + str(self.stack)
--------------------------------------------------------------------------------
[0.07216 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
        var_1 = stack_1.pop()
        assert stack_1.stack == []
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack2.Stack'
        assert var_1.stack == []
        stack_2 = module_0.Stack()
        var_2 = var_1.push(var_1)
        var_3 = var_1.isEmpty()
        var_4 = stack_1.__repr__()
>       assert var_4 == 'stack:[stack:[...]]'
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:17: AssertionError

   - [#  13] ROR stack2: 
--------------------------------------------------------------------------------
   9:         self.stack = []
  10:     
  11:     def isEmpty(self):
  12:         '''Determines whether stack is empty. O(1) performance'''
- 13:         return len(self.stack) == 0
+ 13:         return len(self.stack) != 0
  14:     
  15:     def push(self, v):
  16:         '''Push v onto the stack. O(1) performance.'''
  17:         self.stack.append(v)
--------------------------------------------------------------------------------
[0.06960 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[stack:[...]]

>   ???
E   Exception: Stack is empty.

stack2:22: Exception

   - [#  19] SDL stack2: 
--------------------------------------------------------------------------------
   5: '''
   6: class Stack:
   7:     def __init__(self):
   8:         '''Demonstrate using list as storage for a Stack.'''
-  9:         self.stack = []
+  9:         pass
  10:     
  11:     def isEmpty(self):
  12:         '''Determines whether stack is empty. O(1) performance'''
  13:         return len(self.stack) == 0
--------------------------------------------------------------------------------
[0.06880 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
>       var_0 = stack_1.push(stack_1)

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[AttributeError("'Stack' object has no attribute 'stack'") raised in repr()] Stack object at 0x7f7674ac6c50>
v = <[AttributeError("'Stack' object has no attribute 'stack'") raised in repr()] Stack object at 0x7f7674ac6c50>

>   ???
E   AttributeError: 'Stack' object has no attribute 'stack'

stack2:17: AttributeError

   - [#  20] SDL stack2: 
--------------------------------------------------------------------------------
   9:         self.stack = []
  10:     
  11:     def isEmpty(self):
  12:         '''Determines whether stack is empty. O(1) performance'''
- 13:         return len(self.stack) == 0
+ 13:         pass
  14:     
  15:     def push(self, v):
  16:         '''Push v onto the stack. O(1) performance.'''
  17:         self.stack.append(v)
--------------------------------------------------------------------------------
[0.07165 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_5

def test_case_5():
        stack_0 = module_0.Stack()
        var_0 = stack_0.isEmpty()
>       assert var_0 is True
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:47: AssertionError

   - [#  21] SDL stack2: 
--------------------------------------------------------------------------------
  13:         return len(self.stack) == 0
  14:     
  15:     def push(self, v):
  16:         '''Push v onto the stack. O(1) performance.'''
- 17:         self.stack.append(v)
+ 17:         pass
  18:     
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
  21:         if self.isEmpty():
--------------------------------------------------------------------------------
[0.06892 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[]

>   ???
E   Exception: Stack is empty.

stack2:22: Exception

   - [#  22] SDL stack2: 
--------------------------------------------------------------------------------
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
  21:         if self.isEmpty():
  22:             raise Exception('Stack is empty.')
- 23:         return self.stack.pop()
+ 23:         pass
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
  27:         return 'stack:' + str(self.stack)
--------------------------------------------------------------------------------
[0.06874 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
        var_1 = stack_1.pop()
>       assert stack_1.stack == []
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:10: AssertionError

   - [#  23] SDL stack2: 
--------------------------------------------------------------------------------
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
- 27:         return 'stack:' + str(self.stack)
+ 27:         pass
--------------------------------------------------------------------------------
[0.06931 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
        var_1 = stack_1.pop()
        assert stack_1.stack == []
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack2.Stack'
        assert var_1.stack == []
        stack_2 = module_0.Stack()
        var_2 = var_1.push(var_1)
        var_3 = var_1.isEmpty()
        var_4 = stack_1.__repr__()
>       assert var_4 == 'stack:[stack:[...]]'
E       AssertionError

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:17: AssertionError

   - [#  25] SVD stack2: 
--------------------------------------------------------------------------------
   9:         self.stack = []
  10:     
  11:     def isEmpty(self):
  12:         '''Determines whether stack is empty. O(1) performance'''
- 13:         return len(self.stack) == 0
+ 13:         return len(stack) == 0
  14:     
  15:     def push(self, v):
  16:         '''Push v onto the stack. O(1) performance.'''
  17:         self.stack.append(v)
--------------------------------------------------------------------------------
[0.06990 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack2:21: in pop
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[stack:[...]]

>   ???
E   NameError: name 'stack' is not defined

stack2:13: NameError

   - [#  26] SVD stack2: 
--------------------------------------------------------------------------------
  13:         return len(self.stack) == 0
  14:     
  15:     def push(self, v):
  16:         '''Push v onto the stack. O(1) performance.'''
- 17:         self.stack.append(v)
+ 17:         stack.append(v)
  18:     
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
  21:         if self.isEmpty():
--------------------------------------------------------------------------------
[0.07047 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
>       var_0 = stack_1.push(stack_1)

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:8: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[], v = stack:[]

>   ???
E   NameError: name 'stack' is not defined

stack2:17: NameError

   - [#  27] SVD stack2: 
--------------------------------------------------------------------------------
  17:         self.stack.append(v)
  18:     
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
- 21:         if self.isEmpty():
+ 21:         if isEmpty():
  22:             raise Exception('Stack is empty.')
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
--------------------------------------------------------------------------------
[0.07106 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[stack:[...]]

>   ???
E   NameError: name 'isEmpty' is not defined

stack2:21: NameError

   - [#  28] SVD stack2: 
--------------------------------------------------------------------------------
  19:     def pop(self):
  20:         '''Remove topmost element and return it. O(1) performance.'''
  21:         if self.isEmpty():
  22:             raise Exception('Stack is empty.')
- 23:         return self.stack.pop()
+ 23:         return stack.pop()
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
  27:         return 'stack:' + str(self.stack)
--------------------------------------------------------------------------------
[0.07087 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
>       var_1 = stack_1.pop()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:9: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = stack:[stack:[...]]

>   ???
E   NameError: name 'stack' is not defined

stack2:23: NameError

   - [#  29] SVD stack2: 
--------------------------------------------------------------------------------
  23:         return self.stack.pop()
  24:     
  25:     def __repr__(self):
  26:         '''show representation.'''
- 27:         return 'stack:' + str(self.stack)
+ 27:         return 'stack:' + str(stack)
--------------------------------------------------------------------------------
[0.06850 s] killed by DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
        stack_1 = module_0.Stack()
        var_0 = stack_1.push(stack_1)
        var_1 = stack_1.pop()
        assert stack_1.stack == []
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack2.Stack'
        assert var_1.stack == []
        stack_2 = module_0.Stack()
        var_2 = var_1.push(var_1)
        var_3 = var_1.isEmpty()
>       var_4 = stack_1.__repr__()

DYNAMOSA-MOSA-WHOLE_SUITE/test_stack2_WHOLE_SUITE.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <[NameError("name 'stack' is not defined") raised in repr()] Stack object at 0x7f7674b58610>

>   ???
E   NameError: name 'stack' is not defined

stack2:27: NameError
