   - [#   1] AOD stack3: 
--------------------------------------------------------------------------------
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
  136:         
- 137:         return str(self.__stack.toArray()[::-1])
+ 137:         return str(self.__stack.toArray()[::1])
  138: 
  139: 
  140: if __name__ == '__main__':
  141:     pass
--------------------------------------------------------------------------------
[0.52920 s] survived

   - [#   2] AOR stack3: 
--------------------------------------------------------------------------------
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
  136:         
- 137:         return str(self.__stack.toArray()[::-1])
+ 137:         return str(self.__stack.toArray()[::+1])
  138: 
  139: 
  140: if __name__ == '__main__':
  141:     pass
--------------------------------------------------------------------------------
[0.54162 s] survived

   - [#  17] CDI stack3: 
--------------------------------------------------------------------------------
   96:             current = current.next
   97:         return str(arr)
   98: 
   99: class Stack:
- 100:     def __init__(self):
- 101:         self.__stack = SinglyLinkedList()
- 102:     
+ 100:     @classmethod
+ 101:     def __init__(self):
+ 102:         self.__stack = SinglyLinkedList()
  103:     def push(self, value: T) -> None:
  104:         
  105:         '''Add element to the top of the stack.'''
  106:         
--------------------------------------------------------------------------------
[0.64197 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_13

def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
        assert bool_0 is False
        stack_1 = module_0.Stack()
        var_1 = stack_0.pop()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack3.Node'
E       AssertionError

DYNAMOSA-MOSA/test_stack3_MOSA.py:111: AssertionError

   - [#  18] CDI stack3: 
--------------------------------------------------------------------------------
   99: class Stack:
  100:     def __init__(self):
  101:         self.__stack = SinglyLinkedList()
  102:     
- 103:     def push(self, value: T) -> None:
- 104:         
- 105:         '''Add element to the top of the stack.'''
- 106:         
- 107:         self.__stack.add(value)
- 108:     
+ 103:     @classmethod
+ 104:     def push(self, value: T) -> None:
+ 105:         
+ 106:         '''Add element to the top of the stack.'''
+ 107:         
+ 108:         self.__stack.add(value)
  109:     def pop(self) -> T:
  110:         
  111:         '''Remove element from the top of the stack.'''
  112:         
--------------------------------------------------------------------------------
[0.63322 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_10

def test_case_10():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        stack_0 = module_0.Stack()
        bool_0 = False
        none_type_0 = singly_linked_list_0.add(bool_0)
>       none_type_1 = stack_0.push(singly_linked_list_0)

DYNAMOSA-MOSA/test_stack3_MOSA.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack3.Stack'>
value = <stack3.SinglyLinkedList object at 0x7febb7c3dc00>

>   ???
E   AttributeError: type object 'Stack' has no attribute '_Stack__stack'

stack3:108: AttributeError

   - [#  19] CDI stack3: 
--------------------------------------------------------------------------------
  105:         '''Add element to the top of the stack.'''
  106:         
  107:         self.__stack.add(value)
  108:     
- 109:     def pop(self) -> T:
- 110:         
- 111:         '''Remove element from the top of the stack.'''
- 112:         
- 113:         return self.__stack.remove()
- 114:     
+ 109:     @classmethod
+ 110:     def pop(self) -> T:
+ 111:         
+ 112:         '''Remove element from the top of the stack.'''
+ 113:         
+ 114:         return self.__stack.remove()
  115:     def peek(self) -> T:
  116:         
  117:         '''View top element in the stack.'''
  118:         
--------------------------------------------------------------------------------
[0.59986 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_7

def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
        assert bool_0 is True
>       var_0 = stack_0.pop()

DYNAMOSA-MOSA/test_stack3_MOSA.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack3.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute '_Stack__stack'

stack3:114: AttributeError

   - [#  20] CDI stack3: 
--------------------------------------------------------------------------------
  111:         '''Remove element from the top of the stack.'''
  112:         
  113:         return self.__stack.remove()
  114:     
- 115:     def peek(self) -> T:
- 116:         
- 117:         '''View top element in the stack.'''
- 118:         
- 119:         return self.__stack.getHead()
- 120:     
+ 115:     @classmethod
+ 116:     def peek(self) -> T:
+ 117:         
+ 118:         '''View top element in the stack.'''
+ 119:         
+ 120:         return self.__stack.getHead()
  121:     def isEmpty(self) -> bool:
  122:         
  123:         '''Check if stack is empty.'''
  124:         
--------------------------------------------------------------------------------
[0.62581 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_11

def test_case_11():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.peek()

DYNAMOSA-MOSA/test_stack3_MOSA.py:94: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack3.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute '_Stack__stack'

stack3:120: AttributeError

   - [#  21] CDI stack3: 
--------------------------------------------------------------------------------
  117:         '''View top element in the stack.'''
  118:         
  119:         return self.__stack.getHead()
  120:     
- 121:     def isEmpty(self) -> bool:
- 122:         
- 123:         '''Check if stack is empty.'''
- 124:         
- 125:         return True if self.__stack.getSize() == 0 else False
- 126:     
+ 121:     @classmethod
+ 122:     def isEmpty(self) -> bool:
+ 123:         
+ 124:         '''Check if stack is empty.'''
+ 125:         
+ 126:         return True if self.__stack.getSize() == 0 else False
  127:     def getSize(self) -> int:
  128:         
  129:         '''Get size of the stack.'''
  130:         
--------------------------------------------------------------------------------
[0.58127 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_7

def test_case_7():
        stack_0 = module_0.Stack()
>       bool_0 = stack_0.isEmpty()

DYNAMOSA-MOSA/test_stack3_MOSA.py:58: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack3.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute '_Stack__stack'

stack3:126: AttributeError

   - [#  22] CDI stack3: 
--------------------------------------------------------------------------------
  123:         '''Check if stack is empty.'''
  124:         
  125:         return True if self.__stack.getSize() == 0 else False
  126:     
- 127:     def getSize(self) -> int:
- 128:         
- 129:         '''Get size of the stack.'''
- 130:         
- 131:         return self.__stack.getSize()
- 132:     
+ 127:     @classmethod
+ 128:     def getSize(self) -> int:
+ 129:         
+ 130:         '''Get size of the stack.'''
+ 131:         
+ 132:         return self.__stack.getSize()
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
  136:         
--------------------------------------------------------------------------------
[0.65377 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_12

def test_case_12():
        stack_0 = module_0.Stack()
        str_0 = stack_0.__str__()
        assert str_0 == '[None]'
        var_0 = stack_0.peek()
>       int_0 = stack_0.getSize()

DYNAMOSA-MOSA/test_stack3_MOSA.py:101: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack3.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute '_Stack__stack'

stack3:132: AttributeError

   - [#  23] CDI stack3: 
--------------------------------------------------------------------------------
  129:         '''Get size of the stack.'''
  130:         
  131:         return self.__stack.getSize()
  132:     
- 133:     def __str__(self) -> str:
- 134:         
- 135:         '''Get string representation of the stack.'''
- 136:         
- 137:         return str(self.__stack.toArray()[::-1])
- 138: 
+ 133:     @classmethod
+ 134:     def __str__(self) -> str:
+ 135:         
+ 136:         '''Get string representation of the stack.'''
+ 137:         
+ 138:         return str(self.__stack.toArray()[::-1])
  139: 
  140: if __name__ == '__main__':
  141:     pass
--------------------------------------------------------------------------------
[0.59037 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_5

def test_case_5():
        stack_0 = module_0.Stack()
>       str_0 = stack_0.__str__()

DYNAMOSA-MOSA/test_stack3_MOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack3.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute '_Stack__stack'

stack3:138: AttributeError

   - [#  41] CRP stack3: 
--------------------------------------------------------------------------------
  121:     def isEmpty(self) -> bool:
  122:         
  123:         '''Check if stack is empty.'''
  124:         
- 125:         return True if self.__stack.getSize() == 0 else False
+ 125:         return True if self.__stack.getSize() == 1 else False
  126:     
  127:     def getSize(self) -> int:
  128:         
  129:         '''Get size of the stack.'''
--------------------------------------------------------------------------------
[0.58976 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_7

def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       AssertionError

DYNAMOSA-MOSA/test_stack3_MOSA.py:59: AssertionError

   - [#  42] CRP stack3: 
--------------------------------------------------------------------------------
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
  136:         
- 137:         return str(self.__stack.toArray()[::-1])
+ 137:         return str(self.__stack.toArray()[::-2])
  138: 
  139: 
  140: if __name__ == '__main__':
  141:     pass
--------------------------------------------------------------------------------
[0.46430 s] survived

   - [#  52] ROR stack3: 
--------------------------------------------------------------------------------
  121:     def isEmpty(self) -> bool:
  122:         
  123:         '''Check if stack is empty.'''
  124:         
- 125:         return True if self.__stack.getSize() == 0 else False
+ 125:         return True if self.__stack.getSize() != 0 else False
  126:     
  127:     def getSize(self) -> int:
  128:         
  129:         '''Get size of the stack.'''
--------------------------------------------------------------------------------
[0.57780 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_7

def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       AssertionError

DYNAMOSA-MOSA/test_stack3_MOSA.py:59: AssertionError

   - [# 106] SDL stack3: 
--------------------------------------------------------------------------------
   97:         return str(arr)
   98: 
   99: class Stack:
  100:     def __init__(self):
- 101:         self.__stack = SinglyLinkedList()
+ 101:         pass
  102:     
  103:     def push(self, value: T) -> None:
  104:         
  105:         '''Add element to the top of the stack.'''
--------------------------------------------------------------------------------
[0.57496 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_5

def test_case_5():
        stack_0 = module_0.Stack()
>       str_0 = stack_0.__str__()

DYNAMOSA-MOSA/test_stack3_MOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack3.Stack object at 0x7febb79da2c0>

>   ???
E   AttributeError: 'Stack' object has no attribute '_Stack__stack'

stack3:137: AttributeError

   - [# 107] SDL stack3: 
--------------------------------------------------------------------------------
  103:     def push(self, value: T) -> None:
  104:         
  105:         '''Add element to the top of the stack.'''
  106:         
- 107:         self.__stack.add(value)
+ 107:         pass
  108:     
  109:     def pop(self) -> T:
  110:         
  111:         '''Remove element from the top of the stack.'''
--------------------------------------------------------------------------------
[0.60664 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_13

def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
>       bool_0 = var_0.isEmpty()
E       AttributeError: 'NoneType' object has no attribute 'isEmpty'

DYNAMOSA-MOSA/test_stack3_MOSA.py:107: AttributeError

   - [# 108] SDL stack3: 
--------------------------------------------------------------------------------
  109:     def pop(self) -> T:
  110:         
  111:         '''Remove element from the top of the stack.'''
  112:         
- 113:         return self.__stack.remove()
+ 113:         pass
  114:     
  115:     def peek(self) -> T:
  116:         
  117:         '''View top element in the stack.'''
--------------------------------------------------------------------------------
[0.61294 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_13

def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
        assert bool_0 is False
        stack_1 = module_0.Stack()
        var_1 = stack_0.pop()
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack3.Node'
E       AssertionError

DYNAMOSA-MOSA/test_stack3_MOSA.py:111: AssertionError

   - [# 109] SDL stack3: 
--------------------------------------------------------------------------------
  115:     def peek(self) -> T:
  116:         
  117:         '''View top element in the stack.'''
  118:         
- 119:         return self.__stack.getHead()
+ 119:         pass
  120:     
  121:     def isEmpty(self) -> bool:
  122:         
  123:         '''Check if stack is empty.'''
--------------------------------------------------------------------------------
[0.61791 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_13

def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
>       bool_0 = var_0.isEmpty()
E       AttributeError: 'NoneType' object has no attribute 'isEmpty'

DYNAMOSA-MOSA/test_stack3_MOSA.py:107: AttributeError

   - [# 110] SDL stack3: 
--------------------------------------------------------------------------------
  121:     def isEmpty(self) -> bool:
  122:         
  123:         '''Check if stack is empty.'''
  124:         
- 125:         return True if self.__stack.getSize() == 0 else False
+ 125:         pass
  126:     
  127:     def getSize(self) -> int:
  128:         
  129:         '''Get size of the stack.'''
--------------------------------------------------------------------------------
[0.57926 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_7

def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       AssertionError

DYNAMOSA-MOSA/test_stack3_MOSA.py:59: AssertionError

   - [# 111] SDL stack3: 
--------------------------------------------------------------------------------
  127:     def getSize(self) -> int:
  128:         
  129:         '''Get size of the stack.'''
  130:         
- 131:         return self.__stack.getSize()
+ 131:         pass
  132:     
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
--------------------------------------------------------------------------------
[0.51419 s] survived

   - [# 112] SDL stack3: 
--------------------------------------------------------------------------------
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
  136:         
- 137:         return str(self.__stack.toArray()[::-1])
+ 137:         pass
  138: 
  139: 
  140: if __name__ == '__main__':
  141:     pass
--------------------------------------------------------------------------------
[0.59852 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_5

def test_case_5():
        stack_0 = module_0.Stack()
        str_0 = stack_0.__str__()
>       assert str_0 == '[None]'
E       AssertionError

DYNAMOSA-MOSA/test_stack3_MOSA.py:49: AssertionError

   - [# 113] SIR stack3: 
--------------------------------------------------------------------------------
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
  136:         
- 137:         return str(self.__stack.toArray()[::-1])
+ 137:         return str(self.__stack.toArray()[:])
  138: 
  139: 
  140: if __name__ == '__main__':
  141:     pass
--------------------------------------------------------------------------------
[0.49630 s] survived

   - [# 148] SVD stack3: 
--------------------------------------------------------------------------------
  103:     def push(self, value: T) -> None:
  104:         
  105:         '''Add element to the top of the stack.'''
  106:         
- 107:         self.__stack.add(value)
+ 107:         __stack.add(value)
  108:     
  109:     def pop(self) -> T:
  110:         
  111:         '''Remove element from the top of the stack.'''
--------------------------------------------------------------------------------
[0.59434 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_10

def test_case_10():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        stack_0 = module_0.Stack()
        bool_0 = False
        none_type_0 = singly_linked_list_0.add(bool_0)
>       none_type_1 = stack_0.push(singly_linked_list_0)

DYNAMOSA-MOSA/test_stack3_MOSA.py:86: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack3.Stack object at 0x7febb7adb040>
value = <stack3.SinglyLinkedList object at 0x7febb7adbca0>

>   ???
E   NameError: name '_Stack__stack' is not defined

stack3:107: NameError

   - [# 149] SVD stack3: 
--------------------------------------------------------------------------------
  109:     def pop(self) -> T:
  110:         
  111:         '''Remove element from the top of the stack.'''
  112:         
- 113:         return self.__stack.remove()
+ 113:         return __stack.remove()
  114:     
  115:     def peek(self) -> T:
  116:         
  117:         '''View top element in the stack.'''
--------------------------------------------------------------------------------
[0.60138 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_7

def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
        assert bool_0 is True
>       var_0 = stack_0.pop()

DYNAMOSA-MOSA/test_stack3_MOSA.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack3.Stack object at 0x7febb7a802b0>

>   ???
E   NameError: name '_Stack__stack' is not defined

stack3:113: NameError

   - [# 150] SVD stack3: 
--------------------------------------------------------------------------------
  115:     def peek(self) -> T:
  116:         
  117:         '''View top element in the stack.'''
  118:         
- 119:         return self.__stack.getHead()
+ 119:         return __stack.getHead()
  120:     
  121:     def isEmpty(self) -> bool:
  122:         
  123:         '''Check if stack is empty.'''
--------------------------------------------------------------------------------
[0.62253 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_11

def test_case_11():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.peek()

DYNAMOSA-MOSA/test_stack3_MOSA.py:94: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack3.Stack object at 0x7febb7c170a0>

>   ???
E   NameError: name '_Stack__stack' is not defined

stack3:119: NameError

   - [# 151] SVD stack3: 
--------------------------------------------------------------------------------
  121:     def isEmpty(self) -> bool:
  122:         
  123:         '''Check if stack is empty.'''
  124:         
- 125:         return True if self.__stack.getSize() == 0 else False
+ 125:         return True if __stack.getSize() == 0 else False
  126:     
  127:     def getSize(self) -> int:
  128:         
  129:         '''Get size of the stack.'''
--------------------------------------------------------------------------------
[0.61018 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_7

def test_case_7():
        stack_0 = module_0.Stack()
>       bool_0 = stack_0.isEmpty()

DYNAMOSA-MOSA/test_stack3_MOSA.py:58: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack3.Stack object at 0x7febb7cfdf30>

>   ???
E   NameError: name '_Stack__stack' is not defined

stack3:125: NameError

   - [# 152] SVD stack3: 
--------------------------------------------------------------------------------
  127:     def getSize(self) -> int:
  128:         
  129:         '''Get size of the stack.'''
  130:         
- 131:         return self.__stack.getSize()
+ 131:         return __stack.getSize()
  132:     
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
--------------------------------------------------------------------------------
[0.62949 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_12

def test_case_12():
        stack_0 = module_0.Stack()
        str_0 = stack_0.__str__()
        assert str_0 == '[None]'
        var_0 = stack_0.peek()
>       int_0 = stack_0.getSize()

DYNAMOSA-MOSA/test_stack3_MOSA.py:101: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack3.Stack object at 0x7febb7a81c60>

>   ???
E   NameError: name '_Stack__stack' is not defined

stack3:131: NameError

   - [# 153] SVD stack3: 
--------------------------------------------------------------------------------
  133:     def __str__(self) -> str:
  134:         
  135:         '''Get string representation of the stack.'''
  136:         
- 137:         return str(self.__stack.toArray()[::-1])
+ 137:         return str(__stack.toArray()[::-1])
  138: 
  139: 
  140: if __name__ == '__main__':
  141:     pass
--------------------------------------------------------------------------------
[0.58506 s] killed by DYNAMOSA-MOSA/test_stack3_MOSA.py::test_case_5

def test_case_5():
        stack_0 = module_0.Stack()
>       str_0 = stack_0.__str__()

DYNAMOSA-MOSA/test_stack3_MOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack3.Stack object at 0x7febb7cc6590>

>   ???
E   NameError: name '_Stack__stack' is not defined

stack3:137: NameError
