26 : Job ID fbfaae4a59af420692c7f11f6d7e3b20
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ is "__main__":
     pass
RANDOM/test_stack3_RANDOM.py ........................................... [  2%]
........................................................................ [  5%]
........................................................................ [  9%]
........................................................................ [ 13%]
........................................................................ [ 16%]
........................................................................ [ 20%]
........................................................................ [ 24%]
........................................................................ [ 27%]
........................................................................ [ 31%]
........................................................................ [ 35%]
........................................................................ [ 38%]
........................................................................ [ 42%]
........................................................................ [ 46%]
........................................................................ [ 49%]
.

27 : Job ID 3eda9c286d1148c7afd35a6d2f560733
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ is not "__main__":
     pass
RANDOM/test_stack3_RANDOM.py ........................................... [  2%]
........................................................................ [  5%]
........................................................................ [  9%]
........................................................................ [ 13%]
........................................................................ [ 16%]
........................................................................ [ 20%]
........................................................................ [ 24%]
........................................................................ [ 27%]
........................................................................ [ 31%]
........................................................................ [ 35%]
........................................................................ [ 38%]
........................................................................ [ 42%]
........................................................................ [ 46%]
........................................................................ [
