   - [#  55] SDI stack4: 
--------------------------------------------------------------------------------
    5: 
    6:     Data attribute for data storage and Next for pointer to next node.
    7:     '''
    8:     
-   9:     def __init__(self, data, next_node=None):
-  10:         '''Attribute data and next_node.'''
-  11:         self.data = data
-  12:         self.next = next_node
-  13: 
+   9:     @staticmethod
+  10:     def __init__(self, data, next_node=None):
+  11:         '''Attribute data and next_node.'''
+  12:         self.data = data
+  13:         self.next = next_node
   14: 
   15: class LinkedList(object):
   16:     '''Method for linked list.
   17: 
--------------------------------------------------------------------------------
[0.07621 s] killed by MIO-WHOLE_SUITE/test_stack4_MIO.py::test_case_0

def test_case_0():
        str_0 = 'G0BByujKc^c[c+'
>       stack_0 = module_0.Stack(str_0)

MIO-WHOLE_SUITE/test_stack4_MIO.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack4:103: in __init__
    ???
stack4:35: in __init__
    ???
stack4:43: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = 'G', data = None, next_node = None

>   ???
E   AttributeError: 'str' object has no attribute 'data'

stack4:12: AttributeError

   - [#  63] SDI stack4: 
--------------------------------------------------------------------------------
   97:     If the stack is empty, attempts to call pop should raise an exception.
   98: 
   99:     '''
  100:     
- 101:     def __init__(self, data=None):
- 102:         '''Initialization.'''
- 103:         self._stack = LinkedList(data)
- 104:     
+ 101:     @staticmethod
+ 102:     def __init__(self, data=None):
+ 103:         '''Initialization.'''
+ 104:         self._stack = LinkedList(data)
  105:     def push(self, val):
  106:         '''Add val to the stack.'''
  107:         self._stack.push(val)
  108:     
--------------------------------------------------------------------------------
[0.07578 s] killed by MIO-WHOLE_SUITE/test_stack4_MIO.py::test_case_0

def test_case_0():
        str_0 = 'G0BByujKc^c[c+'
>       stack_0 = module_0.Stack(str_0)

MIO-WHOLE_SUITE/test_stack4_MIO.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = 'G0BByujKc^c[c+', data = None

>   ???
E   AttributeError: 'str' object has no attribute '_stack'

stack4:104: AttributeError
